{ 
   "product_name":"Better Than Sex Mascara",
   "product_type": "Mascara",
   "brand":"Too Faced",
   "url":"https://www.sephora.com/product/better-than-sex-mascara-P381000?icid2=products%20grid:p381000",
   "reviews":{ 
      "123445678":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"29 Feb 2016",
         "title":"bad mascara",
         "description":"This mascara is awful! I thought it would be amazing and was so excited that it was very high quality and expensive but it was such a disappointment. One coat on and it was so clumpy! Also, by the end of the day my under eyes were black from the mascara! Just horrible"
      },
      "beckamn":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"14 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"HG Demotion"
      },
      "Izziey":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"16 Jan 2014",
         "title":"Wanted to love it, but...",
         "description":"This mascara does everything that it claims. It makes your lashes look full, long, and fluffy. HOWEVER, it has ruined so many pairs of contact lenses for me... it flakes off and smudges onto the lens, making them blurry and useless! If I didn't wear contacts I would use this mascara, but I can't afford to keep throwing the lens away. I wouldn't recommend this for girls who wear contacts, but for those of you with glasses or 20/20 vision, go for it!!\n…read more"
      },
      "dkww":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"29 Mar 2014",
         "title":"Mascara",
         "description":"Stays on, no smudging. Good quality. Excellent looking"
      },
      "Euphora":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"11 Aug 2013",
         "title":"Dramatic but...",
         "description":"The brush is odd and it's very easy to overdo it. Every time I take the brush I think \"Ok, how am I gonna use it this time..\" But it's actually not that bad, just sort of intimidating and weird. Pros: *Packaging is definitely beautiful, as with all Too Faced products<3 *Seriously lengthens *Creates a sort of \"fanned out\" effect *Dramatic *Slight curl CONS *Sometimes TOO much product on brush (I noticed that if you take the brush out slowly, less product is on the brush as opposed to taking it out fast) *Apply more than 2 coats. You will regret it. *Not buildable *Somewhat clumpy I walked into Sephora not even thinking of trying this. I purchased one of the last few after I decided I might as well try a new mascara since I needed one. I had Hypnose Star on by Lancome...then I tried this mascara and I was shocked. My lashes perked up and appeared longer, opening up my eye! And I wasn't even using the brush that came with it! I INSTANTLY put it in my bag. I just hope I don't have any problems with clumping from too much product on the bristles as other reviewers. But right now, I definitely recommend! :)\n…read more"
      },
      "sunflowersweat":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Jul 2015",
         "title":"The best I've used.",
         "description":"Without fail, my lashes look longer, curled, dark, and multiplied with this mascara. Every time. When I first bought it I put it on in an excited rush and clumped all my lashes by applying in quick, shallow strokes. I feel this may be the issue for people who say the product clumps. The wand also collects bits of mascara at the end like any other, I just brush it back into the tube. The key here is to take your time. The wand really scoops and individualizes lashes so usually a second coat isn't necessary. Definitely recommend!\n…read more"
      },
      "lanibeth":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Apr 2014",
         "title":"Best Mascara in a Long Time",
         "description":"I am a mascara fanatic. I never leave the house without it. I love this mascara because it doesn't flake, the wand \"grabs\" your lashes to get tons of color on them, it's more wet than dry, but it does not uncurl my hard-to-curl lashes. The first week I had it, it was almost too wet and thick and clumped easily, but now it is the perfect consistency. With one coat, I get dramatic voluminous lashes that I can wear every day. With multiple coats, you have a night-out look. It's not the easiest to get on the bottom lashes, but it's not terrible if you take your time. Color is intense, and it's definitely worth the month. I've had to product for about 3 weeks now and love it.\n…read more"
      },
      "marcoelho":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"24 Jun 2016",
         "title":"SO DISAPPOINTED",
         "description":"So I've tested this mascara out a couple of times. I LOVED the travel size so I decided to buy the full size. Such a disappointment. It was fine to begin with but then I started to notice that there was just WAY too much mascara on the brush. I thought maybe my wiper had broke or I don't know something like that but the mascara was just clumped on the brush and wasn't being wiped off like it was supposed to be. I just recently purchased the waterproof version and was so excited to try it and the SAME exact thing happened again. It's so disappointing that there are such good reviews online and on youtube but no one has ever seemed to mention this problem. It cannot be possible that I am the only person experiencing this problem and it certainly cannot be possible that the same issue happened to just me, MORE THAN ONCE. I will definitely not be repurchasing this ever again.\n…read more"
      },
      "eponton":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"12 Jan 2017",
         "title":"disappointed",
         "description":"Got this mascara since it has great reviews, and I have to say it didn't live up to my expectations. It flakes off not long after putting it on leaving me with a raccoon look. Yes, the volume and lengthening are good, but what good is that if it only last an hour or two? I wouldn't recommend this."
      },
      "KKSSSSS":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"3 stars",
         "date":"14 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Smudges"
      },
      "keekeesierra":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"14 Oct 2016",
         "title":"Despite a few bad reviews, I decided to try this mascara. Long story short, I'm glad I did. However, it did take a few uses to get used to the brush and formula. The brush is large and the formula is a bit dry, but it does give a false-eyelash-like effect. It's my daily mascara now.\r\nI would give it five stars, but unfortunately it does tend to flake. Some applications are better than others. \r\nI would get the sample size and see if you like it before committing to it.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "Nilewater":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"20 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Best mascara ever"
      },
      "TheTempest":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Sep 2013",
         "title":"YESSS",
         "description":"I really needed a new mascara and I especially love love volume. I like length as well but to have thick lashes, just looks amazing. So an associate told me about better than S** so I said why not, I could always return it I suppose. No. No I won't be returning this. I went to a nearby store in excitement to use their mirror and within seconds, I fell in love. It's all in that brush. I honestly can't see why people wouldn't give this 5 stars. The volume is wild & it gave me some length as well. I don't have major lashes as it is, I think you need to just know how to apply it correctly, then you would get more out of your mascaras. But better than s** is amazing. Point blank.\n…read more"
      },
      "SNGDD":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"12 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"It's a no from me dawg"
      },
      "loriedee":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"6 Jun 2015",
         "title":"Terrible",
         "description":"Clumpy. Every time I used this mascara, someone would tell me that I had mascara under my eyes. This has not happened to me ever even with drug store brands. I am not one to return make-up, but I took this one back to Sephora."
      },
      "ogzy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"26 Apr 2014",
         "title":"awful awful awful",
         "description":"This mascara is is horrendous. I normally love big brushes but this one neither separated nor curled. My lashes ended looking short and stumpy and the mascara formula weighed them down and clumped. That and it gave me massive racoon eyes."
      },
      "mrsessie":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Nov 2015",
         "title":"Best Mascara Ever",
         "description":"I'm a makeup artist and this is thee best mascara I have ever used! It looks like false lashes. Full, voluminous, and flirty. My brides love it. I have used other highend brands like Dior, MUFE, Lancôme, and Bobbi brown but this tops them all."
      },
      "addiegb":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Aug 2013",
         "title":"Great",
         "description":"I LOVE THIS MASCARA its by far the best mascara I have ever had"
      },
      "Northbays97":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"3 stars",
         "date":"30 Aug 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"meh"
      },
      "tenerife":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"8 Jun 2016",
         "title":"Good, but not good enough",
         "description":"This mascara does AMAZING things to my lashes! It definitely lives up to the hype, but I did have a few issues before I give it 5 stars. First of all, there's literally nothing in this tube. I use mascara almost daily, and take good care of it (ex I don't pump the brush in and out) and this lasted me about 1 and a half months. For $23, I would expect it to have more product in it. Another issue is the extreme clumpiness that this mascara can have. On a good day, it lengthens and volumizes my lashes, but on a bad day it is a clumpy NIGHTMARE. If I'm on the run to get to work, I don't want to have to worry about having clumpy mascara, I just want to throw it on and be done with it. On days when I do a full face, this isn't an issue because I can usually take the time to use an eyelash comb and seperate them. But for people on the move, this can be hard. If this mascara had a little more product and was more reliable, I would definitely give it 5 stars\n…read more"
      },
      "ContactRose":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"21 Mar 2016",
         "title":"Fake Before and After Picture",
         "description":"I used my points to try out the sample size of this mascara and I loved it! However, after purchasing the full size I was VERY disappointed. I have short lashes and this mascara did nothing for me. It smears though out the day giving me panda eyes. I even topped it with a waterproof mascara. Curls does not last. The picture on the case is very deceiving. If you have beautiful long and thick lashes already then I would say this will work for you but if you have hooded eyelids and super short lashes it won't work for you. Sex is definite better then this mascara.\n…read more"
      },
      "whyhellohannah":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"3 stars",
         "date":"11 Oct 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Max volume.....and clumps!"
      },
      "andrealowell":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"6 Nov 2015",
         "title":"Tutorial",
         "description":"This mascara is best a week after opening. Upon first opening, there can be a lot of mascara on such a full spoolie, which can really trip ppl up. If you felt frustrated with this, try it again. It may have thickened up just a pitch for better control. Best for long lashes because of size of brush. I always have two in stock, because I'll use the almost gone mascara to use on lower lashes and use a comb and styler for my lashes. For an extra dramatic look, roll the brush repetitively over and through lashes to layer on the mascara. I have tried 50 mascaras and this is one of the best ones out there, currently, if you know how to use it.\n…read more"
      },
      "chellebelle16":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 May 2017",
         "title":"Disappointed",
         "description":"I have been wanting to try this mascara for months, finally purchased it and I'm definitely disappointed. My lashes are pretty good naturally, nice and long I just want volume. Maybe I need to try it a bit longer but honestly I'm not thrilled. It definitely transfers to my under eyes by noon and I have mascaras that I like much better with the same problem that I could use. Thinking about returning."
      },
      "snokiesunshine":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"10 Mar 2017",
         "title":"Am repurchasing",
         "description":"I purchased a sample and am waiting for my next one to come in the mail! I love this mascara. It adds volume to my lashes and lifts them right up! I usually only apply one coat. It also feels very soft and velvety on my lashes. The applicator has an hourglass shape and I feel like it makes it easier to reach the corners of my eyes without overcoating. Plus the packaging is so pretty! I think this will be my mascara from now on.\n…read more"
      },
      "ElysianDayGlow":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"1 star",
         "date":"8 Oct 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Don't fall into the hype!"
      },
      "sp2270":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"19 Nov 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Definitely thickens my lashes and love that. Surprisingly like the brush. I took off 1 star because the product in the tube seems to dry pretty quickly, flakes hours later and is not easy to get it off. I use micellar water to remove."
      },
      "sheeeeners":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"23 Jan 2015",
         "title":"Usually use Dior mascara",
         "description":"Let me start off by saying my lashes are long but I lack thickness because I used to get eyelash extensions and they would tear out clumps of my lashes. Just like how hair extensions can cause bald patches in your scalp so can extensions if you repeatedly get them. No matter how good the aesthetician it's going to damage your own lashes so if it's not broken don't fix it. Anyways, I seek volume so I usually use Diorshow's white conditioning fibre base than use the Dior's Classic black mascara. It's really good at creating length and volume but it's really pricey and finishes really quickly. There dosen't seem to be a lot of product in the tube. So I gave too faced a try. First, it a really thick formula. This is definitely for a false lashes type of effect not a natural look. I like that type of look so I was happy about that. The only thing is, it can be kind of clumpy so I tried using the white Dior mascara then used this over too. Perfection! By itself it was too clumpy but with the base I was able to apply two coats of this stuff without a problem. If you have problems with clumsiness or you have short stumpy lashes use a conditioning base underneath. I think this mascara is better for those with long lashes without volume than those with short thick lashes unless you lengthen them first. Lastly, it can be a bit dry and flaky because it's so thick but again, the conditioning base keeps it on better sort of like a primer does for your eyeshadow or foundation. As for the clumsiness I just use an eyelash comb. If you don't want to buy one use an a clean toothbrush for brushing out your lashes it works wonders.\n…read more"
      },
      "LoveSephora1221":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Oct 2013",
         "title":"Clumpy",
         "description":"When you're in a hurry and want some really fast volume, sure throw a coat of this on. But if you're trying to achieve perfect lashes this is not the one for you. I LOVE mascara and the sales assoc recommended this. Bad idea. It is very clumpy. I'll stick with Lancôme Doll Lashes or just plain Sephora Lash Plumper. They're Real by Benefit is also a favorite."
      },
      "maddieolivia":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Jul 2015",
         "title":"worth the price",
         "description":"I kind of hoped I wouldn't love this mascara so I could happily go back to my drugstore brand, but I can't go back. I LOVE this mascara. It is by no means waterproof, so don't wear it to the pool, but it is long-lasting. I've worn it in the heat and it stayed on all day. My eyelashes have never looked better. They are clump-free and full! I actually found that I really like that it's not waterproof because it comes off easily with makeup wipes, leaving my lashes feeling fresh. This is an absolute must-have.\n…read more"
      },
      "OhCara22":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Jun 2013",
         "title":"Love it!",
         "description":"This is good stuff! I usually only wear waterproof mascara but this is awesome! Stays put, rich black, and holds a curl. A lot of length and good volume. Definitely ordering when my sample runs out!"
      },
      "nat320":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Aug 2017",
         "title":"My ONLY mascara!",
         "description":"After buying 100 mascaras of different $$ range and ingredients this is my holy grail. It separates, lengthens and volumes. A must buy n my bag!!!"
      },
      "Pharebear":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"31 Aug 2015",
         "title":"Overpriced disappointment",
         "description":"When I went to Myrtle Beach a lady in a massive beauty store recommended that I try Too Faced Better than Sex Mascara, Retail Value: $23. When I came back into town I went to my local Sephora. I cannot express fully how disappointed I am in this product. From the moment I twisted open the tube of mascara it was already think and clumpy all over the brush. Despite my better judgment, I proceeded to apply the makeup. Immediately ran into issues simply applying it with the \"hour glass\" brush. Not only was it the most difficult to apply evenly but it smudged all over the place and made my eyelashes clump together. For such an expensive product, one would think they were getting a top notch \"better than sex\" product. Sadly this is not the case and I will deter anyone and EVERYONE away from this regrettable purchase.\n…read more"
      },
      "hrobertson825":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"9 Feb 2016",
         "title":"not a fan",
         "description":"This mascara is ok..just ok. It gets a little clumpy on my lashes and ends up looking too harsh."
      },
      "crazy4color":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"26 Jun 2013",
         "title":"MUST TRY, AMAZING!!!!!!!!!",
         "description":"I love everything about this mascara. From the beautiful pink tube to the amazing results. As a Sephora employee I was able to preview this product months ago, and I have been eagerly waiting for this to launch in stores and on sephora.com. It gives incredible volume and definition without clumping. You can stop with a couple of coats or just keep going for an exaggerated look. I highly recommend and will continue to use everyday. Hope you love it like I do.\n…read more"
      },
      "jasbee":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"18 Nov 2015",
         "title":"Over-hyped product",
         "description":"I bought this mascara because of the buzz behind it... some from the reviews on here, some from beauty aficionados such as myself. I caved and finally got it, but I was disappointed. It is a mediocre mascara, and definitely over-hyped. My lashes have a decent amount of volume, are long, black, and straight naturally. This mascara definitely makes my lashes look more volumized, but it didn't lengthen them and did not hold any curl. By the end of the day, my lashes straightened out and it flaked ALL day. I really tried to give this mascara multiple chances, but no luck. This mascara may work for others, but considering what I look for in a mascara, it didn't do the job for me.\n…read more"
      },
      "tifftreads":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"31 Dec 2014",
         "title":"Pure Ecstasy",
         "description":"This mascara took my lashes from invisible and non-existent to extraordinary! I have attached pictures for proof! One coat was nice and charming and two coats were so AMAZING that I sent pics to my friends lol."
      },
      "IAMiniquity":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"8 May 2017",
         "title":"One Month",
         "description":"Because I wanted to give it a fair review I used this product for a month before this. I was skeptical at first because of all the mixed reviews I'd read, it seemed like Better Than Sex Mascara (Eye-roll at the marketing) was a love it or hate it product. I ended up buying it on a whim. The first use I HATED, it caked on and gave me the length I wanted but it was spidery. After that use I scraped the excess product off before applying and it went on well. If I wore it for less than 4-5 hours it looked fantastic! After that, though, I had flakes everywhere. It also transferred, and on days where sweat or humidity was a factor it would get sticky (like it hadn't dried) and I'd notice it in my under eye. I think, for me, there are better products available.\n…read more"
      },
      "Rahbin33":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"21 Apr 2015",
         "title":"Wanted to love it",
         "description":"I really wanted to love this mascara because your lashes look amazing after application. Unfortunately though this mascara flakes off badly. Throughout the day I notice tons of black dots all over the under eye area. Lately, I've been putting a drugstore mascara on top of the final product to cut down on the flaking, and it helps a little but really makes the hefty price tag justifiable."
      },
      "Loves3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"7 Aug 2014",
         "title":"Definitely NOT better than $ex.",
         "description":"This was hyped up so much it's ridiculous. I received this as a deluxe sample and this is clumpy and just doesn't work right for my type of lashes. I have already long thick lashes-not sure if that makes a difference? It clumped up my lashes and made them look weird. If I wanted to make this look good I had to work at it and separate each lash myself and that defeats the purpose of a mascara. This was not it was all cracked up to be. It's NOT better than drugstore mascaras, and that's the truth.\n…read more"
      },
      "dalliance":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"14 Mar 2014",
         "title":"I purchased this mascara on a whim - I was looking for a volumizing and lengthening mascara that wasn't too wet. I have thin lashes that are decently long but aren't very thick at all. This mascara was perfect for what I needed! When I first pulled the wand out of the tube I thought to myself, \"wow this looks very thick\", but I found the formula very lightweight and applied very evenly on my lashes. Creates MAJOR volume and a decent amount of length. I love the shape of the brush, it grabs my lashes in all spots, however it's really easy to make a mess of the lower lash line because it's so big. This is a very expensive mascara as far as mascara goes, however I like that it's paraben free and is more or less one of the better well rounded mascara's that I've tried!\n\nPro's: tons of volume, perfect formula that isn't too dry or too wet.\nCon's: price is a little steep, brush is hard to manoeuvre around the lower lashes, not as lengthening as it could be.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "knittinmama":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"25 Mar 2014",
         "title":"Really love this mascara!",
         "description":"I have always loved dark, thick, long lashes. As I have gotten older, it has been harder to find mascaras that will do the job for my thinning, shorter, aging eyelashes. I have also lost some lashes from health issues. I tried Too Faced Better Than S** Mascara, despite the name, which frankly would have been a turn-off for me normally, because I got a free sample of it. (Funny, the review would not let me post the actual name of the mascara!) I am so glad I tried it! It is wonderful and gives me exactly the kind of eyelashes that I have always liked, full, long, thick, curled and very black. I even tested the staying power by wearing it overnight, and even then it did not smudge or flake off!! I have tried TONS of mascaras, and this is absolutely one of the top 2 for me, and I will definitely be getting more. The brush is fantastic. If you want beautiful big lashes, you should definitely try this. I heartily recommend it, especially for those of us who are older and having problems with our lashes disappearing!\n…read more"
      },
      "amn33":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"14 Oct 2014",
         "title":"Bummer",
         "description":"I was really looking forward to getting this mascara, but it ended up not being worth the $23 dollars. It looks good on, but is super clumpy when you apply it. Really wish it would have worked out."
      },
      "Nikkikopz":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"19 Jan 2017",
         "title":"DONT WASTE YOUR MONEY",
         "description":"This mascara does make your lashes look fuller and longer but the product does not last long. It is flakey and clumpy. It caused me to have major dark eyes after it flakes off during the day. This product was not good for my sensitive eyes and for the price I think it's a rip off."
      },
      "kaaramel":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"14 Jun 2015",
         "title":"Mini size is different",
         "description":"So I had used 2 of the mini bottles of this mascara and absolutely loved them, but whrn I finally bought the full-size, I was shocked by how clumpy it was! Compared the full size wand to the mini wand, and the mini has Way more bristles much closer together, so no clumps with the mini! Was disappointed by that, and will only be getting the minis of this mascara from now on-the full size is terribly clumpy."
      },
      "hsm87":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"12 Apr 2015",
         "title":"I gave into the hype and got this mascara, but it didn't do much for my very short lashes. I got decent length and not much volume. It worked just as good as my drugstore mascara.\nI think this is good for those with already medium length and long lasheslashes, otherwise it's not impressive on very short lashes.",
         "description":""
      },
      "Juni6":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"1 star",
         "date":"12 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Terrible raccoon eyea"
      },
      "MeganMarek":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"28 Jun 2013",
         "title":"THE best mascara",
         "description":"I generally don't have too many problems with mascara, but after using my sample of this stuff, apparently I was wrong. My lashes are very long and natural looking. I did use two coats but even after one it separated my lashes and did not clump a bit. With other mascaras, I feel like I used so much but with this, my lashes are not caked with product. When my sample runs out I will definitely purchase the full size.\n…read more"
      },
      "shellp27":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"23 Apr 2015",
         "title":"Marketing Ploy",
         "description":"The advertising on the packaging is a bit more than far fetched. Here is my take away from this product: - Does a nice job of volumizing - Doesn't lengthen any more than other mascara's i've used, including drug store brands. - FLAKY - just a few hours after applying this was flaking on my face. For this factor alone, I would not purchase again. Flaking leads to smudging etc. - Not too difficult to remove which is nice compared to some other leading brands.\n…read more"
      },
      "GeorgiaPeach7":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"1 Mar 2015",
         "title":"Very Disappointing",
         "description":"I was extremely disappointed with this mascara. For the price I paid I really thought it would be incredible. It does deliver great volume BUT it smears after a few hours of wearing. Also, even after washing my face I find mascara under my eyes for days."
      },
      "315gal":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"14 Aug 2017",
         "title":"Not better than sex for me",
         "description":"I finally caved trying this after reading so many great reviews. Unfortunately, for me, it was not meant to be. Despite the brush being great, I had a hard time applying this without getting too clumpy. I didn't find the result to be as volumizing as advertised and it smudged after only a few hours on me. Sigh. Conclusion: this mascara is not so sexy."
      },
      "autumnqueen1":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"11 Mar 2015",
         "title":"Not worth the price tag...",
         "description":"I bought this after reading such great reviews, but ended up being disappointed. I've had drugstore mascaras that work better than this one. Super flaky, made my lashes look clumpy, and I actually stopped putting it on my lower lashes because it would smear so badly throughout the day. I used this up, but will never repurchase."
      },
      "Cheldubb":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 Aug 2013",
         "title":"Amazing!",
         "description":"I purchased this item two weeks ago, and have been in complete love since! Highly recommended for anyone looking for long, lush, volumized lashes!"
      },
      "lilybell33":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"18 Oct 2014",
         "title":"meh",
         "description":"I like the way it looks when first applied but after a couple hours it fades and almost melts under my eye making it appear like I have bags under my eyes"
      },
      "superkid268":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Mar 2014",
         "title":"Lashes Look Fab!",
         "description":"I always thought that one mascara would be enough. Pick a favorite and stay with it. But, Too Faced's \"Better Than S*x\" made me realize there was room in my makeup bag for two awesome mascaras. This is my second favorite mascara after \"They're Real\" from Benefit. It gives lashes a TON of volume, and the brush shape is great for the upper lids. However, for the lower lids, the application can be a bit much and tends to get messy, so I've learned to use sparingly and carefully. Benefit's \"They're Real\" gives lashes more length, and the little ball at the end of the wand is helpful in creating more definition, including the bottom area. But! Too Faced \"Better Than S*x\" mascara has a couple of advantages over Benefit, in my opinion. 1) The brush is super soft and conforms beautifully to the top lashes 2) the volume and color tends to look darker. I am still using my sample size, but plan to splurge on the full-size when I run out. *Also, I think the Sephora auto-review thinks \"s*x\" is a dirty word and claims my review contains profanity. Haha.\n…read more"
      },
      "junglebeauty":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Jul 2013",
         "title":"Holy Grail!",
         "description":"I have found my holy grail mascara! Looks like falsies, no clumps, no smudging, not too hard to remove, not too time consuming to put on... Absolute perfection!"
      },
      "olderbeauty":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"28 Sep 2014",
         "title":"Volume and more volume",
         "description":"Very good at adding volume, dark black, okay on length. Also use \"yes their real\" from benefits which does better at length and defining. Great for quick morning one coat and done. When dressing up use this and then \"yes their real\" for perfect combo of length and volume. No problem with flaking and comes off with soap and water."
      },
      "sophiagrace":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"30 Jan 2014",
         "title":"One of the best high-end mascaras I've tried. It's a dry formula which I love. The brush is a perfect shape, no mascara goop on the end when you pull it out of the cylinder. This mascara leaves my lashes separated, voluminous &amp; longer, and soft to the touch. I have a trial size of this that I'm using, but I'd buy the full size when I run out.",
         "description":""
      },
      "amazingracie91":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Oct 2016",
         "title":"love it!",
         "description":"I absolutely love this mascara. It adds volume and length to my lashes. I hardly need an eyelash curler with this mascara. I would recommend if you have straight, short eyelashes like me"
      },
      "stephaniekate":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Feb 2014",
         "title":"SO GOOD!",
         "description":"The brush looks like a scary, clumpy disaster, but it's quite the opposite! I'm Asian and my lashes are very sparse and this mascara makes them lengthy, BLACK, and thick. Plus it does not flake off!"
      },
      "shrucker":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jun 2017",
         "title":"I do not understand the hype.",
         "description":"This mascara has got to be one of the most overrated products I've tried. It looks okay upon application, but within hours, the product was flaking off into my eyes. Absolutely horrible."
      },
      "mkaykobba":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"13 Nov 2015",
         "title":"Lumpy",
         "description":"I LOVE the brush and packaging, but as someone else stated, the formula is awful. It is so thick and messy. I also had problems with it transferring to the skin under my lower lashes throughout the day. Which is weird because when I applied this to my lower lashes it was fine in the morning hours, but by the afternoon the product had transferred onto my skin. Makes no sense. It never fails, it happens to me every time no matter what. I don't understand the hype.\n…read more"
      },
      "finchieface":{ 
         "extra_info":"<b>Skin Tone</b> Light",
         "stars":"5 stars",
         "date":"25 Jul 2013",
         "title":"Genuinely the best mascara I have ever tried!",
         "description":"As a major mascara lover, when I heard about this I instantly had to try it! I have used most of the big name mascara brands (They're Real, Hypnose etc) and was intrigued not only by the name but also by all the hype surrounding this. I wasn't expecting it to be as good as my favourite all time mascara, the Extreme Party Mascara from Bobbi Brown, but it runs circles around anything I have ever tried. With one sweep, such dramatic volume!\n…read more"
      },
      "aleexandraaa":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"2 Jan 2017",
         "title":"Ehh",
         "description":"I don't understand the hype about this mascara. I think the brush is great but I don't like the formula. This mascara flakes onto my face after it's on for a few hours. It makes my lashes look good right when I put it on but I can't get passed it flaking onto my face. ):"
      },
      "cupcakelicious":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 Jan 2014",
         "title":"full and long lashes",
         "description":"I love to try new mascaras and when I got a sample of this one it has been one of my top 3 mascara's so far. The brush is amazing, it gives you full,thick lashes. Helps define your lashes and is very black which is a priority for me. Only down fall is the cost of $30 when mascara last less time then anything else in your makeup box"
      },
      "madaraismine":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"28 Mar 2017",
         "title":"LOL",
         "description":"It's hilarious how overhyped and underwhelming this product is. I don't think it defines worth a darn,it lengthens kind of,but it's more effort than I can bare trying to get fierce lashes. It's pretty average,I wouldn't recommend."
      },
      "AlwaysHiccups":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"6 May 2016",
         "title":"IDK who you're sleeping with, but this is terrible",
         "description":"It goes on well and looks good on my lashes, but it falls off within hours, leaving black specs/smears under my eyes. I would NOT buy this product ever again, let alone call it better than sex. I was very disappointed with this product."
      },
      "am05":{ 
         "extra_info":"<b>Skin Tone</b> Deep",
         "stars":"4 stars",
         "date":"11 Mar 2017",
         "title":"Volume and lengthening",
         "description":"To be honest, this mascara is actually really good. I don't know why so many people are hating on it. Personally, it works fine for me. My lashes are not too short but also not too long, and with this mascara it gives it such great volume and length, it's incredible! The only thing I'd have to say is that after I guess 5 hours or so, it'll start to smudge. It doesn't clump if you apply it the right way."
      },
      "juliatilly":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"26 Oct 2016",
         "title":"Made my lashes look really pretty but I was disappointed in how it didn't stay on my lashes and I ended up having dark shadows under my eyes from the mascara.",
         "description":""
      },
      "Maricheeky":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"4 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Flakes off, embarrassing!"
      },
      "nzgirl93":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Aug 2016",
         "title":"I hate everything about this mascara. It's super clumpy and smudges and flakes everywhere. Don't waste your money",
         "description":""
      },
      "CountBabulon":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Aug 2015",
         "title":"Holy Grail Product",
         "description":"Don't listen to the reviews about clumping, I promise you it is user error. Wipe the wand before applying and don't go hog wild with the mascara and you are sure to achieve the greatest lashes of your life. I like this mascara 100x more then \"They're Real\", Dior Extase, Roller Lash, and the kat von d mascara. This mascara is perfection if you know how to apply mascara!"
      },
      "mere85":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Nov 2014",
         "title":"the best mascara!",
         "description":"This mascara is amazing! I have tried a lot of other expensive mascaras, and this is by far my favorite! It makes my lashes so long and thick, I never leave home without at least one coat!"
      },
      "AronCassy":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"3 May 2017",
         "title":"flakes badly",
         "description":"I LOVE how well this stuff instantly boosts length and volume of my lashes. But holy crud does it flake!! I tossed mine out because it just ended up as a million little freckles on my under eye area. So disappointing."
      },
      "StaceBabe":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"28 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"FLAKEY!"
      },
      "lorybear":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Jul 2016",
         "title":"I'll never use another...",
         "description":"Look, everyone is complaining about clumpiness and flakiness...and yes that does sometimes happen with this mascara...BUT...you will not find a mascara that gives you more length and volume to your lashes. I've tried drugstore and Sephora ones and this mascara turns my tint eyelashes into almost glue on fake eyelashes. To avoid a lot of clumping with this thick formula and super big brush, try wiping the excess mascara on the wand on the mouth of the container before applying. (you're really only gonna get clumps if you just pull it out and slap it on. The style of the mascara wand makes it have too much on it when you pull it out) I put 2-3 coats carefully and pluck the clumps off and I'm good to go.\n…read more"
      },
      "HannahTherese":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Dec 2015",
         "title":"My Holy Grail Mascara...with some caveats",
         "description":"First off, I LOVE this mascara. It delivers more volume in fewer coats than any mascara I've ever tried, and I've tried a lot of mascaras. In my experience, nothing comes close. And for this reason, I repurchase again and again. However, it's not for everyone. There are a few issues you may encounter: 1) It's MESSY until dry and will end up all over your hands, face, and makeup bag if you aren't careful. 2) It's not good for lower lashes. When I wore it on my lower lashes it gave me raccoon eyes, and the large brush makes it less than ideal for lower lash application. 3) It can clump. It is possible to keep it from clumping, but you have to wipe the excess off as you pull it out of the tube (which you should be doing with most mascaras anyway), and using a lash comb or separating mascara afterwards really helps. Bottom line, I gave it 5 stars because I'm hooked on the unparalleled volume. But if you like super defined, clump-free lashes, want a mascara that won't budge under any conditions, or like to apply your mascara in a hurry, this isn't it.\n…read more"
      },
      "lilyar":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"30 Mar 2016",
         "title":"Ugly Mascara",
         "description":"Too clumpy, flakey and weights down my eyelashes."
      },
      "Cheyenne28":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"27 Feb 2017",
         "title":"DO NOT WASTE YOUR MONEY",
         "description":"I wish I could give 0 stars, this mascara is literally the worst one I have ever used. Don't let all of these reviews fool you. This product is so incredibly overrated. This mascara looks so amazing when you first put it on, it gives great volume, but after it dries it immediately starts flaking off everywhere! By the end of the day my lashes look short and stubby and I have flakes all over my face. I have drugstore mascaras that are a million times better than this. Please do yourself a favor and stay far away from this mascara people! I will never purchase this again.\n…read more"
      },
      "BellaaBaaby":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"26 Jul 2016",
         "title":"FLAKES FLAKES FLAKES!",
         "description":"Very cute packaging but believe me It flakes ! After an hour it was all over my face :("
      },
      "ariel12":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"14 Nov 2014",
         "title":"Doesn't last",
         "description":"I wanted to love this so badly. It went on beautifully. I love the shape of the brush and it gave great length and volume, creating noticeable lashes that weren't clumpy or gross. However, after 4-5 hours it began to flake, causing major eye irritation, and left smudges under my eyes by the end of the day. Yet what remained on my lashes was oddly hard to remove... If you have problems with the staying power of mascaras or sensitive eyes I would skip this one.\n…read more"
      },
      "MsJustice":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"27 Mar 2014",
         "title":"Jaw-Dropping",
         "description":"I haven't reviewed anything yet, but this product was so unbelievable that I felt the need to share, especially since I tend to rely on reviews! I ordered this mascara because of the amazing reviews and was completely blown away upon my first application... My jaw literally dropped as I was applying the mascara! I've never seen my eyelashes look so long, full, and amazing. I have deep set eyes and was worried about the large brush, but I didn't have any issues at all. Further, I have tried several higher-end mascaras (inc. DiorShow) and my eyelashes have ended up either looking spider-like or uneven and clumpy, despite applying the product with the patience and technique required. This mascara (I tried to use its name, but the review police detected \"profanity\" - lol!!) did not clump or flake, and the application was smooth, and totally buildable, i.e. it didn't dry up after the first coat and chunk up or flake on the second. My eyelashes looked natural - or as natural as jaw-droppingly dramatic eyelashes can look - in the sense that each lash was coated and curled to perfection, and they fanned out beautifully, even after three coats (too much drama for day but suitable for night). Truly blown away by this mascara!\n…read more"
      },
      "kelschuey":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"1 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Doesn’t stay. It looks fantastic going on, but was all over under my eyes by early afternoon. I work a desk job and rarely have mascaras run."
      },
      "laurendarling":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"21 Apr 2014",
         "title":"Flakes so bad!",
         "description":"Love the look but going to exchange bc it flakes horribly into and around my eyes and irritates them"
      },
      "makeupfeinjay22":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"3 stars",
         "date":"12 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Wanted to love it"
      },
      "annieannie11":{ 
         "extra_info":"<b>Skin Tone</b> Olive",
         "stars":"1 star",
         "date":"29 Aug 2014",
         "title":"This looks amazing when you first put it on, but a couple hours later its all under my eyes and my lashes look as if I haven't put anything on. Super disappointing.",
         "description":""
      },
      "coffeelipstick":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"6 Aug 2013",
         "title":"awful",
         "description":"I've had this mascara for about a month. at first it was fine, nothing that blew me away but it added volume and was a nice rich black color. i've used this less than one time a day and something in the tube must have broken because now the brush comes out completely covered in mascara. there is no way to apply this and i plan on returning it to the store. overall, very unimpressed- i will be going back to a tried and true mascara i've used in the past.\n…read more"
      },
      "stacybaltimore":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Apr 2014",
         "title":"Meh",
         "description":"If this is actually \"Better than S*x\" to anyone, they should broaden their horizons. I liked the brush but found this is the flakiest mascara that I have ever used. By the end of the day I have black specks under my eyes every time I have worn it. I would not purchase this again."
      },
      "mariloveshair":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"17 Feb 2017",
         "title":"No Bueno!",
         "description":"I dont know what all the hipe is about ,this is one of the worst mascaras i have ever used . Its flakky , weights my eyelashes down and gives me raccon eyes ."
      },
      "sakuraroseh":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"19 Aug 2015",
         "title":"Great for length but very flakey",
         "description":"This mascara is very good for adding length to your lashes; however, it flakes a lot and ends up all over under my eyes."
      },
      "beachbirdie80":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Oct 2014",
         "title":"BEST MASCARA EVER!",
         "description":"Let's me start by disclosing I'm a mascara lover! Mascara is serious business.... This is the best mascara I've ever used hands down! Provides length and builds up easily to beef up your lashes! Holy grail status!"
      },
      "Mirosela":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"5 Oct 2016",
         "title":"Gives a lot of volume but smudges easily.",
         "description":"I adore how much volume it gave my lashes, but if you put too much by one coat your will get spider lashes. After half an hour on putting on the product I already see black smudges under my eyes; and I live in a dry climate."
      },
      "rafaelladaisy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"29 Nov 2016",
         "title":"Too flakey",
         "description":"At first I thought I was layering this too much, so I went about my day with one layer of mascara. It flakes down to my cheeks a lot and when I try to brush it off it leaves a black mark. Definitely not worth the hype, it is lengthening and thickening on the lash but so many other mascaras are. It's also very clumpy. Nothing special."
      },
      "grenadene":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"31 Jan 2017",
         "title":"meh",
         "description":"I tried to like this. The formula is ok but not amazing. The wand is impossible to get my itty bitty lashes it's just too bulky. This is pretty much for people who have long enough lashes not to need mascara :( bummer"
      },
      "aliya802":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Nov 2016",
         "title":"awesome",
         "description":"I LOVE THIS MASCARA! It made my eyelashes so full and beautiful but it wasn't very clumpy. If you're someone like me who really likes the full Volume look then I diffidently recommend this. The only problem that I have with it is that the brush is a little too big for me but no major problems."
      },
      "kirstenmichelle":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Apr 2017",
         "title":"flakes",
         "description":"I was so excited to try this mascara because everyone seems to love it. I like the why it looks on my lashes, but it flakes really bad on me."
      },
      "isabeldavis2324":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"7 Aug 2017",
         "title":"This product is just way too clumpy and flakes off when you have worn it for a couple of hours",
         "description":""
      },
      "Rachel281":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"27 Jul 2015",
         "title":"wanted to love it",
         "description":"I have wanted to try this mascara for years! I got a small tube in Sephora's Lash Stash kit. My lashes are medium length and straight. This mascara made them look awesome! However, a few hours later I had flakes all over my face and black smudges under my eyes that I had to wipe off. By the end of the work day, it didn't even look like I had mascara on. I am disappointed with the staying power of this mascara, especially since it looked great.\n…read more"
      },
      "GGxo":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"31 Dec 2013",
         "title":"Amazing!",
         "description":"This is my fourth time purchasing this mascara. I usually wore Chanel Inimitable, but I felt like it didn't last me very long. A SA recommended this to me, and I fell in love. I have naturally long lashes, so I look for something with great volume. This does it all-- lengthens, volumizes and curls. My lashes literally touch my eyebrows. It's a deep black color and it goes on like laquer, it is kind of shiny. I get complimented all the time on my lashes and asked many times if these are my real lashes. I have tried many many mascaras- Lancôme hypnose, benefit they're real, and DiorShow to name a few. This one blows them all out of the water. This mascara also doesn't clump- it actually separates my lashes and fans them out- one of my favorite things about it. The rose gold packaging is beautiful. The only thing I would complain about is that the top of the tube can get messy because it's a rather thick consistency, but then again that could just be me. I love this and I think everyone should give it a try!!\n…read more"
      },
      "MrsJustine":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"26 Oct 2014",
         "title":"Wonderful, but only for about 2 hours...",
         "description":"This mascara goes on beautifully and makes my lashes noticibly fuller and longer. Huge downside though is that it smudges really bad after about 2 hours. Leaves me with raccoon eyes. :("
      },
      "cambree":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"20 Jul 2014",
         "title":"Great product",
         "description":"A really great product for curling and defining lashes. Below I have photos of my eyes, one with one coat of the mascara, one without any mascara. No retouching done. The product does tend to clump slightly with additional coats, but overall there is a great intense color and great definition."
      },
      "Aisha09":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Apr 2016",
         "title":"waste of money",
         "description":"I really wanted to love this mascara. I bought it after reading good reviews and the travel size was a hit. The first time I tried it on, it was great. Lashes looked good and surprisingly I was getting compliments (never thought anyone would notices my lashes). Second time, the brush came out wet and spilled the product everywhere. Even when I tried to close the tube, the product just...squeezed out. This doesn't happen with the travel size but $12 is too much for a travel sized mascara.\n…read more"
      },
      "tracygirl64":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"7 Jul 2013",
         "title":"I'm returning it!",
         "description":"I decided to try this mascara and expected it to be so great after reading all of the reviews. I'm sorry, but my current mascara is WAY better than this one! I have a lot of eyelashes that are fine and bone straight, so I have to use a curler and I always look for a mascara that can provide good volume to my lashes. This mascara weighed my lashes down, it did not hold a curl at all like it says it will. It's also very clumpy and hard to remove when you want to take it off. The brush is big, so it's hard to get your inner lashes too. The only thing this mascara did do is provide good volume to my lashes and I like that it is formulated without parabens. Other than that, I'm sorry, but I do not recommend this mascara...I'm actually surprised by all of the great reviews.\n…read more"
      },
      "asaps":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"22 Jun 2015",
         "title":"Melts",
         "description":"I loved this product, it added so much lengths and I've gotten a lot of compliments. Except I have to wear it with the bare minerals locked and coated top coat mascara, Otherwise it would melt down really fast"
      },
      "summybear":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"16 Jan 2017",
         "title":"MAJOR FALL OUT!!",
         "description":"So I LOVE the way this looks at first, lots of volume and super dark, but let's say 3 hours in, things go tragic. Major falling and flaking. I absolutely CANNOT put it on my lower lashes because I will look like a raccoon. And the upper lashes are basically bare if I slightly touch them. The formula also dries out insanely fast and I had to throw the tube out after a month and a half--I only wear mascara on weekends. I've bought the water proof, and I've had better experiences with it, but I'm going back to my good ole Dior show.\n…read more"
      },
      "jwest449":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"29 Apr 2017",
         "title":"terrible",
         "description":"This product had so much hype around it that I was excited to try it out for myself. And It has to be one of the worst products I've ever tried. The formula was dry and the product took quite a few brush strokes just to build a solid layer on my eyelashes, at which point it became clumpy. It didn't seem to add any length what so ever and about an hour later it started to flake off. I generally like most too faced products but I absolutely hated this one.\n…read more"
      },
      "sheerbeauty":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"4 stars",
         "date":"18 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Slight Flaking but BEAUTIFUL"
      },
      "iluvtrees9":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"17 Feb 2014",
         "title":"Thick, full lashes",
         "description":"Curls them and i love how it lets me attain that thick, TWIGGY look but still separates them!"
      },
      "angelori56":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"25 Mar 2014",
         "title":"Best Ever!!!",
         "description":"For all the Many mascaras that I have tried, used, liked, hate or reacted to, I say, good bye to you!!! I Love this Too Faced Mascara. It does exactly what I need it to & looks amazing. I have light, thin, short lashes & this stuff maximizes them to their fullest without looking cheap or clumpy. It is the best."
      },
      "asian1026":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"14 Oct 2014",
         "title":"One of the more underrated mascara",
         "description":"A Holy Grail Product. I consider this mascara way better than the They're Real mascara from Benefit. Both formulas are very silky and strong that allows your lashes to be coated with the utmost length and volume. However, this mascara brush has softer bristles that allow for more volume in just one coat. This formula coupled with this brush gives you lashes like never before. Lashes coated to length and volume that brightens and opens your eyes; it also gives the illusion of fake lashes! All in all, a product all must try.\n…read more"
      },
      "kuljitxo":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"29 Aug 2016",
         "title":"Love and Hate",
         "description":"I have heard so many great reviews about this mascara so I decided to give it a go myself. This mascara really volumizes my lashes and makes them thick and long which I love but when I apply it, the mascara looks very clumpy. This problem seems to go away as I go through my day but I wish it wasn't there in the first place. I would recommend this mascara to people who want to make their lashes look very long and thick\n…read more"
      },
      "KarolinaWhaley":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"20 Apr 2016",
         "title":"Flakes off",
         "description":"The application is wet but it makes your lashes very thick and dark. However I do have a couple complaints. 1. The brush is clumpy looking and has a lot of product on it so my lashes do clump up. 2. It flakes off. BAD! When I get home after school I can clearly see the flakes under my lower lash line and on my cheeks If you have time to clean these throughout the day then this is a great mascara but if not then i wouldn't recommend\n…read more"
      },
      "rb97":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"17 Mar 2015",
         "title":"i tried",
         "description":"For the longest time i was trying so hard to love this mascara. And i did, during the fall/winter time. When it got hotter and more humid out, i had raccoon eyes every single day. This mascara really dries up and falls off my lashes. I recommend this for the colder season. Just not when it's hot out. It's a great product nonetheless!"
      },
      "asali":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Jul 2014",
         "title":"no it's not better than...",
         "description":"Raccoon eyes after 2-3 hrs. No thank u."
      },
      "firepail":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Sep 2016",
         "title":"I wish I could give this negative stars! terrible!",
         "description":"at first it seems like this mascara really delivers, volume, length, easy to use--VAVOOM lashes. but then, nearly immediately, the black starts to travel into dark rings under the eye. NOT CUTE. on the dryest of dry days, it runs under the eyes and I don't have oily skin or problems with excessive sweating or squirt gun myself in the face randomly. GOD HELP YOU if you wear this and it gets humid, or there's a raindrop, or your hot coffee is steamy while you drink it because this will be everywhere in the least cute of ways. I HATE IT and wouldn't gift it to my worst enemy.\n…read more"
      },
      "ohokaymaya":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"11 May 2016",
         "title":"not impressed",
         "description":"I thought this was going to be my holy grail mascara but it was just a big disappointment. My lashes look clumpy and it starts flaking off after a few hours. I always get those dreaded black smudges around the eyes too when I use this which is unacceptable in my book for $20 mascara."
      },
      "VavaMarie":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"26 Nov 2014",
         "title":"LOVE IT!",
         "description":"First of all I am an eyeliner and mascara freak, obsessed with both. I got this mascara as a 100 point perk, I was unsure about it at first until I took the time to apply it properly. And....IN LOVE! It makes my lashes look plush, long, and very black with a soft look. I see people complaining that it flakes after so many hours etc...no makeup is forever perfect or has 100% staying power no matter what the description claims. Yes it flakes a little by the end of the day, but it's nothing a little touch up can't fix. I would rather have soft long looking lashes then crispy gel looking lashes like most mascaras I have tried.\n…read more"
      },
      "nycgirlinok":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"22 Mar 2016",
         "title":"mascara disappointment",
         "description":"I was very disappointed in the product. It flakes and smears badly, but it does lengthen great. I would not buy this product again."
      },
      "kimmyfaye":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"15 Nov 2016",
         "title":"Great mascara",
         "description":"After reading mixed reviews about this product I was happy to be able to purchase a mini one with my points. I was concerned when I read about it flaking. Well, I'm not sure about others, but I took this product to Mexico in 75% humidity and there was no flaking or smearing. It really darkens and lengthens my lashes. I'm highly impressed with the volume and product itself. I will continue to use this mascara.\n…read more"
      },
      "SpookySpooks":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"16 Mar 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"A miss for me, sadly!"
      },
      "melinda123":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"5 May 2016",
         "title":"ok",
         "description":"Love how it makes my lashes look but flakes a lot and for some reason I'm always getting this on my upper eyelid :/"
      },
      "AAMCWING":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"19 Oct 2016",
         "title":"Love this!!!",
         "description":"Tried the travel size to see if I would like it! Love it! I was using 2 different drugstore brands to achieve the effect I wanted. This one covers it!!!"
      },
      "besteyeshadow":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"17 Mar 2014",
         "title":"Best Mascara Ever",
         "description":"This is the best mascara I have ever used. You can do both eyes - upper and lower with one time out of the bottle."
      },
      "xoltaylor":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"24 May 2015",
         "title":"Smudges like crazy!",
         "description":"Not only is this quiet clumpy if you're not careful during application, but also tends to flake off. This smudged to my lower lash line after a mere hour."
      },
      "curlyyvo216":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 Feb 2017",
         "title":"Fluffy lashes, easy to remove",
         "description":"I've had a great experience with the product. I read the reviews after the purchase and was worried. I would describe my routine as a tinted moisturizer, mascara and lip gloss regime. I applied to clean lashes without curling, 1-2 coats at most and I saw instant curl and lengthening. I didn't want to keep applying coats in case that would cause any clumping as I've experienced with other mascaras. Very easy to apply and easy to remove. I use drug store acne wash. I didn't have to reapply constantly. I didn't do any \"building up\". It provided the most natural fluffy look. I applied on the corners at most on my bottom lashes but was light handed. I experienced no clumps, smudging or raccoon eyes. I would purchase again.\n…read more"
      },
      "Manigs":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"3 Apr 2016",
         "title":"Overrated",
         "description":"Very clumpy, I had to clean off the brush before every use which is a huge waste of product. Also, I HATE the shape of the brush, it's practically useless. Don't understand all the hype of this mascara, it doesn't even last a long time."
      },
      "DamnitsDina":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Nov 2015",
         "title":"Longest, thickest lashes ever.",
         "description":"I love the dramatic effect of long, thick, volumized, and defined lashes. This makes my nonexistent short lashes pop up to my eyebrows if I really want to with just a COUPLE of coats. Usually, I use a mascara primer but with this product, I don't even need one to make it seem as if I have false lashes on."
      },
      "audeygirl":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"18 Sep 2015",
         "title":"terrible stuff",
         "description":"this mascara is awful. my friend and I both bought it on the recommendation of a Sephora expert. It clumps too thick to apply...we both hate it."
      },
      "MaddieMMM":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"28 Dec 2014",
         "title":"Too Bad",
         "description":"I wanted to love this mascara. I really did. The packaging is stunning, Too Faced is a great brand, and the name makes me giggle and blush. However, I was very disappointed with this product, especially for the price. The first few applications were lovely, but after maybe a week it was insanely clumpy and messy. And it flaked, which is my mortal enemy. I definitely won't be buying this again, which is a shame because it really is such a delightful package, and it's fun to say \"Better Than S*x\" when people ask you what mascara you use.\n…read more"
      },
      "mendela":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Jun 2017",
         "title":"flakes",
         "description":"At first when you apply it looks beautiful but then about two hours later it flakes everywhere by the end of the day it looks like you were never wearing mascara. I would not recommend it"
      },
      "CMakeupNewbie12":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 May 2016",
         "title":"Best. Mascara. Ever.",
         "description":"It was love at first glide. This was one of those products that after one use, I wondered where it had been all my life. Why had no one told me before that this product existed?! Normally not one to splurge on makeup, this mascara is worth every penny. I will never go back to drugstore brand products; converted for life."
      },
      "connie123w":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 Oct 2015",
         "title":"Happy that I tried this one.",
         "description":"I finally got this mascara in a kit and I'm so glad I did. The first time I put it on I was amazed. Ive tried a fair amount of high end mascaras this is not like them. With one coat my lashes look so much fuller yet very natural. It doesn't look like Ive put on a ton of mascara to make my lashes thicker it looks like I have naturally full lashes. My lashes are flexible and soft all day but it dose wear off a little by the end of the day. Now I do have problems with it smudging but every single mascara dose it on me anyways (haven't tried any waterproof ones so can't say about those). I thought I would keep trying until I find one that works. With all the mascaras I've tried before I just didn't like them to the point where I just want to make them work until I tried BTS. So I did my research. Girls, if you have problems with mascaras smudging, put your eye primer on where it smudges and set your eye area with powder before your mascara routine. It gets sooo much better. Don't put too many coats on or comb your lashes after your mascara sets and you won't get flakes. This is the first time Im so happy with a mascara. Hope my experience would be a little helpful. Plus isn't the packaging the cutest?\n…read more"
      },
      "morgroy18":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"18 Aug 2016",
         "title":"Made my eyelashes look super long and nice but its very clumpy and heavy",
         "description":""
      },
      "2rubblemaker":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"4 Oct 2015",
         "title":"Disappointed",
         "description":"I had heard so many good things about this mascara so I decided to try it and am very disappointed. It doesn't add volume or length but goes on very clumpy and then flakes off onto eyelids and under eyes. Definitely try it before you buy it!"
      },
      "earmstrong":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"15 Apr 2016",
         "title":"Disappointing",
         "description":"It's so disappointing because I love the results. It gives a nice, full look to my lashes, but there is one huge downfall. It flakes off SEVERELY. There will always be flaky black smudges under the eyes after a little while :( I had to return it. So sad because I have such high expectations of Too Faced!"
      },
      "beckalynn":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"27 Feb 2016",
         "title":"Good &amp; Bad",
         "description":"Lets start with the good things first. This mascara is super voluminous and holds a curl all day. It thickens the lashes and can look a bit spidery for someone who is used to defining mascaras, but I liked the look. The mascara is quite a wet formula. When I applied it, because the wand is so big, I tend to have to go back in to clean up once it dries down because it goes everywhere. The biggest problem for me though, is it transfers on me within a couple of hours. I have black on my bottom lash line or a raccoon type smudge. I tried it out a few times to make sure, but it just keeps happening. It makes my lashes look good but it's too messy for me. I know of people who find this a holy grail item, but also they tend to wear shadow without a primer, which I can't do, so maybe my lids are just too oily for this product.\n…read more"
      },
      "lauramaye":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"28 Jul 2013",
         "title":"Nice mascara",
         "description":"I'll admit, I mainly bought this because of the super sleek, but girly pink tube packaging. It has nice weight to it too, to make it feel even more luxurious. Now, onto the actual product. It is pretty volumizing, one of the best I've found. To me, it's a dryer formula, and builds fairly nicely. It can look clumpy if you don't take your time and wiggle the mascara through your lashes. It doesn't give a lot of length, but I don't think it's suppose to. It is super black, which I love. The brush is nice, but I find it hard to get my short inner corner lashes since the brush is hourglass shaped, so it's thick in the tip. I do get smudging sometimes, but my skin is super oily. Overall, I do like and would probably repurchase.\n…read more"
      },
      "clubber1830264":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"11 Feb 2017",
         "title":"Works great until half way through the day you realize you look like a freaking raccoon!",
         "description":""
      },
      "isaisa125":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Nov 2016",
         "title":"best mascara!",
         "description":"I am a mascara junkie, and I must say.... it's the best one yet. I would definitely recommend this to anyone looking for full beautiful thick lashes."
      },
      "Jazzy2424":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"17 Jun 2014",
         "title":"Disappointed",
         "description":"I couldn't wait to try this product to be let down. Everyone was raving about this mascara on You tube so I thought let me give it a try. It does give you volume, however, it was flaking throughout the day. It was also clumpy and just hated that I had flakes on my cheeks. Annoying!!!"
      },
      "MakeupCunt":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Jun 2015",
         "title":"HOLY GRAIL",
         "description":"this is literally the only mascara i use. IM NOT KIDDING. makes my lashes so long and black. the only downside is it can get clumpy if your not careful. so make sure you wipe some of the mascara off the wand before you apply and you should be good. other than that perfff"
      },
      "couponmommy":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"14 Jan 2014",
         "title":"gloppy mess!",
         "description":"I cannot tell you whether or not the actual mascara is a good product as it comes out in the hugest, gloppy mess! The brush is massive, it is completely covered in product when you pull it out, and I end up getting it everywhere. For $23, I am not going to wipe the extra product off with a tissue--what a waste! Maybe some people can manage the brush, but I, for one, do not have the time nor energy. This is definitely going back.\n…read more"
      },
      "jc4gotpaid":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"21 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Eh, they have better ones."
      },
      "BreannaMM":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"2 May 2017",
         "title":"Adds a lot of volume to my lashes but really weighs them down and they fall pretty flat quickly. Also flakes more than other high end mascara's, not my favourite but not horrible either.",
         "description":""
      },
      "betina00":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Jun 2015",
         "title":"PERFECT!",
         "description":"I can't believe I waited so long to try this! It really is amazing! I agree with other reviews; when you first begin to use the mascara too much product is on the brush. Just scrape off the excess and you are good to go. :)"
      },
      "Nightynight":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"17 Feb 2015",
         "title":"Perfect Mascara!",
         "description":"I cannot gush about this mascara enough. I've been using it for awhile now and I'll continue to purchase as long as it is available. It really makes my lashes pop and doesn't run in the Vegas heat, seriously a savior during summer whether you wear the mascara alone or over/under falsies. Definitely recommend giving this a try!"
      },
      "BarefootGypsy5":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"4 Mar 2014",
         "title":"flakes",
         "description":"I have never returned any product I have purchased at Sephora, but there is a first time for everything. I initially loved the effect of this mascara, lots of volume and great length...only within hours the volume and length has diminished and you have flakes under your eyes. I initially thought maybe it was due to weather or rubbing my eye so I gave it more time. After almost a week of use, I get the same results, great lashes for awhile then black flakes under my eyes. I even tried using a different mascara on my lower lashes which did not help. I still had flakes making my makeup look messy and like I have dark circles. Very disappointing.\n…read more"
      },
      "annikaaa":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"18 Mar 2017",
         "title":"Overrated",
         "description":"This product is good at lengthening the lashes but that's about it. It clumps easily & flakes off throughout the day. I reach for my drugstore mascaras over this one haha"
      },
      "cmoon26":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"21 Feb 2017",
         "title":"good but not my fave",
         "description":"I am a mascara junkie and have been wanting to try this forever. I wasn't blown away by it, but I do like how it makes my lashes look. Its very buildable too, with no clumping. My go-to is still RollerLash by Benefit."
      },
      "ravennmua":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"30 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I have been using this mascara for almost 2 years now. No other product works as well as this one, you truly get beautiful lashes when you use this properly. A little secret for getting the best out of this mascara - heat it up a little before applying (i.e., rub it between your hands for a few seconds). Personally, I have never experienced any flaking from this product, it stays on for hours and looks amazing the entire time. The flaking people talk about might just be a personal issue. Hands down, my favorite makeup product.\n…read more"
      },
      "Katya1313":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"2 Jun 2015",
         "title":"Wasn't impressed with it. Too clumpy. I like benefit \"they are real\" a lot better",
         "description":""
      },
      "muajunkie12":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"12 Aug 2017",
         "title":"Great Mascara but buy the DUPE!",
         "description":"This mascara is great! It is very voluminous, very black, and very lengthening. The only con is that this mascara dries out very fast! My best advice is to buy the Lash Paradise mascara by L'Oreal. It does just as great as the Better than Sex and is only $9 vs $23"
      },
      "lindaesq":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"15 Jun 2015",
         "title":"smudgey and kinda clumpy",
         "description":"Not better than sex... this mascara is too heavy and it smudges under my eyes! The sephora employees made me believe that this would be it for me but I'm disappointed. It does provide volume but it makes it so that my lashes don't stay curled because the product is too heavy. Will not be purchasing again."
      },
      "iluvmakeup420":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"6 Sep 2016",
         "title":"Not A Fan",
         "description":"I had high hopes for this mascara because I've heard a lot of good things but I'm way less than impressed. I'm a pro at mascara at this point so it's not me not applying it right, it goes on super clumpy and creates spider lashes instantly! I'm nervous to take it back just because I don't want the looks but I really would like to exchange it for another brand"
      },
      "Emilymags":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Jul 2013",
         "title":"Best mascara ever!!! Full volume, intense length and actually gave my straight Asian lashes a curl. It also did not smudge all over.",
         "description":""
      },
      "HelloLovely22":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"4 Dec 2016",
         "title":"very thickening",
         "description":"I love this mascara when I want a dramatic look. I love how thickening it is and haven't found another mascara that makes my lashes as full, however I don't think it's as lengthening and without another mascara to comb it out it can be clumpy. I find I always use it in combination with another mascara."
      },
      "jaclyn97":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Aug 2014",
         "title":"raccoon eyes",
         "description":"I got a sample of this mascara, and with all of the great reviews I was super excited to try it. I wore it one night to try it out, as I was hoping to wear it to prom, and within a few hours, it had smudged everywhere and I had raccoon eyes. Needless to say, that's why you always try a product before wearing it somewhere important! I definitely won't be buying the full sized product."
      },
      "nbi3":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"3 stars",
         "date":"4 Jan 2016",
         "title":"Dissappointed",
         "description":"I bought this mascara yesterday because I ran out of my Benefit They're Real mascara and wanted to try something new. I went through my whole makeup routine, which includes setting spray, which worked perfectly with my old mascara, but at the end of the day I found that the mascara had worn off and rubbed under my eyes, giving me dark eye circles. When I was applying it, I thought it was kind of clumpy and I needed to do a few more coats than usual to get the look I like. This definitely was not worth the hype, it is the quality of a drugstore mascara.\n…read more"
      },
      "TaylorBerk":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"16 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Ehh, Don't Waste Your Money!"
      },
      "HKSmakeup":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"23 May 2017",
         "title":"great but get the waterproof one",
         "description":"This is such a great mascara because it makes your eyelashes look like fake eyelashes! It really increases volume, length and curl. The only issue is that this one flakes off throughout your day. I found that the $15 travel size one doesn't flake by the $30 full size does. Weird right? I recommend purchasing the waterproof one like I did because it doesn't flake. The only thing with that is that you have to take more time to take it off!\n…read more"
      },
      "Goldenlotus1":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"12 Nov 2015",
         "title":"Good Volume but Flawed",
         "description":"Love the dark black pigment and the curling effect on my upper lashes from the wand shape. However, I get a lot of clumps I have to remove with an eyelash comb and it is definitely not smudge-proof! I rubbed my eye accidentally at work and looked like a raccoon afterward! O.o"
      },
      "JenJoy94":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"6 Jun 2016",
         "title":"I was disappointed. Definitely not better than sex. The product crumbled off of my lashes. Wouldn't repurchase.",
         "description":""
      },
      "epolly":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"29 Sep 2016",
         "title":"Could be great but flakes like crazy",
         "description":"My lashes are super long and thick with this mascara, I really love the way it looks but almost immediately it starts flaking which is a huge turn off for me. I haven't tried the waterproof but I shouldn't have to use waterproof to avoid flaking if it is better. For the price I expected more, tried it twice thinking maybe it was just the first tube but after the second was the same I'm moving away from it."
      },
      "Jpalum":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Aug 2013",
         "title":"Wispy look",
         "description":"I really like this mascara! I don't know how else to describe the lashes other than wispy defined, that mink eyelash look. I'm getting away from ridiculous looking spider leg lashes and this is the perfect way to do it because my eyes are still really defined my eyelashes are still thick looking, curled and not clumpy. Plus it's really build-able, one coat is perfect for the work place to have beautifully curled lashes that make you look awake and 2-3 coats is perfect for going out. My only annoyance is the brush handle is really heavy, not going to stop me but I'm afraid ill drop it on my carpet! oh and I noticed its only 0.27 oz which is slightly less than some mascaras which means its a little more expensive than you realize\n…read more"
      },
      "JessNally":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 Jun 2014",
         "title":"My favorite mascara.",
         "description":"Although the brush isn't the best, the formula is perfect. It can easily be layered to create a 'bombshell' effect. I use several coats per application and my last tube lasted almost 6 months. I highly recommend."
      },
      "FakeupBCMakeup":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"7 Jan 2014",
         "title":"Not worth the hype..",
         "description":"I was so excited to get this... It was sold out for weeks where I live and when I finally picked it up, I used it once and haven't touched it again. Thinking of returning it. It smeared all over under my eyes and when I tried to wipe it off, it just smeared even more! Maybe it's just me, but I don't plan on using it again. I want my money back!!"
      },
      "corgigrrl":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"1 Feb 2015",
         "title":"AMAZING",
         "description":"I've tried almost every mascara in the game, from drug store to dior and this mascara is still the best. My lashes come out thick, full, long and dark without being clumpy at all. The brush is unique and works like a dream. Highly recommended."
      },
      "dorit87":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"3 Apr 2016",
         "title":"A flaky mess!",
         "description":"I generally take the word of my favorite YouTube makeup vloggers, but I bought this mascara after thinking it over for a long time and I ended up giving it to a friend after using it twice. This mascara is AWFUL! It flakes so poorly, especially when trying to remove the mascara, and I always end up getting flakes in my eyes! It also transfers off my bottom lashes onto my skin, unlike my multitude other mascaras. Maybe I got a bad batch, or maybe it's just a terrible product.\n…read more"
      },
      "catearl":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"29 Oct 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"terrible"
      },
      "Suzi30":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"1 star",
         "date":"20 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Flaky"
      },
      "Precious22":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"31 Jan 2014",
         "title":"One of my favorites",
         "description":"I love this mascara, but it flakes throughout the day. Kind of disappointing, but the effect is has on my lashes is beautiful."
      },
      "HiItsMe":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Aug 2014",
         "title":"My Favorite",
         "description":"It's the best mascara I've ever tried. It gives me so much volume, fullness, length. I pair it with Dior eyelash primer sometimes and the results are amazing ! I get so many compliments on my lashes!"
      },
      "catjunkie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Oct 2013",
         "title":"I fell in love",
         "description":"I have been a loyal, vocal fan of Benefit's They're Real mascara, and never imagined myself using another product. Then I found this mascara and had to try it. Oh my, this stuff is amazing. This is my new favorite daily mascara. One coat gives you rich, thick lashes for the daytime. If you want a sultry evening look, 2-3 coats of this stuff looks stunning and luscious. As long as you apply multiple coats before the previous coat dries, it's clump free, thick and dramatic. I love this mascara!\n…read more"
      },
      "ajsv":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Apr 2014",
         "title":"Volume+length",
         "description":"Love the mascara, gives the length and volume. However I wish tip of the brush was narrow cause it's difficult to get in corners :)"
      },
      "kissmeNmakeup":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"23 Jan 2015",
         "title":"LOVE this but not the RUN",
         "description":"I fell in love with this mascara and have been using it for at least a year. I just don't like every time I look in a mirror (throughout the day) there is a black smudge under my eyes!! I wish I could find a mascara that gives me everything this one does, without the run ALL DAY!!! :("
      },
      "joselynleeanne":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"2 stars",
         "date":"19 Oct 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"SO OVERRATED!!!"
      },
      "teenreview":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"19 Sep 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"flakey..."
      },
      "byme4u":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"8 Jun 2015",
         "title":"A new kind of volume",
         "description":"I have skimpy lashes. This mascara lays down volume like a fur coat! I've had volume, but nothing like the Too Faced BTS. Unfortunately, like some of the other excellent volumizing mascaras, this one irritates my eyes by the end of the day."
      },
      "Klchart12":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Mar 2017",
         "title":"Better than sex",
         "description":"This is by far the greatest mascara I have used. Nothing compares to this mascara. Once I started using it, I instantly fell in love"
      },
      "ziomy":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Oct 2015",
         "title":"LOVE IT",
         "description":"First of all I am SHOCKED at the negative reviews. It appears like some people aren't applying this mascara on correctly. It is supposed to volumize: not curl. Use your eyelash curler if you want curls. Also, the brush is designed to make your lashes pretty much look like falsies. Like ANY mascara if you have too much product on your brush you will get clumping and possibly flaking. Check the brush. Also, apply it like you would your eyeshadow when you're blending. little by little and in back and forth motions. let dry completely THEN add a second layer if you want. but honestly I don't think you'll need to. this makes my eyelashes look flawless! everyone compliments them. I highly recommend this product\n…read more"
      },
      "belleg":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"1 Apr 2016",
         "title":"flakes and smears",
         "description":"I felt compelled to write a review on this mascara after all the raves I'd heard. Gives a full effect and dark lashes but doesn't lengthen lashes. It has smeared below my eyes within a couple of hours each time I've worn it, and flakes off and into eyes, whether I put on one or multiple layers. There are so many better ones in the same price range so don't waste your money on this one."
      },
      "martinezroxy":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"5 Sep 2013",
         "title":"Not",
         "description":"It wasn't very good. I was very disappointed with this mascara,especially after the sales person gave it rave reviews. It was clumpy and it was completely gone by 5. I did return it and went back to my favorite."
      },
      "scully58":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"13 Aug 2013",
         "title":"Wonderful!",
         "description":"As a lot of people have done before me, I have tried just about every brand of mascara there is. Never have found just the right one though. This on the other hand is awesome. I have never had a mascara perform like this one does. It is intensely dark, goes on with just a few swipes and gives me long lush lashes. It curls them, and the curl stays all day (I do not use an eyelash curler). It does not flake at all, no raccoon eyes, doesn't clump. I am ordering a bunch more before they sell out. Finally, at the age of 55 I have found the best mascara I have ever worn. Only one minor drawback: the handle is a little heavy, but you get used to it. My search is finally over.\n…read more"
      },
      "sallysoo":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"18 Feb 2016",
         "title":"THE BEST EVER",
         "description":"This is bar none THEE BEST mascara ever!! Yes, I've tried them all. Lancome's, They're Real, tarte, DIor etc. etc. This makes lashes so long it's unbelievable. The second coat thicken and elongates and darkens. I only do 2 coats but three is suggested. Second coat when still wet of course. This mascara separates beautifully too. On extra coats wipe applicator on tube top so it doesn't clump. I don't need to because I'm an expert at putting on mascara but BELIEVE ME GIRLS, this it IT!\n…read more"
      },
      "nagrom":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Nov 2014",
         "title":"Above the rest!",
         "description":"I've tried many high end mascaras over the years. I like Dior Show, Buxom, and several Smash-box kinds. But, none compare to this amazing one from Too Faced. Nothing has given me the volume, length, and overall fullness that it provides. The best part is that my lashes feel soft after I've applied it, which doesn't usually happen. Try it...it is well worth it!"
      },
      "Mimmb":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Aug 2014",
         "title":"Seriously impressed",
         "description":"This is one of the best I've tried (and I tried a lot). It gives very black, very big, very fabulous lashes. Very sexy. This is my new favorite."
      },
      "dinolove":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"2 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Terrible and overhyped. The brush is thick and applies so messy. Lashes looked clumpy."
      },
      "crazyworkinmom":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"26 Feb 2017",
         "title":"Wanted to love it but smeared on me",
         "description":"I wanted to love this mascara. The brush was fabulous, it went on really well for me. Unfortunately, it smeared after a few hours. I have this trouble with many mascaras so don't assume it will happen to you. It thickened and lengthened without clumps for me. And, the pink package is a bonus for finding it in a large make up bag."
      },
      "bubblekush12":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 Jul 2014",
         "title":"It's okay.. not the best.",
         "description":"It definitely lengthens, but when you apply it, chunks of the mascara goes onto your lashes & it's a mess! Do not recommend it if you want your lashes to be separated!"
      },
      "cliniquelvr":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"24 Aug 2015",
         "title":"Looks great but smudges!",
         "description":"This mascara looks great when you first apply it. It's volumizing, lengthening, and doesn't ever get clumpy. HOWEVER, after 2 hours or so it definitely smudges. I don't ever get smudging from mascara so I was surprised to see this happening with such an expensive product. I will not be repurchasing."
      },
      "MarshaJS":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"2 stars",
         "date":"9 Aug 2018",
         "title":"disappointed",
         "description":"It goes on a bit clumpy but does actually really make eyelashes thick and lush. Unfortunately, by the end of the day, it had flaked all around my eyes."
      },
      "jordan19":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"17 Feb 2015",
         "title":"Great for length!",
         "description":"I don't think this is my favorite mascara, but I'm using it in the meantime until I find something better. My eyelashes are already super long, and this mascara just intensifies that. However, it doesn't do much for my volume and I don't find that my lashes look evenly full (benefit they're real does this quite a bit better-- maybe a difference in brush?). It also flakes some days. I like it for the most part but I think there's something better out there for me.\n…read more"
      },
      "Lola71467":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Mar 2015",
         "title":"IN LOVE",
         "description":"This is by far the best mascara I have EVER tried. If you aren't good at applying it it looks clumpy, but once you learn, Wonderful!"
      },
      "darthmommy":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"6 Feb 2015",
         "title":"I didn't love this mascara as much as rep said at the store. I like the Bad Gal Lash more. Won't buy this again, it leaves my lashes clumpy and \"spider leg\" looking. The brush isn't that great either.\nDisappointing to say the least :(",
         "description":""
      },
      "thekatiek":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"9 Sep 2015",
         "title":"Better than sex? Not really.",
         "description":"The mascara does not live up to its name. It is messy and smudgy. It takes a while to dry so I almost always have mascara smudges on my upper lid that I have to rub off. It also flakes and gives dark circles under my eyes a few hours later... does not stay in place. It also clumps easily. If you are into that messy, clumpy look then this one is for you. It certainly does not separate lashes."
      },
      "TXLove":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"21 Nov 2013",
         "title":"WOW oh WOW!!!!",
         "description":"I am obsessed with this mascara! I absolutely love the length and volume this mascara gives my short wimpy lashes! After I apply the mascara it honestly looks like I'm wearing false lashes. Two thumbs up!!"
      },
      "chinadoll12":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"22 Jan 2017",
         "title":"raccoon eyes",
         "description":"It read smudge free, FALSE!!! Raccoon eyes all day. Can't even wear it on the bottom lashes because it smear so bad. Waste of money. Don't recommend."
      },
      "cmarie228":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Feb 2015",
         "title":"This makes my eyelashes very full and long, couldn't ask for a better mascara, been purchasing this for 4 years now and it has yet to fail me!",
         "description":""
      },
      "Jkruse":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Jun 2016",
         "title":"This is my new favorite mascara! I was skeptical because of some of the reviews but overall it is such an amazing mascara! It lengthens, volumizes , thickens, and separates your lashes and doesn't clump. Amazing formula and wand. I have to say it does flake sometimes but one flaw does not out weigh all of the maxing things this product does!",
         "description":""
      },
      "nelly1":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 Oct 2014",
         "title":"love it!",
         "description":"it really gives me a lots of volume and length! i do have to be a little careful while applying the mascara because of its big brush getting on my eyelid. BUt love that it is not waterproofed and easily removable. however, after a long day of work with this mascara, it starts flaking- which is ok with me since by that time, i am ready to wash my face and remove my makeup."
      },
      "rubycorners":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"13 Dec 2016",
         "title":"had high hopes",
         "description":"I absolutely love this mascara! It adds length and fullness, BUT, at the end of the day, I end up with black smears under my eye. I have been using the product continuously and continue to have the same problem. Today, I tried a different mascara, and no smearing. I'm so disappointed in this mascara that I bought."
      },
      "Mariel25":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Mar 2014",
         "title":"best mascara ever",
         "description":"This mascara really works, i mean it really does give the tickness and dramatic look it promises"
      },
      "knh09":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"29 Oct 2013",
         "title":"I am so glad I only tried this as a sample because it is AWFUL. It is ridiculously thick and it clumps soooooo bad. My lashes looked spidery and sharp. When I went to wash it off, it my lashes actually felt really sharp and crunchy. Definitely NOT what I look for in a mascara. WORST mascara I've ever used. If I could give it 0 stars, I would.",
         "description":""
      },
      "Stefani91":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"1 Aug 2017",
         "title":"only buy the travel size",
         "description":"I only buy the travel size because the brush is better and the formula has less air in the container to make the product go bad. HOLY GRAIL"
      },
      "linda":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"25 Aug 2014",
         "title":"I bought this mascara with the hope of having nice thick lashes. The brush was great however, the mascara was clumpy. I hated it and ended up returning it.",
         "description":""
      },
      "Gruvella":{ 
         "extra_info":"<b>Hair Condition</b> Chemically Treated (Colored, Relaxed, or Permed)",
         "stars":"1 star",
         "date":"3 Feb 2019",
         "title":"I was seriously unimpressed by this mascara.  It was very flaky after about an hour of wear and frankly, my Voluminous does a better job for a fraction of the price.  The shape of the wand was also very frustrating to work with and I ended up blobbing mascara on my inner eye a few times.  Really cannot understand what the big deal is about this product at all.  I returned it immediately.",
         "description":""
      },
      "ajl12":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"18 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I swear by this mascara! It’s unfortunate to see some people saying it flakes. I’ve never ran into that issue and I’ve been using this for years. I tried other kinds of mascara that would shorten my eye lashes once I removed the mascara. My eyelashes would look thin and sparse. Not sure if there’s something in too faced mascara but it doesn’t shorted or weaken my eyelashes and it gives me a nice full set of eyelashes too Only thing is the price.\n…read more"
      },
      "TyffM":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"24 Jan 2014",
         "title":"Its ok",
         "description":"I will say I see more volume from this mascara than from 'they're real' benefit mascara but it can be a bit flaky. I do like the thickness it gives my lashes and it comes off easy with makeup remover, I would definitely recommend this if you like thickness over length."
      },
      "kaymomof3":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Jul 2014",
         "title":"In love !!!",
         "description":"I'm really surprised with all of that bad reviews . This is by far the best mascara out the right now . The formula is incredibly dark and easy to apply , holds a curl and make my lashes look like falsies! !! There is no smell and it doesn't dry and flake off !!! Try it you won't be sorry ."
      },
      "emmy232":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"19 Sep 2018",
         "title":"I love this mascara my lashes look fuller and longer. Ive been using it everyday for almost three years now. I work at a night club and it stays on all night even after being sweaty!",
         "description":""
      },
      "torirm":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"26 Dec 2015",
         "title":"great volume, but..",
         "description":"This mascara is hands down the best mascara I've used in regards to volume and blackness. It almost gives my lashes a falsie look, without the feel of false lashes (I HATE falsies). Love the shape of the brush, love the deep black colour, and love that it doesn't clump. That being said, it does flake after 4-5 hours, and I find that I have to reapply around the same time to ensure my lashes stay looking nice and full and dark. If it wasn't for the flaking, and the fact it doesn't come in a waterproof formula, it would have gotten 5 stars.\n…read more"
      },
      "JMJ608":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"25 Oct 2016",
         "title":"Not repurchasing. Been using this for several months and it has never not smudged. Looks beautiful when first applied but I promise you will have raccoon eyes within a few hours. I'm not oily at all and have never really had a problem with my makeup running. But this mascara will do it to you every time",
         "description":""
      },
      "nikkipretty143":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"3 Jul 2014",
         "title":"Love Hate Relationship",
         "description":"I decided to try this mascara out based on reviews. My holy grail mascara is the They're Real Mascara by Benefit and if i'm feeling a need to splurge I will get the YSL Faux Cils mascara. This product is not worth the hype. This product has fall out and is clumpy when getting out of the tube. I do love this product for the darkening and thickness it provides but it absolutely gives no lengthening and curl to my medium length lashes. I would go with the They're Real masacra if you want to get better results for the same price.\n…read more"
      },
      "AmyBowser":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Jun 2014",
         "title":"WOW!!!",
         "description":"I have very short, straight lashes and this mascara is seriously a miracle worker. Not only does it help curl my lashes even without a eyelash curler but the length and volume it creates is seriously awesome!! After using this I am so spoiled that all my other mascaras just don't cut it anymore."
      },
      "MakeupBySarai":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"9 Nov 2013",
         "title":"This mascara is phenomenal!",
         "description":"This mascara is amazing! It makes my lashes so thick and full. The other reviewers who are saying that you can't even see the brush are probably pumping the brush in and out of the tube! DO NOT PUMP MASCARA! ALWAYS TWIST IT GENTLY! If you pump it, you will get product build up on the brush and the mascara will dry out faster. You will also have a higher risk of bacteria."
      },
      "pixisadoll":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Jul 2014",
         "title":"Amazing",
         "description":"I got this by recommendation and I LOVE it! It is so much better than my other mascara. It is long lasting and buildable. I love love this product and will definitely be buying again. I am going to be gifting this for a few of my girlfriends who really need a great long lasting mascara. This was my first two faced product and now I cannot wait to try more."
      },
      "Anniiie":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"28 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"really clumpy"
      },
      "1Bec":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"19 Oct 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"over-hyped, overrated, over it"
      },
      "rondamac":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"18 Jan 2014",
         "title":"One word: Perfection!",
         "description":"I have tried many brands and this one was different from use one. Volumizing and dramatic from the first coat to the third. You can immediately tell the difference. I have tried more expensive mascaras that have done much less. The Sephora associate said they have had no returns to date on this product and after trying it I see why!"
      },
      "amira89":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"14 Apr 2017",
         "title":"Flakey",
         "description":"I've been a Benefit mascara lover for years, but felt that it was time to try something new. After seeing that this mascara was on all the top-lists, I decided to give it a try. I found the brush to be quite big and took getting used to, but after a few applications it became much easier. I also noticed that after a few hours of wear, under my eyes was black and I had flakes of mascara. I wasn't too happy with that, seeing as my other mascaras would last me all day + hot yoga. The mascara itself looked amazing, and gave my lashes tons of volume. It does exactly what it should do. I just didn't like how it flaked so much, making me look tired mid-way through the day. I don't see myself buying this mascara again. If I do, I'll likely try the waterproof one to see if that would be any different.\n…read more"
      },
      "spockahontas":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Jan 2016",
         "title":"Like a dream",
         "description":"This mascara is everything I've always wanted. The volume is INSANE. Makes them thick too! I will forever purchase this mascara."
      },
      "VTK084":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Jun 2013",
         "title":"Finally My Search Has Stopped...",
         "description":"For the perfect mascara. I have tried every brand, you name it, Chanel, Clinique, bought the Lash Stash from Sephora (which is cool too if you are looking to try different mascaras). Lancome was my winner but it was never perfect. Nothing was. I have very long eyelashes (even my own sister asked me once if I was wearing fakes) but they are super fine. Just like my hair. So I was looking for something that gave me volume without looking fake. This makes my eyes look both dreamy and natural at the same time. I have (naturally) light blonde hair and the black color looks great. I love this and will reorder it once the sample runs out, I am so very happy I got it. All this with just one coat too!\n…read more"
      },
      "HNG87":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Jan 2014",
         "title":"Best mascara!",
         "description":"I love this mascara because it is very easy to apply and it doesn't take 10 mins to make them pop! It makes your eyelashes look long, full, and healthy and not look like you're caking it on! This is now my go-to mascara! :)"
      },
      "aturn27":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"6 Oct 2014",
         "title":"I bought a 5 piece mascara sample set and this was included. When I finally got to this one, I was expecting to be disappointed because the rest of the pack had disappointed me. However, I was completely surprised and fell love with how my lashes look. It builds very well and has a great color. Don't be afraid of the brush either.... its awesome!! My only problem with it is that it flakes slightly but doesn't smudge. It's still the best mascara I've used.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "blakeash":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"9 Sep 2013",
         "title":"LOVED it",
         "description":"Weirdly enough, mascara has always been the one thing I do NOT buy from Sephora, only because I've never found anything that I liked as much as a my go to from Loreal ...and I've tried TONS - from the least to most expensive. However, I will say that this is my new gotta have mascara, hands down. The first day I tried it, I got TWO \"you have pretty eyes\" and one \"what mascara are you using?\" I will say that I did read all the reviews, so the first thing I did before even trying it on was to put a tiny drop or two of super glue on the top after removing the wand, so as the round part that removes the excess didn't come off and leave me with a blobby mess, as I had read happens. Needless to say, I have had no problems whatsoever. Wand issues aside, I love the fact that the product is thicker, which I like. It's not a thin and watery, so for me I do not get spider eyes. I used to sometimes put my mascara in the freezer for a bit just to thicken it up and this reminds of that. My lashes are pretty long anyway, but even with just one coat it's like BAM! Normally I don't have the patience to just stick with one coat but with this I don't have that problem - because they get long enough with just one coat. And for going out, I don't want to over do it because I will seriously look like I have falsies on. It doesn't look bad, but it makes them so long and dark it almost TOO long and dark - NOT a problem I've encountered before! (Not that there's anything wrong with falsies...) Also, for some reason (maybe it's just me- probably is) I find that I tend to poke my eyes with certain types of wands - no idea why. Luckily this is not one of those types - hasn't happened once. Plus, the wand isn't so long that you accidentally get mascara on the bridge of your nose when you're trying to get the inner corners of your eyes. So, in a very lengthy nutshell, I absolutely give this the thumbs up. Oh, and did I mention that my lashes look so great now that I quit wearing eye shadow? It's like I don't need anything else now because my eyes are seriously popping like never before. And I'm 44!!\n…read more"
      },
      "boww":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"11 Feb 2014",
         "title":"RE-assessment",
         "description":"I am writing an additional review in hopes that Too Faced will take note. I originally assessed this mascara with a high review. Yes, I like the volume and intense look. But, after using this mascara for some weeks, I find that it no longer defines/separates my lashes as well as when I first bought it. The worst part about it is that there is so much goo on the brush. And, when I close it shut, it leaves so much residue on the outside of the bottle. Frustrating to have to continually wipe off the outside with a tissue. There is way too much product on the brush. Read that some shake the mascara bottle before use and also wipe the brush with a tissue in order to remove the excess. Will try these techs. Also, it does smudge below my lashes,( lower lashes) leaving me with no other option than to use another mascara for my lower lashes. The volume and thickness achieved in using this mascara is a given. Just need to work on the amount of product that comes out on the wand....excessive. And, I don't really like that I have to use another mascara for my lower lashes.\n…read more"
      },
      "courtneym":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"24 Feb 2017",
         "title":"Not worth the hype",
         "description":"I've tried a ton of mascaras from high-end to drug store brands and this is by far the worst. This mascara leaves SO MUCH RESIDUE throughout the day! I had to constantly keep removing it from under my eyes as little as a half an hour after application! Back it goes!"
      },
      "emilymarie0":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"20 Mar 2017",
         "title":"works a lot better when warmed up in your hands for a few minutes. can get clumpy if you're not careful. easy and smooth application. it's a great color and overall great mascara.",
         "description":""
      },
      "ContouringinTX":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"2 Feb 2017",
         "title":"Flakes off at the end of the work day",
         "description":"I love the way this product looks until about 3 o'clock in the afternoon. That's about the time I start getting little black flakes under my eyes, which is particularly frustrating because I only put the mascara on my top lashes. I wish I could give this mascara five stars, because it really does make my lashes look longer, darker, and prettier."
      },
      "ChloeRowland":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"15 Oct 2015",
         "title":"Dry and Flaky",
         "description":"I was disappointed in this mascara. It is very dry and flakes off onto my under eye area."
      },
      "CharHart":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"24 May 2016",
         "title":"DON'T FEAR THE BRUSH!",
         "description":"Quite honestly I love this Mascara. I do have long lashes, so it doesn't clump them up or make them look bigger then they should, this mascara actually darkens my lashes and look classic no matter time of the day or what I am doing. Obviously the more you put on the bigger and full on they are going to be..which I will add as little extra if I am going out with friends on a Friday night. Though for general daytime use, for a natural look, you really only need a little bit. I would defenitly try the travel/trial version first so you can get used to using it. I would also recommend going to youtube and checking it out so you can see for your self on how to apply it. The brush it self does look scary and old school, as well as it looks like it would clump up your eye lashes, but believe me it won't. I am a 36 year old mother, and this past year my skin, skin tone and everything in general have been making some pretty dramatic changes, so I have been having to change make up and styles and such, and I have been spending quite a bit of money for these changes. But then I have been coming across products such as this and thankful I have.\n…read more"
      },
      "almal20":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"3 Jan 2017",
         "title":"I tried the travel size first ($12) just to see if it really lived up to the hype and I must say that I was impressed at the first use. My eyelashes looked longer and more full than they had ever looked. But after a couple hours it began to flake and leave a black residue under my eyes. God forbid you ever fall asleep wearing this because you'll wake up looking like a raccoon. If it was waterproof I would rate 5/5!",
         "description":""
      },
      "Tabitha83":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Mar 2015",
         "title":"It's true",
         "description":"Love this mascara! I was iffy at first because I was a layer kinda gal when it came to mascaras. Layering is not a great idea, it will be clumpy and thick. After giving up layering I found this to be an amazing mascara."
      },
      "ytlea":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Nov 2016",
         "title":"They're not the same :/",
         "description":"I found a difference between the mini and the full size. The mini seems to work better and it doesn't clump what so ever. So then I decided to try the full size and I was surprised to see that it clumped. Over all I feel like it's a good mascara but the mini is better. :)"
      },
      "aammaanndah":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"6 Jan 2016",
         "title":"I used to LOVE this mascara!! I've bought it over 6 times but now I am seeing it tends to flake off through out the day and give me raccoon eyes. I must say if it did not do that I would give 5 stars. So sad I am going to go mascara hunting again :/",
         "description":""
      },
      "rlm1990":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"9 May 2017",
         "title":"I got this mascara a few months ago and was a little disappointed.. it doesn't live up to all the hype. I found it flaked and I couldn't get away with more than 1 coat without it looking really clumpy. Wouldn't recommend or buy again.",
         "description":""
      },
      "LipstickZealot":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Jun 2014",
         "title":"My new favorite!",
         "description":"I love this mascara. I noticed the other reviews about having problems after two weeks. I haven't run into any quality issues and I have used everyday since April 30th. Still going strong. I have some eyelashes on my upper lip that grow downward. No matter how much I curl them they stick straight down, annoying. Well this is the first mascara that actually has enough staying power to keep them curled up with the rest of my lashes. Beautiful, my husband even commented on how long and curly they were (he doesn't EVER notice anything, lol)\n…read more"
      },
      "FeliciaC79":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"4 Jul 2017",
         "title":"nope!",
         "description":"Didn't love it, but since everyone loves it, I put aside my beloved Lancôme and bought the travel size. I don't get the hype. Within a few hours, it was flaky on my skin. The tube of mascara dried up super quick as well. I'll take sex over this mascara, thank you very much. Doesn't live up to its name, and probably the only Two Faced product that I don't like."
      },
      "faithorchid":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"19 Oct 2015",
         "title":"Not so Much",
         "description":"I've bought drugstore mascara that's better than this. This mascara flakes within a few hours. It clumps when being applied and does nothing for my eyelashes."
      },
      "amymack":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"2 Mar 2017",
         "title":"flakey",
         "description":"Very lengthening and voluminous at the beginning of the day, but begins to flake throughout the day"
      },
      "jenngetsnaked":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 May 2017",
         "title":"jenn007",
         "description":"ANYWAYS I bought this mascara in waterproof and oh my gosh! I LOVE LOVE LOVE! I cannot tell you how much I love this mascara I got some many compliments on my eye lashes because of it. 23 bucks f*** ya worth the price!!!"
      },
      "makenzieeeb":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"13 Aug 2016",
         "title":"I loved this mascara for the first two weeks but then it get clumpy and I would find mascara all over my cheeks by the end of the day.",
         "description":""
      },
      "gpsailor89":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"9 Jun 2016",
         "title":"almost amazing",
         "description":"love this mascara!! it builds so well and gives you volume, but if you have tiny lashes it will clump"
      },
      "allbear":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"1 May 2014",
         "title":"I LOVE this mascara. Definitely one of my top faves and something I would purchase again. For someone who has naturally long but light and therefore thin and not quite voluminous lashes, this mascara is a miracle. Although it can clump at times all you have to do is gently wipe away excess mascara from the brush. One good coat is really all it takes. It darkens lashes, gently curls them, and gives to-die-for volume. This mascara may just be better than s*x. Or at least it'll get you more s*x.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "browneyes2":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"17 Oct 2013",
         "title":"Love it",
         "description":"I am so picky on my mascara but I finally tried this one. So glad I did I love it. Not only was it easier to put on due to the shape of the brush but it also made my lashes look fuller. I and it is easy to take off. If you haven't tried it you have to."
      },
      "Tasha8705":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"2 Jul 2015",
         "title":"I LOVE this mascara. I didn't give it 5 stars because, I agree with other reviews, it can be a bit clumpy- but it has not been bad enough that I take a comb through. If you are looking for a va-va-voom- almost false lash look, this is the mascara for you. I already have long lashes, and this mascara takes them to the next level with length and some volume- I get compliments often when I use this mascara- which has become my daily go to- it is sometimes my only makeup to wear- and it gives my eyes a great pop. It does not take too much take it off- in my opinion- normal make up remover does the trick, easily. I really love mascara in general- and this one is a keeper!<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "lindsaym123":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"3 stars",
         "date":"10 Aug 2015",
         "title":"Volumizing, but clumpy and thick",
         "description":"The brush is genius, however I find the mascara is clumpy to the point where it can separate my lashes, I do love this mascara though, with a proper and excellent application it looks great."
      },
      "SamLuttrell":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"4 Jun 2017",
         "title":"Why does everyone like it?",
         "description":"I was so excited for this product because there were so many good, even great reviews about it. I spent $23 and tried it the next day. It was a MESS! This product could not last an entire day if my life depended on it! The product, throughout the day, magically came off. It did not flake, but it smeared like a nightmare. I have never had a mascara that smeared this much. This product was false advertising because it was definitely not better than sex. Dissatisfied and disappointed!\n…read more"
      },
      "Drarry":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"30 May 2017",
         "title":"Jerrod Get It Together",
         "description":"When I first put this on, I LOVED it. However, at the end of the day all of the mascara was smudged under my eye. So, if you want to look like Jack Skellington be my guest. Honestly I am a virgin, so if this is better than sex then I'm becoming Queen Elizabeth I."
      },
      "clzbailey":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Feb 2016",
         "title":"Definitely HG status for me. This mascara adds length and volume like you wouldn't believe. After giving birth to both of my girls my hormones caused my eyelashes to fall out. As a result there were many months where I only had tiny little stubs and very sparse. This mascara helped SO MUCH. It actually looked like I had a full set of normal eyelashes. I have bought this product over and over again for about three years already. When it starts to dry out I just add a few saline drops to the tube and it's totally useable again. I get a lot of wear from one tube.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "pinupglamour":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"9 Jul 2015",
         "title":"This definitely gives Benefit mascara competition",
         "description":"i absolutely love this mascara is goes on wonderfully and I love the brush. It volumizes lashes and lengthens them. I think it gives Benefit Cosmetics a run for your money, they're both wonderful mascaras but I like this one better"
      },
      "carlzzz":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Mar 2017",
         "title":"volumizing",
         "description":"I really love how voluminous and thick this makes my lashes. It has never flaked or smudged for me like the other users point out."
      },
      "Saharraf":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"22 Apr 2014",
         "title":"creation of a virgin",
         "description":"I think the person who named this was a virgin. this is an OKAY mascara. very below average.. so not the hype"
      },
      "AndreaAn":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"24 Jan 2015",
         "title":"Disappointing",
         "description":"I purchased this mascara in hopes of crazy voluminous lashes (like I read by other reviewers) and it did just that. It gave me amazing lashes but after a couple hours I had massive smudging and flake problems. It flaked all around my bottom lashes and would not stop no matter how many times I tried cleaning it. I have absolutely no idea what everyone else on here did to keep it looking flake free and beautiful but I know for me this mascara is not worth a repurchase.\n…read more"
      },
      "claire1949":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"6 Dec 2015",
         "title":"lengthens, but smudges ALOT",
         "description":"I wanted to love this mascara so much. I don't usually spend a lot for mascara and I do not pick up an expensive mascara without hearing a lot about it. I heard soooooo much hype about this mascara. Don't get me wrong, this mascara makes my eyelashes CRAZY long, separated, lots of volume. It is a good mascara, but I can't get past all the smudging and flaking. I have very long natural lashes with kind of oily eyelids and with a couple coats of this mascara in a few hours you can see little black smudge lines from my eyelashes!!! even worse on the bottom... just a mess. Even when I wipe it all away, if I wear the mascara all day when I go to remove it there is no mascara left because it's all flaked off..... I guess it makes removal easier. lol. Anyways, if you don't have oily eyelids or long eyelashes I would recommend, but I have a $3 mascara that does pretty much the same thing. (essence doll lash)\n…read more"
      },
      "WinniSF":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"13 Apr 2015",
         "title":"I initially received this product as a free sample. I loved how noticeable my lashes were with just one application. It truly provides volume, especially after about 3 coats. My fiance even thought I was wearing fake lashes! Downside is that the the wand is wide, so it makes it difficult in reaching the tiny lashes in the inner corners. Also it can start to clump if you try to apply more after the product dries on your lashes. Overall, I still love the way it makes my lashes look so I went ahead and bought the full size.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "abbymathes":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"29 Sep 2014",
         "title":"HOLY GRAIL",
         "description":"I don't think I have ever left a review on Sephora.com, but this mascara has prompted me to write one. I do not use this term lightly, but this is the real deal - a holy grail mascara! It does everything the package claims - lengthens, volumes, defines, and it's super black! I wasn't going to buy this, but I saw Zoella use it and had to. BUY THIS PRODUCT IT IS WORTH THE PRICE AND SO MUCH MORE!!!"
      },
      "Hollywoodchica":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Mar 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Not For The Sensitive Type"
      },
      "Briaanaa":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Jul 2014",
         "title":"Volumizing and voluptuous",
         "description":"Great mascara and it does an incredible job in making your eyelashes look bold and voluptuous!"
      },
      "mza13":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"29 Sep 2016",
         "title":"Love love love",
         "description":"I've gone through and experimented with many brands of mascara and this is my absolute one and only mascara I will always use. My lashes are very short and thin and this mascara thickens and lengthens without the clumping."
      },
      "valeria0893":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"9 Dec 2015",
         "title":"NOT WORTH IT!!",
         "description":"If i can rate with 0 starts i would! I dont know what it it the deal with the mascaras these days, but i havent had the chance to find a good mascara and this is not the exception! It waay to clumpy! Like WAY TO CLUMPY! I was at the store and they make a big deal about this mascara so i bought it but i will return it ! It is heavy, clumpy and awful! I was so disappointed to spend my time and money buying this mascara. If you like clumps and heavy mascaras go for it, but personally i don't like it even a bit!\n…read more"
      },
      "vmichellea":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"3 Sep 2016",
         "title":"disappointed",
         "description":"Love the mascara the first ten minutes but throughout the day it flakes awful! Can't risk wearing it one day because the outcome is having the flakes and black smeared on your under eyes and face."
      },
      "letsflyaway":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"14 Dec 2013",
         "title":"BEST MASCARA EVER :)",
         "description":"this is definitely the best mascara i've tried so far! it lengths and creates volume without clumping and spidery lashes. the only con i have is that its quite wet so i often have to clean up the mascara that ends on up on lid :/ but you get some, you lose some!"
      },
      "mirandakane11":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"23 Jan 2017",
         "title":"Smears and Flakes",
         "description":"I should preface this with the fact that I have long lashes and normal to dry skin. This product smears very easily, and also flakes really easily. I'm not sure how a product could be dry, yet smear at the same time. Oh! And I don't really like the brush either. Not worth it."
      },
      "beccab00":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Jan 2017",
         "title":"love it",
         "description":"Just tried this out for the first time today on its own and I love it. My lashes looked so much fuller and so did the roots. So glad I'm getting the full size version!"
      },
      "jfo908":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"11 Jan 2014",
         "title":"Pretty darn good",
         "description":"I've tried all types of mascara. This is definitely up there with one of the better ones. When I went out one night, someone asked me if I was wearing false lashes! So I guess I'd say the mascara does a pretty good job! :)"
      },
      "mkatie25":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Dec 2015",
         "title":"best mascara ever",
         "description":"When I first bought this product I felt like the mascara was too clumpy but actually it turned out looking great! Love this product and I'll definitely use it for a long time. Too Faced never fails to impress!"
      },
      "amlatson":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"22 Aug 2016",
         "title":"The BEST and the WORST",
         "description":"Without a doubt, this is the most amazing mascara I've ever used. BUT it smudges SO quickly and I can't stop that from happening no matter what I do. I can only wear it if I know I'm going to a short event. I would love to find a way to use this without the smudging. It would be the best mascara ever made. For real. But sadly, I can't buy it."
      },
      "rhondababy":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"21 Mar 2016",
         "title":"panda eyes",
         "description":"This stuff smudges and flakes. I don't usually have this issue and I've tried just about every mascara in sephora and drugstores. By the end of the day I have dark mascara smudges under my eyes and not much left on my lashes."
      },
      "Yas0005":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"1 star",
         "date":"2 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I heard so many good things, and was disappointed when I got it. It’s super clumpy and messy. I would not recommend this product."
      },
      "ADFlores":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"11 Jul 2014",
         "title":"Nothing special",
         "description":"Okay, so this is certainly NOT better than s*x. Honestly, I wasn't wowed in any way. I think the brush is an odd shape for my almond eyes. My left eye turned out beautifully, but the right just would not match. This isn't a problem I normally have and I'm convinced it's because of the odd wand. After attempting to even out the right eye, the mascara started to get goopy. Not wonderful. It isn't awful... but nothing special.\n…read more"
      },
      "bourn2fly":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"25 Jun 2015",
         "title":"Because of the great reviews I automatically bought it. However it was very goopy after the first couple of times I used it.",
         "description":""
      },
      "redfreckles":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"14 May 2016",
         "title":"Perfect/Non Clump",
         "description":"A friend at work told me about this mascara - I was not sure/sceptical, however, I am very glad I purchased. I have some other Sephora mascaras and this is the best as it gives you length without the major clumps. I also find it bothers my eyes less."
      },
      "OrientalWhisker":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"7 Mar 2014",
         "title":"Love it, but smudges easily",
         "description":"I love this stuff and got it as soon as it came out! It goes on dark and thick (but not clumpy). It really brightens up my eyes and makes them look wider and bigger! My only complaint is that it dries slowly and smudges very easy! I wish it were waterproof!"
      },
      "dancingdream99":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"10 Nov 2014",
         "title":"The mascara that cannot be named!",
         "description":"I'm having a bit of a giggle because, apparently, we cannot refer to the name of this mascara in our reviews since the \"s\" word gets flagged as profanity. I got a small size of this mascara in the Everything Nice palette the other day and I quite like it. So far, no smudging (though that could change - I hope not, though). The brush is a bit weird - the shape and the spikiness of the bristles. This does give a bit more of an artificial look than I prefer in mascara (which is why I much prefer Bobbi Brown Intensifying Longwear). But this is a nice enough product. As for it living up to its name - well, unless your love life is in desperate need of help, I would think the name is more than a bit hyperbolic!\n…read more"
      },
      "AshleyDeskins":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"5 Dec 2013",
         "title":"My New Favorite",
         "description":"I have probably tried every mascara you can possibly think of and this is definitely in my Top 2! Love to volume and it looks just as good at the end of the day as when you put it on the morning!!"
      },
      "Alenka15":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"2 Apr 2014",
         "title":"Very disappointed!",
         "description":"I bought it twice. First time i had to return it because there was something wrong with the package, all mascara was on the brush when you pull it out. The second one worked ok, but I didn't like it at all. Still too much product on the brush, not long-lasting, very clumpy. I liked it only for first few times when it was very new. Not worth the money spent for sure."
      },
      "ca67":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"16 Sep 2013",
         "title":"I've finally found THE ONE!!",
         "description":"I love this stuff!! I'm not sure what's in the magical potion here, but it's awesome. The clincher for me, was when I saw a photograph of me wearing the mascara, and my eyelashes popped!! They looked like glamourous falsies! LOL I'll not be wearing any other mascara now. Oh, and it is also very very jet black. You've gotta try this!!"
      },
      "Modernaires":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Dec 2013",
         "title":"Best Mascara on the Market!",
         "description":"I received a sample of this mascara in the Lash Stash holiday set. It adds volume, fullness, definition, length and leaves your lashes feeling flexible. It can be a little tricky to take off but in a good budge proof, water-resistant kind of way. I notice some slight curling as well, but I feel that may be the brush/wand over the formula. It's a great mascara and I'll definitely be purchasing a full sized once I'm done with my sample.\n…read more"
      },
      "muggsymoo":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"28 Mar 2014",
         "title":"Didn't like this mascara",
         "description":"Since I have very short and thin eyelashes, I am always looking for a great mascara. I am an expert at applying and if I have a good mascara, my lashes look great. I did not like this mascara at all. It was very clumpy and did nothing for me. I tried it for 2-3 days to give it a chance, but really disliked this product."
      },
      "sugarfix":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"27 Dec 2015",
         "title":"Disappointed",
         "description":"I have tried a lot of different mascara a over the years, and was told this one was great. Sadly my normal mascara was out of stock. I have never had a mascara flake off so fast and smudge under my eyes. Love the brush it comes with just terrible formula."
      },
      "makeupfan12345":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Feb 2016",
         "title":"a tip for fallout!",
         "description":"First time i purchased this mascara i loved the effect it had on my eyelashes but HATED the fallout so i returned it. Then i got a sample of the mascara and tried using a mascara primer (i used the Dior one) With a primer it does not flake off!"
      },
      "toofacedho":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"30 Mar 2017",
         "title":"god help this mascara",
         "description":"i am only writing this review because i am ticked off that i do not like this product when everybody else seems to love it. this mascara just doesn't do anything good for my eyelashes, and i've tried so hard so many times to love it but i get the same, god-awful results: -my eyelashes stick together in the middle of application making separation impossible -extremely clumpy -flaky the description of this mascara on here could not be farther from what i've experienced. \"...separates...\" excuse me......... it PUTS EM TOGETHER.\n…read more"
      },
      "linderfaye":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"3 Jan 2015",
         "title":"Best so far",
         "description":"Being of thin hair and short eyelashes, this has been the best volumizing mascara I have purchased. It grabs every little hair and thickens it!"
      },
      "bdeleon":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Aug 2013",
         "title":"Love/Hate",
         "description":"I bought this mascara about 3 weeks ago and I've absolutely loved it!!!! EXCEPT it dries out too fast. Within the second week of using it I had to wash the brush out and take the gunky mascara that was starting to build in it. I've been cleaning the brush once a week so it doesn't clump, but besides that it's amazing!"
      },
      "Abbiev93":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Mar 2014",
         "title":"The best mascara I've ever used!!! Totally worth the money. I've always had a hard time finding a good mascara but I've finally found it!",
         "description":""
      },
      "CamrynBolohan":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"29 Sep 2016",
         "title":"Good then Ok",
         "description":"This mascara is amazing the first few times you use it, but I find it dries out REALLY quickly and I have to constantly be buying new ones writhin a 2 weeks or so"
      },
      "windy":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"12 Aug 2013",
         "title":"Intense Black Color...",
         "description":"I have short stubby lashes, this product gave my lashes that deep black look, that made them look natural and thick not fake and messy...would buy this product again"
      },
      "bethi31":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Jul 2014",
         "title":"Disappointing",
         "description":"For the price and the hype I expected a lot more. A huge fan of Too Faced and this was not even close to the quality of other items I have purchased. The mascara,on first use, was clumpy and did nothing spectacular to my lashes. I've had better luck with drug store brands than this."
      },
      "irishfemme":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"27 Apr 2015",
         "title":"Flaky flakes",
         "description":"I like the volume and texture of the mascara but I am having trouble with flaking throughout the day. I keep brushing flakes away and getting them in my eyes."
      },
      "melreed717":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"6 Jun 2015",
         "title":"least favorite high end brand",
         "description":"Already have long lashes, and this mascara does nothing for them. This mascara is really globby, and I have to comb them out with a lash brush. I have serious raccoon eyes every day I wear this. Definitely not my favorite."
      },
      "Hopesandreams":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"21 May 2017",
         "title":"not worth it",
         "description":"This is not at all worth the hype. If you like defined lashes use something else. The brush makes everything clump together and it looks bad."
      },
      "curlycue9":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"4 stars",
         "date":"16 Mar 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Worth the Hype"
      },
      "knava3":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Jan 2016",
         "title":"flakes!!!!!",
         "description":"When it first came out I was super excited to try it first week in and it was flaking like crazy threw it out, Weeks later I decided to purchase another tube and give it a chance(maybe I had got a defective one) nope same problem."
      },
      "jnuhlane":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"10 Nov 2014",
         "title":"I had high hopes...",
         "description":"The lovely makeup girl at my local Sephora recommended this when I asked for a new mascara ( had been using Clinique forEVER)... this came HIGHLY recommended by her and when I checked out the checkout counter was even telling me how great it was... then I started to use it. The first few tries were great, a little hard to remove but it was OK... then it got clumpy. The wand is a MESS now, and whenever I use it - i wind up having to take a cu-tip to my eyes and dab off the excess. Totally bummed on this one.\n…read more"
      },
      "nxnw":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Apr 2016",
         "title":"My favorite mascara",
         "description":"I started using Dior Show when I was quite young, after 5 years of that obsession I noticed the formula started changing and didn't offer the same effect. So I began a quest to find a new favorite mascara; I tried just about everything under $40. I found Better Than Sex just shortly after it was released and have never gone back. Yes, it eventually dries out and gets a little clumpy but in my experience every mascara in this price point does sooner or later. You also get the potential for rub-off under your eyes since this stuff adds so much length, but once you get used to the fact you know to keep an eye out for it throughout the day. The pros completely outweigh the cons in my opinion. As long as you're patient and take the time to apply correctly, comb and touch up any goofs, you're going to have dark, full, lengthy lashes.\n…read more"
      },
      "SammL94":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Aug 2016",
         "title":"Very Volumizing",
         "description":"This mascara is my go-to. It coats each lash perfectly and does a great job of separating them. It's an intense black formula that makes my lashes look great. I love how this applies & I'll keep buying this one!"
      },
      "bottomofthemap":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Jun 2016",
         "title":"it's fyre",
         "description":"I bought this mascara without ever hearing about it. I used Estée Lauder and other more expensive mascara before, what a waste that was. As soon as I put on BTS , I knew I wasn't gonna use any other mascara again. My lashes were full, and long and I only used one coat . I'm not quite sure what this whole flaking complaint is about , but I've never had that problem and I've been using BTS for more than a year. The only explanation I can come up with is that you guys probably put on several layers of the product and therefore it will flake, of course. Anyway, I looovvve this mascara , and I will use it until I can't use it anymore.\n…read more"
      },
      "trixxi3thousand":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2016",
         "title":"awful",
         "description":"Completely comes off on my face under my eyes. Clumpy waste of money."
      },
      "LocaLgurLy85":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"17 Feb 2014",
         "title":"my fave",
         "description":"I have tried many different brands and types of mascara and none has done to my lashes what this one has done. My lashes are long and full and lasts all day. Yes the brush causes some clumping at times, but that is really my only negative comment. That and it sells out of stores really quickly. Love this product."
      },
      "iammacey":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"30 Jul 2014",
         "title":"Very messy and clumps",
         "description":"I was taken by the name but that's it! It was very messy and totally clumped my lashes. I sent it back. Sorry -"
      },
      "Holley08":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"18 Jan 2014",
         "title":"Finally",
         "description":"I love the idea of mascara but have never found a brand that worked on my thin short lashes. I tried this on in Sephora and was immediately hooked. It's like magic on my eyes. Every time I wear it I get a compliment. Worth the money."
      },
      "jabughao":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Dec 2015",
         "title":"Best mascara",
         "description":"Confused as to why this product doesn't have a full 5 stars! Best mascara I have ever purchased. I have very long lashes and most mascaras just clump my lashes together. This is the only mascara that separates and volumes each lash! Worth the money."
      },
      "enfin777":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Jul 2014",
         "title":"Love this Mascara",
         "description":"I have spent years looking for a great mascara and this one is it! Makes my eyes pop. Highly recommend"
      },
      "joshsangel":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Mar 2014",
         "title":"Love this!",
         "description":"I thought I had found true love with Benefits They're Real mascara but it dried out my lashes and flaked on my skin. This Better than ...(every time I try submitting this review it tells me there's profanity in it..assuming they don't like the name) mascara is AHMAZING! Gives me super plump, full, sexy lashes without the drying or flaking. Honestly new favorite."
      },
      "chloebelle44":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"4 Apr 2014",
         "title":"My first impression was how long it made my lashes look. I found that with two coats, this mascara did a wonderful job. With more than two, for me it was four, it became clumpy and got in your eyes. If you have a two coat maximum rule, this product is perfect.",
         "description":""
      },
      "natashanadia":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"2 Jul 2015",
         "title":"This is definitely one of the best mascaras I've used! I love it! It really does add volume and fullness! I took a star off because of the price.",
         "description":""
      },
      "ladyinalaska":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Dec 2016",
         "title":"I have long, semi-thick eyelashes and I really love this mascara. As a person who likes light eye makeup, this mascara takes it to a different level!",
         "description":""
      },
      "kellye8498":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"14 Apr 2014",
         "title":"Disaster in a tube",
         "description":"I got this mascara and was so excited to try it because I love too faced. Unfortunately it was a disaster! It's clumpy and makes my lashes stick together so even my metal lash comb can't separate them. There were globs of the mascara on some lashes even. Not ok. I managed to get the clumps off my spider lashes and decided to wear it at home to do a full review and by lunch I had black flakes all over my eyes and cheeks. This is, by far, the worst mascara I've used and I have a collection of mascara that would make a \"normal\" person faint. xD Just a bad design. Maybe if they made the too of the tube a bit smaller to help get the excess mascara off but even wiping the brush with a paper towel to blot off the excess didn't help. Back it goes.\n…read more"
      },
      "JennaBSunshine":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Mar 2014",
         "title":"! the best!",
         "description":"I've tried a different brand of mascara every 3 or 4 months for about 3 years! And this is the jackpot! Sexy and full lashes! No clumping, no spider lashes, no reapplication necessary! you can't go wrong !"
      },
      "Alice64":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Aug 2017",
         "title":"over hyped but a good buy",
         "description":"This mascara has a really dark pigment and adds so much length that people have asked if I was wearing fake lashes. However it can be very flakey and clumpy. It's not better than sex but it's a good mascara."
      },
      "Meribor":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 Jul 2015",
         "title":"doesn't do the job",
         "description":"The brush is too big for my tiny lashes. It doesn't last very long. It clumps. It ends up smeared under my eye within an hour or two. Nope."
      },
      "KristenSw":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"19 Mar 2017",
         "title":"Looks Great At First",
         "description":"This mascara delivers its promises at first by giving you lashes that pack a punch, but as the day goes on the mascara fades and flakes everywhere! Very disappointing. This is no longer my go to and I can't wait until this tube is done so I can try something else."
      },
      "CarlyFerg":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"24 Jan 2017",
         "title":"I bought the same size of this mascara. Overall a good mascara, but not worth the price of a full size, in my opinion. I'm not sure who called it \"better than sex\", because it certainly isn't. Makes me wonder what kind of sex they're having...",
         "description":""
      },
      "drnic":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"25 May 2015",
         "title":"Nope.",
         "description":"Wanted to like it but didn't. The formula took forever to dry on my lashes, which I could get around. What I can't get past is the fact that I was washing my hands and water splashed a bit in my eye..and this mascara ran down my face. I understand it's not waterproof, but it should have at least some staying power. Returned it."
      },
      "lisajess":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 Mar 2015",
         "title":"not good",
         "description":"Flakes so bad your eyes will be black after a few hours of wearing it, way to expensive too."
      },
      "julietteSK":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"2 stars",
         "date":"1 Jun 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"let down"
      },
      "Leaahelaine":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"26 Oct 2016",
         "title":"YES!... Oh wait",
         "description":"I thought I had hit the mascara jackpot, then I noticed it started getting more difficult to apply and it wasn't completely saturating my eyelashes like it had previously. Once you break in a mascara its the best time to use it, but I feel like with this one once you finally get to that point it seemed to dry out and not want to do its job. In order for me to be able to use it I have to warm the tube up with hot water to get it to corporate. Almost more hassle than its worth.\n…read more"
      },
      "greenleaf777":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"28 Feb 2017",
         "title":"Nice but not better than sex",
         "description":"I wouldn't say this mascara lives up to its name but its decent enough. The flaking at the end of the day is quite irritating especially for the eyes but you do get some nice separating and length. Also I did find the shape of the brush a bit awkward."
      },
      "CassyBoBassy":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"18 May 2016",
         "title":"not quite better than sex",
         "description":"I really do love this mascara if it weren't for the fact that after 5-6 hours of wear my eyes start to become very irritated. Other than that it makes my lashes look long thick and as black as my heart. Will be buying this product again as its the best I've come across so far."
      },
      "pettyprincess":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"17 Dec 2016",
         "title":"yikes",
         "description":"i had a feeling i wouldnt like this and i was right. it lengthens and all that but it flakes everywhere within an hour. definitely not better than sex"
      },
      "Mary8675":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"17 Apr 2017",
         "title":"good",
         "description":"definitely makes your lashes look crazy good but it can be a little clumpy and smeared when I applied my setting spray. i would recommend this though because it makes your lashes so long."
      },
      "MelinaGh":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Aug 2016",
         "title":"Okay its a great mascara for people who already have pretty long lashes. i have a friend that has short lashes and it did almost nothing for her, but i have pretty long natural lashes so i mean i guess thats why it was so good for me. Its only clumpy at first once i apply a few coats it looks better. Recommend it for people with long lashes.",
         "description":""
      },
      "JValley0714":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"27 Feb 2014",
         "title":"Holy Wow",
         "description":"This stuff is awesome! Full eyelashses are no problem and it definetly lengthens. I wouldn't recommend this for somone who is solely looking for a defining maskcara as it can get clumpy."
      },
      "RxyH":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"16 Nov 2015",
         "title":"Don't know why people love this so much. All it did for me is clump. If I got the clumping down to a minimum it did nothing for my lashes.",
         "description":""
      },
      "taylorlanae":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Oct 2016",
         "title":"In Love",
         "description":"I have an ok length for eyelashes that don't curve and are light. I was pretty hesitant about getting this, but I heard great things. So one day, I said why not? Best decision eve for my eyelashes. The mascara makes them so long and dark and voluminous and I get lots of compliments. 10/10 would recommend"
      },
      "merrickt":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"26 Apr 2015",
         "title":"dont get this mascara",
         "description":"This mascara (should I even call it this because its more like black gunk) clumps my lashes and DOES NOT separate. Yes, it makes my lashes longer, but not any longer than a regular drugstore mascara. I thought that getting a high end mascara would work better than my drugstore one. its not, in fact its worse. Its also flaky and if you have it on for a really long time then it flakes off completely. I would never buy this product again.\n…read more"
      },
      "Knguyen28":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Apr 2016",
         "title":"my favorite!",
         "description":"Always go back to this mascara! Used to use Benefit's They're Real, but this one isn't as drying on the lashes and makes them look thicker."
      },
      "Aurora513":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Feb 2016",
         "title":"love it!",
         "description":"I've tried every hypoallergenic and \"safe for contact lens users\" mascara you can imagine and NONE worked....ONLY this one!!! This one is the perfect fit for those that, like me, want great lashes but are allergic to almost every mascara in the market!"
      },
      "Kickboxerkelly":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Feb 2014",
         "title":"One of my favorites",
         "description":"I've tried so many mascaras this year. I always do my research and pick the best ones. But I keep coming back to this mascara. It volumizes and actually lengthens substantially. It provides a bit of a curl too! It doesn't get spidery like Benefit's They're Real. My other fave is lash domination but BTS just makes my lashes so much longer. I will always have a tube of this on hand even though I keep experimenting with other mascaras.\n…read more"
      },
      "Cursivecandy":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"14 Aug 2017",
         "title":"looks great, smudges during the day",
         "description":"I will say this is probably my favorite mascara visually - it makes my lashes look full and super long. On a regular makeup day (foundation, concealer, and translucent powder under the eye) this mascara starts to run big time around the 5 hour mark. I had full on raccoon eyes in the middle of my work day - I wouldn't purchase this again. I don't have issues normally with mascara running and gave this a week's worth of use before leaving this review. I was in an AC'ed building all day and this thing STILL ran\n…read more"
      },
      "lubogle":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2017",
         "title":"nope",
         "description":"Flakey with terrible fallout and makes your lashes clump. Don't buy it."
      },
      "fly2neverland":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"24 Mar 2016",
         "title":"Love!",
         "description":"My experience with this product has been wonderful so far! I've used the same drug store mascara since I can remember because I can never find another one I've liked. I've heard so many good things about this mascara I made my first expensive makeup buy and picked it up. I LOVE it! It's very light and gives my lashes length, volume, and a whimsical look to them. I only rate 4 stars because I've experienced very minor flaking when applying (no flaking for me throughout the day) and I wish it came in a waterproof option.\n…read more"
      },
      "SarahBeth006":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Mar 2014",
         "title":"Oh SO much \"Better Than S-x!!!\" ;)",
         "description":"I thoroughly read the majority of reviews (good AND bad) prior to purchasing anything. I have very short, basically nonexistent eyelashes and I have had trouble finding mascara that will give me the WOW factor. I was very excited to try this but nervous due to the bad reviews, therefore I got a sample of it. First, let me say I am in LOVE. I am a female firefighter, therefore I like to wear a touch of makeup to still feel a bit feminine, but I cannot go all out on a daily basis. I have had problems in the past with mascaras flaking off or rubbing off and getting in my eyes when I have my gear on and it can cause a big problem. 'Better Than S-x' doesn't disappoint!!! I usually use 2-3 coats (letting it dry in between), but even after just ONE coat, my eyelashes look amazing! YES, it Is a thick mascara and appears to be \"globby\" on the tube. But, its a very simple fix. Take your eyelash brush/comb and run it through the bristles. I have only had to do this once and the thickness of it is what makes it so amazing! Once it is dry, no flakes all day and it doesn't rub off easily either! I STRONGLY recommend this. My husband has even commented on my \"sexy\" lashes! Just purchase it or you can get a sample in the Sephora Lash Stash Sample Kit. It will be the best choice you ever make! I mean c'mon... it Is 'Better than s-x!!\"\n…read more"
      },
      "jcckie":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"21 Mar 2016",
         "title":"Love love love!",
         "description":"I absolutely love this mascara! It adds volume, length, and extra curl!"
      },
      "SaraSy":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"15 Jul 2016",
         "title":"nice but smudged by end of day",
         "description":"This is great if you like a full look. It curls and lifts and adds volume. But by the end of day I have black smudges under my eyes and I only use it on my top lashes."
      },
      "ACOLOMBE":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"9 Dec 2015",
         "title":"Good effect, fast to dry out",
         "description":"I really enjoyed using this product. I found that it gave a beautiful fanning and thickening effect to my lashes. The downside of this product is that it dries out quite quickly and becomes very clumpy and hard to work with."
      },
      "Kimmystar23":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"28 Feb 2014",
         "title":"MAGIC IN A TUBE!",
         "description":"I adore this mascara so much! it makes my lash look amazing long and yet so pretty. it es everything is says. i got the small size. a mouth ago from using it at once l i had notice that my lashs have been longer which just wows me for what this can do... this stuff is magic in a tube! it's a must have and i cant live without this!"
      },
      "isukiii":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"10 Nov 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Flaky and smudge"
      },
      "ariana924":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"3 Sep 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Definitely not better than sex"
      },
      "veritabelle":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"13 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Excellent- but Smudges"
      },
      "KiaraAlexis":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 Feb 2016",
         "title":"Good Product, Mediocre Brush",
         "description":"I recommend this for its volume and pigment. I like the product but the brush can cause it to clump and requires more effort than should be necessary. Formulation seems to be great but after a few hours the color can transfer to my brow bones. All it really needs is a better brush and more staying power and it would be perfect."
      },
      "LoveForLife":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"8 Apr 2014",
         "title":"Doesn't Live Up To It's Name",
         "description":"I got this as a gift along with the Too Faced 3-way eye liner. I love the liner but this mascara is just meh. This is my first high-end mascara and I was expecting much more from it since it is high end and Too Faced is normally pretty good. The brush is more hourglass shaped than shown so I don't know if that has anything to do with it, but when you put it on it's super clumpy, but you can get the clumps out which leaves you with super dramatic eyelashes, which I don't really prefer for everyday wear, but for special occasions it's prefect. However, it doesn't seem that this mascara drys at all. After about 30 minutes, I went to move my hair away from my face and my palm barely grazed my eye and the mascara was everywhere and all of my lashes had stuck together towards the outer corner of my eye. Personally, I prefer my drugstore ones but I'll probably use this one and avoid touching my face just so it doesn't go to waste. Just really disappointing.\n…read more"
      },
      "userrr5":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"3 Jan 2016",
         "title":"okay....",
         "description":"Not too impressed with this product- very clumpy but it does give good volume so I will give it that. Don't think I will be re-purchasing..."
      },
      "elianaxlc":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Jul 2016",
         "title":"better than sex mascara",
         "description":"This is probably the best mascara I have ever used!! Although it's not water proof I never wear makeup when I'm surfing because NOTHING meets my standards:)But so many of my friends have complemented me saying if I wear fake lashes!! I recommend this to everyone!!!!!! There is one change I wish they could make though, I wish it went on smoother when I put it on:1 But over all best mascara ever\n…read more"
      },
      "crivers":{ 
         "extra_info":"<b>Skin Tone</b> Deep",
         "stars":"5 stars",
         "date":"20 Jan 2015",
         "title":"Love love",
         "description":"i have length but i needed volume w/o clumping and this does the trick and even adds a little length! I use a little translucent powder on my eyelashes first, apply this and it doesnt run at all for the full day!!"
      },
      "misshoneybby":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Jul 2015",
         "title":"This is probably the best thing ever from too faced . I'll never buy another mascara again . Makes my lashed look fake and I get compliments all the time...and seeing as I live in Texas and everyone loves their mascara here that says alot",
         "description":""
      },
      "Aimsyy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Jul 2015",
         "title":"Loads of Volume and Length!",
         "description":"I've been on the great hunt for a mascara that really delivers and lives up to its talk, but I'd never found one. Until I tried on this mascara at Sephora and it has honestly been life-changing. It gives such great volume and length, I love it! I can see in pictures how great my lashes look, and it gives me such a surge of confidence! It also has the bonus of not cumpling, and giving my lashes such a beautiful dark coat. Better than sex? I'm sure many people could argue that. Better than all the mascaras I've tried (alot)? Definitely, without a doubt!\n…read more"
      },
      "rikspiks":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"14 Sep 2016",
         "title":"Better than what I had, still lacking",
         "description":"In full disclosure, I will repurchase this until I find a better mascara. I like that it is thickening and the black is great. It doesn't flake off. However, the brush and tube design is odd. I continually have to clean the brush because the edges of the hourglass shape, so I just am basically wasting product. The formula is so heavily thickening that it actually undoes the curl I put in my lashes which is frustrating. I made the switch from a drugstore brand, but may just switch back if I find myself in a drugstore before a sephora.\n…read more"
      },
      "hamacle":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Feb 2014",
         "title":"ignore the bad reviews!",
         "description":"I had a distant friend recommend this mascara to me but I wanted to check out all the online reviews first--I swear I watched so many videos and read so many reviews and honestly the majority said it would be clumpy, spidery, cakey, and overall not worth it. I went ahead and ordered it anyways and I'm so glad I did. Yeah, if you put three full coats on like the box suggests, it's not going to look good. but its such a good mascara that you don't need to take it that far. One coat gives me really defined and volumized, longer, and slightly curled lashes without even making it look like I have a ton of mascara on (and i have very light colored lashes). Two coats is perfect for going out or wanting to look a little nicer. I have had no problem with the weird shaped brush or clumping issues, if anything my lashes have been more defined and separated than with any other mascara i've tried. like I said though, avoid putting on three full coats or else you will have those issues. Overall, I'm so happy. never cared about my lashes and now i do! \"better than s*x\" though is a totally awful name and should probably be more like \"you're probably not having great s*x so you might as well buy some decent mascara\"\n…read more"
      },
      "retrovixen":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Feb 2015",
         "title":"In the world of cosmetics, it is better than s*x",
         "description":"This mascara has changed the way I view my makeup routine. One coat was very natural looking and defined. Two coats is stunning and my lashes look amazing. Three coats and my lashes seem to enter the room before I do! They're thick, full, voluminous, and curly! These are all words I would NEVER attribute to my natural lashes which are stick straight, sparse, and thin. This mascara definitely gives you the appearance of false lashes without having to deal with glue and the possibility of having them look weird. I love this mascara and I have absolutely NOTHING negative to say (which is a miracle because I do like to complain lol). Would definitely recommend to anyone looking for a new mascara :)\n…read more"
      },
      "amanda45":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"26 Jul 2016",
         "title":"decent mascara",
         "description":"I absolutely love how this mascara makes my lashes look, but unless I don't put mascara on my lower lashes, it flakes all under my eyes. It even does this sometimes when I leave the lower lashes natural, but you can't beat the volume that it gives you."
      },
      "Suheer":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"1 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Terrible"
      },
      "VanSlappy":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"19 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Looove!"
      },
      "itshannahqurl":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Feb 2015",
         "title":"Broke By Fourth Use",
         "description":"I only used mine 4 times and it was broken. There was mascara everywhere. I wasted $20 on this and I'm very upset about it."
      },
      "ChristinaKiou":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Jun 2015",
         "title":"Great for volume",
         "description":"Such a great mascara. I have a lot of long eyelashes and it adds volume like crazy but it doesn't do much with length."
      },
      "legallyblondie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Sep 2013",
         "title":"Fab Mascara, but not better than s-e-x ;)",
         "description":"I used my usual mascara primer (Dior), and one coat of Better Than S-e-x Mascara over the primer made my lashes full, long, and separated--really amazing! I barely needed a second coat (and I always use a second coat of my favorite mascara, Diorshow). Today I tried it layered on top of Benefit's BADgal and loved it even more. I haven't noticed the smudging and fall out that people mention in other reviews, but I do use Urban Decay's All Nighter setting spray every day (another holy grail product). My lashes are naturally long and curly so I can't speak to the curling properties, but if you love voluminous eyelashes, this is the product for you. This mascara is definitely going into my permanent rotation, but is it better than s-e-x? Negative. ;) (I'm not sure why Sephora won't let me use the S word, since it's a) not profanity and b) the NAME OF THE PRODUCT.)\n…read more"
      },
      "missnanci":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Jan 2014",
         "title":"Luv this mascara!",
         "description":"I love this mascara, it doesn't even require for me to use an eyelash curler. My only recommendation is that you use an eyelash groomer/brush/definer because it can come on clumpy and if your not careful give you spider eyes."
      },
      "crt926":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"25 Jan 2015",
         "title":"Not my favorite",
         "description":"This product was super clumpy and did not lengthen as I was hoping. Definitely not my favorite."
      },
      "TinkaM":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"2 Jun 2015",
         "title":"just ok",
         "description":"This mascara isn't bad, it does give volume as promised. It does clump badly but easy to get under control with your eyelash comb. My biggest problem is that it rubs off badly on my upper eyelid so I'm constantly removing black smudges all day."
      },
      "Ailynchacon":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Feb 2017",
         "title":"HOLY GRAIL MASCARA",
         "description":"I just love how it makes my lashes look so full and fluffy!!!!!!!! My number one fave mascara :-)"
      },
      "Ngangy":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"5 Mar 2017",
         "title":"Why",
         "description":"I don't get the hype. This mascara did not lengthen, thicken, darken or anything! My lashes look naked. Considering the name, I feel sorry for the TF team. Hope they have better experiences in *that* department soon."
      },
      "Beatleschick":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"5 Nov 2015",
         "title":"HG but imperfect",
         "description":"This mascara is without a question my HG. I find that it gives me instant volume, length, darkness, separation... everything you could ask for in a mascara. The brush is great; it's simple but does the trick. I rarely get any clumping together of my lashes when I use this product, and my lashes always look full and fabulous with it on. Not to mention it's paraben free! Now, that being said, if you want the amazing results this mascara gives, you have to be patient with its flaws. It is a bit flaky, especially when it's being removed, and often times I end up with tiny smudges under my eyes at the end of the day. It also is definitely soon not waterproof, and I've cried it off many a time. Despite its questionable wear time, I keep going back to this mascara because it gives me more drama than any other. If you're a fan of dramatic lashes and aren't bothered by mild smudging, then you'll love this one.\n…read more"
      },
      "Cece8":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"20 Apr 2017",
         "title":"Disappointed",
         "description":"Purchased mascara after Sephora employee raved about how great the product was. She said other customers loved it, its a top selling product, blah blah blah. I purchased it and so did my mom. We are both disappointed and do not like the product. It flakes, runs and I have to check my eyes frequently to make sure I don't have racoon eyes. I also do not like the large wand and the way the mascara just clumps on it. What a waste of money. I am better off buying the $8 mascara I have used for years.\n…read more"
      },
      "ShylaWalker":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"31 Dec 2016",
         "title":"overrated",
         "description":"This mascara is pretty overrated it gets like clunky and dried up super quick ."
      },
      "angelixmay":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"28 Mar 2016",
         "title":"not better than sex",
         "description":"My two friends swear by this mascara so I finally caved in, and wasn't that impressed. I feel like it clumps all my lashes up and puts way too much product. But I have asian eyelashes that go straight down so finding a good mascara is impossible. To be fair, it works really good on my friends eyelashes"
      },
      "projectrunway":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"2 May 2017",
         "title":"Clumpy &amp; Flat",
         "description":"Everyone has been raving about this mascara and I really wanted to like it. However, it gets very clumpy when I use it to lengthen my lashes and my eyelashes uncurl/goes flat right away. It would be a good mascara for volume solely, and only when using it sparingly."
      },
      "emlouiseturner":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Jan 2014",
         "title":"Amazing!",
         "description":"This is my absolute favourite mascara ever. Its so thick and full and makes me look like I'm wearing fake eyelashes. It lengthens and thickens... Perfect!"
      },
      "marygranellaf":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"8 Mar 2014",
         "title":"Great!",
         "description":"I got this mascara as part of a Christmas gift last year and, to be honest, I immediately became obsessed! I don't have thick lashes at all but this makes them look three times thicker and darker. It does dry out rather fast and can end up looking too heavy on your eyelashes if you add too many coats."
      },
      "Leeci":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"6 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"flakes everywhere and ruins all other makeup you put on, don't waste your time."
      },
      "danaxn":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"18 Nov 2016",
         "title":"sex is better",
         "description":"Make your lashes significantly longer and have more volume but it was only great the first two times, after that it started making my lashes look clumpy and stick together"
      },
      "makeupaddictrn":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"15 Jan 2014",
         "title":"Takes some getting used to, but worth it.",
         "description":"This mascara makes your lashes lush and long. That being said, there's an issue with the wiper inside the bottle, and sometimes it just doesn't work and you wind up with a wand completely coated with product. Hopefully they work on that. I haven't had a problem with smudging or flaking. I get pretty dramatic, not clumpy lashes. I'd have given it 5 stars if not for the wiper problem."
      },
      "AlwaysWantMore":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"27 Jul 2015",
         "title":"Good but thought it would be better!",
         "description":"I read the reviews and saw how everyone raved about this mascara. It's not half bad but I was expecting more. It doesn't volumize or lengthen as much as I thought and it clumps more than I'd like. Overall I'm happy with it but I can't say I'd buy it again."
      },
      "vmglasner":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"7 Sep 2014",
         "title":"This is my number one mascara forever and ever.",
         "description":"I love this mascara more than anything in the whole world. I can dab a little on for a natural look or I can layer in on for an intense, dramatic look. It volumises like no other mascara ever could. It also is amazing at adding length and curl and definition. It dries pretty quickly, but I always save mascara as the last step in my makeup routine so I don't have to worry about it. It is also the strongest waterproof I have ever experienced in a mascara. I can sob uncontrollably and look in the mirror afterward and not have to reapply because my mascara has not budged. It doesn't run or clump or anything!!! I mean, come the end of the day, it is a beast to get off, but I've got a great makeup remover, so I don't mind (Neutrogena Makeup Remover Wipes, I swear by them!). Two critiques: If I wear concealer under my eyes, I do get a little bit of black gunk under my eyes by the end of the day, but if I don't wear foundation, or if I keep up my powder application throughout the day, I don't run into this problem. It's never too hard to wipe off. It comes off pretty easily with my finger, no smudging. And OH, how I wish this mascara came in BROWN. That's not really a critique, but I really do wish I had this is in brown for those days I feel like looking really natural. I recommend this mascara to anyone and everyone. It is my one true love. Forever and Ever. Amen.\n…read more"
      },
      "jasy15":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Jun 2014",
         "title":"An ok mascara but.....",
         "description":"This mascara is ok when used on it's own but it turns to a the best mascara when used with a waterproof mascara before applying this product"
      },
      "MakeupMeag":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 Jan 2014",
         "title":"Hands Down BEST Mascara",
         "description":"This is hands down the best mascara I've ever used. Now I'll admit, this mascara isn't for everyone. I prefer to have thick, long lashes, and that's exactly what this mascara does to my lashes. It suggests anywhere from 1-3 coats for a gradual intensified effect, but I found myself because pleased with simple 1-2 coats at most. The hourglass brush is genius and I'll never look at another mascara ever again. In absolute LOVE with the product. Highly recommended to anyone who wants full, thick, lengthy lashes.\n…read more"
      },
      "Allanoutme":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Feb 2016",
         "title":"flakey",
         "description":"I find by the end of the day I have flakes of mascara all over my eyes"
      },
      "leen1":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Jul 2013",
         "title":"LOVE!!!",
         "description":"Best mascara I have tried to date! DId not clump easily or smudge."
      },
      "Nialovely":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Dec 2013",
         "title":"lengthening",
         "description":"This mascara came with A Few of My Favorite Things palette (which I absolutely love and recommend) and I really enjoyed it because it gave volume and length to my short super thin straight eyelashes.. Will purchase soon!"
      },
      "GinaGiampa":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"27 Dec 2016",
         "title":"I like the wand, it makes my lashes look good, but a few hours later, it will shed so much it looks like I have under eye circles",
         "description":""
      },
      "lupex3":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"22 Oct 2016",
         "title":"To clumpy",
         "description":"It clumps up my lashed to much :("
      },
      "Ariel5":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"14 Jan 2017",
         "title":"Flakes",
         "description":"Volume, yes. Long wear, no. This mascara would be excellent if it lasted all day without flaking and giving me raccoon eyes. Constantly checking in the mirror to wipe under my eyes. Love the volume though, it only takes one coat. But even with a lash primer, it doesn't hold. And yes, they've changed the tube so the handle is longer and you get less product."
      },
      "danniedenise":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"6 Feb 2015",
         "title":"Goood Volumizing Mascara",
         "description":"PROS: This is a good volumizing mascara. It goes on thick and a couple of coats is enough. It comes off easily with makeup wipes. CONS: After about 4 hours, I've experienced the mascara smudging especially on the lower lash line. Plus there is a little bit of flaking. This is better for short-term wear (less than 4 hours)"
      },
      "Emmorty":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"18 Feb 2017",
         "title":"Annoying",
         "description":"I want to love this, but it smudges really easily, and I find it transfers all over the place...yet at the end of the day when it is time to remove my makeup, it is nearly impossible to remove."
      },
      "Jyllian":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"14 Nov 2014",
         "title":"Too clumpy",
         "description":"Looks like I am in the minority because I was not impressed with this mascara. Its is clumpy and a lot of product gets stuck on the wand and you have to scrape it off prior to using. Then, during the day it will create blackness/shadow under the eye. I will not purchase again. BUMMED!"
      },
      "tinabunny":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"9 Jul 2014",
         "title":"Not effective for straight Asian lashes",
         "description":"I had a lot of high hopes for this mascara from all the rave reviews, however it ended up a disappointment. I have short-ish, very straight, Asian lashes. I always curl my lashes before applying mascara. This mascara completely took the curl out and didn't do anything for my volume. It also smudged on me as the day progressed. The packaging is nice though..."
      },
      "atomicAmberlynn":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Nov 2013",
         "title":"Fantastic Mascara!",
         "description":"My lashes looked thick and were the blackest I have ever seen. I have very long lashes, but no thickness. I struggle to find a great mascara that thickens rather then lengthens. This is the one!! It is a little hard to use. If you are not careful you can coat your lashes with too much product and they clump together. Don't get discouraged!! I also love how soft and silky my lashes feel, even though they are covered in mascara! Quick Tip: This mascara is one you MUST wipe the applicator brush off, then apply. This way your lashes will not be clumpy.\n…read more"
      },
      "ashleyc132":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Aug 2014",
         "title":"Amazing!!",
         "description":"I'm a big fan of Too Faced products and this was my first mascara from the brand. I absolutely loved it. I have very sensitive eyes and most mascaras irritate my eyes, but this mascara did not one bit. It thickens and lengthens the lashes amazingly."
      },
      "callmefall":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 Nov 2016",
         "title":"Not Worth the Price",
         "description":"It was way too clumpy for paying 23 dollars! Not a fan."
      },
      "Lyas":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Apr 2017",
         "title":"Amazing, never had such a good mascara",
         "description":""
      },
      "bananagrams":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"19 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Clumpiest high-end mascara ever!"
      },
      "xayasouk90":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Jul 2014",
         "title":"Saw a review for this on youtube, so I decided to give it a try. Hands down one of my all time favorite mascaras I've ever tried!!!",
         "description":""
      },
      "sephoraceratops":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Feb 2017",
         "title":"#1 Mascara",
         "description":"As a contact lens wearer, this is my go-to mascara. Brush is fluffy and defines each lash with some serious pigment."
      },
      "makeupaddict205":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"4 Dec 2016",
         "title":"better than sex mascara",
         "description":"Overrated in my opinion. My drugstore mascara is better than this mascara. This mascara doesn't hold the curl in my lashes at all by the end of the day and it doesn't even look like I'm wearing mascara when I have it on after only about over an hour. Disappointed in this product because I heard nothing but greatness about it."
      },
      "ARodz24":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Aug 2015",
         "title":"No Lengthing just Clumpy",
         "description":"Me & My sister are Very disappointed in this product. My sister has already fulk and long lashes but this product made her eyelashes clumpy and heavy. I have short lashes and got this product to see if it can help in length. Nope. Just made mine clumpy and black was everywhere on my eyes. Waste of money."
      },
      "AllieErin":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"1 Nov 2014",
         "title":"Holy Grail",
         "description":"This mascara. Oh girl. It's extremely lengthening and gives the lashes an incredibly dramatic look, curling the lashes & bringing volume from base to tip. Doesn't clump too much if you apply in thin coats while waiting in between coats for it to dry. Have repurchased this mascara three of four times now & I am so so happy with it. I don't think any other mascara will be able to top this one."
      },
      "jjd4":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"14 May 2016",
         "title":"Best mascara I've tried. The only thing I don't like is it does leave black under my bottom lashes occasionally",
         "description":""
      },
      "cartoongirl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"20 Sep 2013",
         "title":"too chunky",
         "description":"Bought this mascara with high hopes. However I find that way too much product comes out on the wand. To where I have to wipe off the excess. As if there's nothing inside to stop all of the mascara goo from coming out. I'm not sure if my specific wand is defective or what. But I'm thinking about bringing it back. Which is something I hardly do. However once I wipe the excess mascara off, the mascara works decently. You only need to go over your lashes once. No need for build-up with this mascara. A little bit of product goes a long way.\n…read more"
      },
      "Rena27":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"7 Mar 2014",
         "title":"Love this mascara!",
         "description":"I absolutely love this mascara! I love the They're Real mascara as well, but this one has definitely taken over. You truly do only need one coat and it's so volumizing! It literally looks like you're wearing false lashes when you use this mascara. I DEFINITELY recommend it! It's incredible and completely worth the price."
      },
      "Mkg823":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Oct 2013",
         "title":"Title Says It All",
         "description":"Tried the sample of this in the best mascara collection. In fact, it was the first I tried from it! I love it and once I run out, I definitely will get full sized"
      },
      "saycaity":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"20 Feb 2015",
         "title":"Needs to be redesigned.",
         "description":"The opening of the tube is way too wide so the brush comes out overloaded with product. This makes application really difficult. I haven't been able to get a decent application from it yet. I checked the tester in the store and it has the same super-wide opening so I know it wasn't a defunct unit. Not a great choice for defined lashes."
      },
      "AshxlReviews":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Nov 2015",
         "title":"LOVE this mascara.",
         "description":"This is a very buildable mascara. It feels lightweight and doesn't flake or run off throughout the day. It also makes my lashes look very thick and black. I love it's hourglass shape, although it is large for my short lashes. It also isn't great for my bottom lashes, because the tip is so large. I still love the results and would definitely repurchase this item!"
      },
      "XCCheerTrack":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Apr 2017",
         "title":"Disappointing product. Looks amazing during the first two hours of wear but makes my under eyes black by the end of the day.",
         "description":""
      },
      "alohaLala":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Nov 2016",
         "title":"indeed",
         "description":"I'm in love with this mascara is the best out there, my lashes look AMAZING I been using it for a year."
      },
      "danie16":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"19 Aug 2018",
         "title":"Not Worth The Money",
         "description":"Not worth the money. The mascara clumps and flakes. It doesn't lift that well and looks very messy."
      },
      "cmbeautybabe":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Jan 2017",
         "title":"I will never use a different mascara!!",
         "description":"I can't believe how amazing this mascara is! Absolutely my favourite!"
      },
      "Seanna99":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"15 Aug 2016",
         "title":"Awesome!",
         "description":"This mascara makes my eyelashes extend to a new level. Now you can see my eyelashes with this mascara!"
      },
      "jenjeeeee":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"7 Oct 2016",
         "title":"not the greatest",
         "description":"This does a decent job of lengthening and thickening, but it flakes off by end of day and there are always black flecks under my eyes. Lots of other mascaras that give same look without the flaking. Had as sample and won't purchase."
      },
      "lovesmakeup0210":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"15 Feb 2015",
         "title":"Fail",
         "description":"It breaks my heart to give a low rating because I so love Too Faced. I am kind of a mascara junkie, I have short lashes so I am always looking for the new greatest thing......this was not it, I heard wonderful things about this mascara and I could not wait to try it. I find it to be clumpy and messy, and just did not look good at all. I got mine as a deluxe travel size with a palette, I am glad I did not spend the money for the full size. Dissapointing.\n…read more"
      },
      "FaithNoMore":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"12 Jan 2014",
         "title":"Sloppy look, product like paste, lacks precision",
         "description":"Before purchasing, I researched mascaras and narrowed it down to a few brands. While in the store, I asked the advice of the salesperson who overwhelming suggested I go with this one. Big mistake. Was excited to try it at home. As soon as I opened the cap, the product looked messy as it oozed out of the container. It was like a thick paste, gloopy, and sticky- not at all the amazing product I'd heard about. The brush was way too bulky, not good for precision. It coated my lashes making them stick together but did little to separate them. The product stung my eyes and made me cry, which created an even bigger mess. I tried to apply an additional coat,but it did nothing- no extra volume. The entire look was sloppy. Maybe if you have long, thick lashes to begin with this product works but if you have thin, wispy lashes, the product is WAY TOO THICK. You couldn't even see the individual lashes. And after removing it with 2 rounds of eye makeup remover, and a cleansing towelette, I still woke up with black gunk under my eyes. I get MUCH better results with brands I've purchased at the drugstore after 3 coats. I wish I had gone with my gut and bought one of the other mascaras I read about. This one is definitely getting returned.\n…read more"
      },
      "blueviolets":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"6 Jan 2014",
         "title":"Great mascara",
         "description":"First time trying it and really like it. I have long lashes but need more of the fullness and this mascara does it, But it also clumps a bit after 3rd coat. In overall it's a great mascara and I would buy it again."
      },
      "shockwave":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"17 Aug 2015",
         "title":"Clumps!",
         "description":"I needed a steel lash comb to undo the mess this made of my lashes. I tried it three time and every time I got a spider lashes."
      },
      "viajoy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Aug 2014",
         "title":"Fantastic Product!",
         "description":"I bought this mascara on a whim and was incredibly pleased with its results. It made my lashes very voluminous and long looking with even just one coat. Unlike other mascaras that claim to create the false lash effect, this mascara is not clumpy or stiff other similar mascaras always made my lashes stick together while this mascara really separates the lashes effectively. The formula is very wet and it dries on your lashes quite well but does not make them feel like they could break off at any minute. Also, unlike said mascaras this mascara was fairly easy to take off. In the past I have had trouble getting mascaras all the way off; especially those that are heavy and gluey and dry, this mascara, however, comes off with a makeup wipe and a few splashes of water. It is highly pigmented and provides a deep black color that makes even my dark brown eyes pop! Overall I was really pleased with this product, despite its high price point, its results are fantastic. I would recommend this mascara to anyone who is looking for a full, thick, long lash look.\n…read more"
      },
      "bjsl":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"7 Mar 2014",
         "title":"LOVE IT!",
         "description":"First off I have very short, blond and sparse lashes. I have been using Benefits They're Real since it came out and love that mascara. It did take me some getting use to the brush as its a little stiff and scratchy. Anyways...I had no plans on changing mascaras but something caught my eye about this one so I thought I give it a try. The brush is really large at the end but overall I liked it. This Too Faced BTS really lengthens your lashes, a lot more than They're Real, but I don't think it separates them as well. The Too Faced BTS really keeps the curl of my lashes though, better than any mascara I've tried. I used the Too Faced BTS by itself for over a week and really liked it but than I started using both Too Faced BTS and They're Real together and I get the most amazing results. I know to some people that might seem a little ridiculous to use two mascaras but not to me if I get the results I want. The first day I used both I received several compliments on my lashes. I also have no flaking at all. I really loved the Too Faced BTS by itself but combined with They're Real I get my desired result!\n…read more"
      },
      "purpleshadow12":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"27 Jan 2014",
         "title":"HORRIBLE!",
         "description":"Marketing at its finest, people. The name sounds great, right? Wrong. First of all, my natural lashes are very long so I always look for the best volumizing mascaras on the market because I do not need length. A beauty advisor recommended this to me so I gave it a shot. The product did not volumize, and it did not define my lashes. They were more of a soft black color so it was not an intense look at all. The worst part? It flaked within 2 hours and most of the product was on my under-eye area. My lashes were light as a feather but that's never the look (or feel) I am trying to achieve.\n…read more"
      },
      "Kvarl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"1 Mar 2015",
         "title":"I do not usually splurge on mascaras but this time I did and I was extremely disappointed. I found this mascara to be extremely clumpy and it left black flakes all over my face. I did not expect this as I paid 30$ for the tube. Waste of money! I will go back to my cheap stuff.",
         "description":""
      },
      "2006BUGABOO":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Jun 2013",
         "title":"The best!",
         "description":"Love this no smudge great curl and no clumping. Thick sexy beautiful lashes. My search for great mascara is over. Thanks too face:)"
      },
      "sdarmony":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Oct 2014",
         "title":"dramatic look!",
         "description":"People will always ask me if I'm wearing false lashes whenever I have better than sx mascara on. I already bought over 3 tubes it's completely worth it and long lasting !"
      },
      "IcedDoughnut":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Oct 2016",
         "title":"PERFECT!!",
         "description":"I have used the drug store \"Falsies\" mascara forever. I loved it, but the formula was flakey and it just didn't have enough product in the bottle. I bought my mom the waterproof Better than Sex mascara and she loved it. Finally, I gave this one a try with a 100 point sampler. Wow, 100 points well spent! I bought the full size on my next trip to Sephora. It is AMAZING. It's the closest thing to the voluminous look the Falsies mascara gave me with a way better formula. I have never curled my lashes, but I bet it'd look amazing with this mascara. I used a mascara primer (UD Subversion, highly recommend), but on the run I just put the mascara and it still stays put and pretty. My only recommendation is to buy this original formula (that comes in a pink tube) and NOT the waterproof one (comes in a green tube). The waterproof one has an odd formula that either randomly slips off or will refuse to remove itself for days.\n…read more"
      },
      "Millie0126":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Oct 2016",
         "title":"holy grail mascara",
         "description":"I decided to buy this mascara and it was a good decision! I thought it'd be clumpy like everyone says but it doesn't, it makes it so easy to get the volume I like, my holy grail"
      },
      "senior":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"17 Dec 2014",
         "title":"My lashes are long, but thin. Asked consultant for recommendation . She suggested this. It clumps, unless I rub brush first with Kleenex first to remove excess mascara. I would not recommend this.",
         "description":""
      },
      "ruddenca":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"15 Apr 2015",
         "title":"AMAZING, but...",
         "description":"Caused terrible panda eyes. I'm so sad b/c this mascara is so dramatically volumizing, yet feathery and natural looking. And can layer on with no clumps! Would seriously be my HG mascara if it weren't for the smudging underneath the eyes, something I never get from other mascaras."
      },
      "gigisd":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"14 Jul 2013",
         "title":"Artificial",
         "description":"I had very high expectations for this mascara. When I read the package, my pulse was pounding. Yes, it does lengthen and add lots of volume, but I had dark, crunchy \"spider eyes.\" I have used most every mascara ever manufactured, from drugstore to salon quality, and I found this surprisingly disappointing."
      },
      "sabeenie":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"8 Jul 2015",
         "title":"good stuff, but go with benefit",
         "description":"Pretty standard mascara, nice and richly saturated black, lengthens and builds volume like it says on the tin. I decided to exchange this one with benefits roller lash because of the brush. I find fluffy brushes trap too much product, allowing the mascara to dry out quicker and not pick up quite enough when you return it to the tube for a refill. Also difficult to comb out, which is an issue for me because I have big lashes that criss cross and tangle naturally. They've gone all out with the packaging though, which seems to have pleased most? Run of the mill overall, just built heavy to feel heavy duty-er.\n…read more"
      },
      "ocrissyy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"22 Dec 2016",
         "title":"flaky",
         "description":"Like others have said on here, it was great the first week and then it started flaking and clumping like crazy. Now, i apply it really slowly so i can avoid major clumping. But i'm never getting it again. Someone recommended it to me but it's not working out for me"
      },
      "nyss15":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Aug 2013",
         "title":"Best mascara",
         "description":"I have found my grail mascara, it's waterproof but doesn't smudge easy, doesn't irritate my sensitive eyes, and gives my amazing definition and volume!!!!!"
      },
      "myaj17":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"31 Aug 2016",
         "title":"eh",
         "description":"I got it this in the small size in an ipsy box and I was so excited because this product is very popular and I wanted to try it out for the longest time. When I did I was kind of disappointed. I naturally have long and dark eyelashes. When I put this on it made them soooo clumpy and they were so hard to separate and it didn't really curl them that much either. It kind of made them go straight out which is my biggest pet peeve with mascara. I feel like if the wand was different it would make this way better. The wand has too much product on it when you take it out of the tube and it just smudges everywhere on your eyes. It did lengthen them but it still looked bad. Not really a fan. Wouldn't buy the full sized product.\n…read more"
      },
      "EmmieDonna":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"23 Jan 2017",
         "title":"Its alright...",
         "description":"This mascara makes my lashes look very long and has lots of volume, but after a few hours of wearing it I start to get raccoon eyes. A little disappointed because this mascara is so hyped up"
      },
      "anbright":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"25 May 2014",
         "title":"Not Too Bad",
         "description":"It does it's job. I use this mascara when I want a really natural lash. It makes my eyelashes look \"fluffy\"...if that's a thing ;) I love the packaging, but I have a few complaints. Because the wand is huge, it's hard to get close to the lash-line and I also find it a very messy mascara. If you happen to get a few dots on your eyelid, it's very hard to get off and not mess up your eyeshadow. I wouldn't repurchase, but I can use it and get my money's worth.\n…read more"
      },
      "yunglolita":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"26 Aug 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Sex Kitten Lashes"
      },
      "anniemac1999":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"9 Sep 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"This mascara is really quite amazing. I like it so much that I bought it again after I ran out and I'm sure that when I run out of the one I have now. It definitely lengthens and adds a lot of volume to the eyelashes. I took a star off because sometimes it can be a bit flaky, and sometimes when first putting it on it can be a little clumpy, but with enough work with the spooly I can usually get it to unclump."
      },
      "Lexiloul":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"28 Aug 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Best I've ever used!"
      },
      "kortenie":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Apr 2017",
         "title":"clumping",
         "description":"i got this in in the Better together collection, was not a fan of this. clumpy and gross right away. if I didnt love the rest of the collection so much I would return it. never buying again."
      },
      "Dayah":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"9 Jan 2015",
         "title":"LOVE this mascara, when its wet. HATE this mascara when it starts drying. This mascara makes my eyelashes super long, thick, curled, and black! Looks like falsies! Downside is, when it starts drying my lashes don't extend as much. Also, lots of it falls on my under eye area.",
         "description":""
      },
      "sassysusan":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"13 Aug 2016",
         "title":"It's a great mascara and gives lots of volume but flakes",
         "description":""
      },
      "Arianne32":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"19 Dec 2016",
         "title":"ehhh",
         "description":"I tried this mascara because of the hype around it. It does nothing at all for my lashes and the formula is really watery."
      },
      "elena95":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"20 Sep 2015",
         "title":"Not that great.",
         "description":"After a few hours it crumbles , and the mascara dries really fast , i had 1 week with it, and it was like a 1-2 months old mascara, i had high hopes for this mascara and just like this mascara they crumbled down."
      },
      "santosateos":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"29 Dec 2015",
         "title":"WILL NEVER USE ANOTHER MASCARA &lt;3",
         "description":"I'll make the story as short as possible-- I used a drug store mascara for about a week. I never before had any problems with drug store mascara but for some reason, this specific one broke my lashes off!!! I had used Benefit's \"They're Real\" before and loved it then a friend recommended \"Better Than Sex\" and it RESTORED MY LASHES! I have naturally long lashes, though they're not too full. This mascara restored the length I had before. I'm forever thankful. It's pricey, but a good investment, you will not regret giving this a try.\n…read more"
      },
      "Lauren0813":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Jun 2015",
         "title":"pretty amazing!",
         "description":"This mascara is super volumizing and makes lashes look very full. I am giving 4 stars bc it does not lengthen very well, but that is really the only con for me."
      },
      "ydelgado":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"16 Dec 2014",
         "title":"This mascara is NOT better than $ex,disappointed with this mascara i don't see whats all the hype i prefer benefit's they're real its amazing",
         "description":""
      },
      "mak3uplov3r8":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Jul 2014",
         "title":"One of my favorite!!!",
         "description":"The name is insteresting....when I first tried it I fell in love!"
      },
      "Nonvenomous":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Nov 2013",
         "title":"Best Mascara that I've ever used!",
         "description":"I was absolutely blown away by this mascara. It does not clump at all and makes your lashes look effortlessly and naturally longer and fuller. One coat looks amazing and I wouldn't use more but if you do it looks like you've got falsies on. Love love love it! Will never use another mascara as long as this one is around."
      },
      "momCoral":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"25 Aug 2013",
         "title":"it's nice...",
         "description":"not better than well, what it claims! Stupid name anyways, but thats what made me buy it! LOL I can't even type that word into the description!! But nice brush, heavy duty formula, stays in place nice, super hard to remove, but great looking full, long, thick spider lashes! But mine broke after 3 uses, the piece that wipes most of the mascara off the brush is always stuck up in the top, or brush.. I can't get it down, even trying it makes my fingers all black...messy. Yuck I just put it a side with the others and moved on to Tarte's newest ..which is super fantastic. I should have returned it...anyone else have that problem?\n…read more"
      },
      "cg2345":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Mar 2016",
         "title":"best mascara ever",
         "description":"If you find this mascar clumpy or hard to work with its most likes the way you are applying it. This mascar gives the best length and shape of my eyelashes, a tip if you find it clumpy is to focus it on the ends of your lashes meaning the tips of all ur lashes and toying a thinner small mascar starting from the root of your lashes"
      },
      "ames1228":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"6 Jan 2015",
         "title":"The girl at the store told me this was the best mascara out there so I tried it. It works great, really makes your lashes look long however I asked her if it was water proof and she said water resistant and she has never had a problem. I took her word for it. The first day of use by the afternoon I had black underneath my eyes from the mascara from just wearing it to work and not encountering any water. I am used to true waterproof mascaras which don't leave any residue on your eyes but other than that it was great, just not for me.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "megsny":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"27 Sep 2014",
         "title":"one coat wonder",
         "description":"This mascara has replaced my former go-to. One coat does the trick. It goes on very smoothly - my lashes look and feel silky. I rarely feel the need to put a second coat on, but when I have, it goes on easily and creates a very dramatic effect. I do not have to use a metal lash comb, whereas with other mascaras I almost always use one. The sole 'downside' is that the end of the brush sometimes has to be blotted before applying, as it often has excess product, but this isn't a big enough factor for me to take away a star. I have bought this for all the females in my family - SO happy I found this product! I feel like a brunette bombshell.\n…read more"
      },
      "xoxo1991":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"8 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"After two Hrs. it looked like i had a black eye NO OTHER mascara has done this to me!!! ZERO STARS!"
      },
      "dcgirl511":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"4 Feb 2015",
         "title":"Just OK",
         "description":"This mascara is ok, but I've had many other mascaras of all price ranges that were better. It looks good when you first put it on, but for me it flaked a lot and got in my eyes. It also smudged throughout the day and gave me raccoon eyes. I prefer Benefit or Blinc mascara honestly. Not worth the eye irritation."
      },
      "anaisalv":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Apr 2016",
         "title":"Best mascara i've ever used (and this comes from someone ADDICTED to mascara, i've tried LOTS!)",
         "description":""
      },
      "sarasaeidi":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Dec 2016",
         "title":"best",
         "description":"This is the best mascara I've ever had. Im a mascara lover and i'm so picky and i was always put too many coats on to have a super long lashes. After trying many brands I came across to this one And I fell in love with it! Now, I just put one or two coats and I have long lashes...."
      },
      "vans1321":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"6 Jun 2015",
         "title":"no thank you!",
         "description":"This mascara clumps your lashes like no other mascara! I loved it at first, but 2 weeks later something horrible must've happened because it's extremely tacky and clumpy! No good."
      },
      "BleedingRed":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"28 Apr 2017",
         "title":"Flakey",
         "description":"I was very excited to get this item for my birthday. I had heard great things! First putting it on, it did as promised. It does give you a lot of volume and length. But, upon wearing it throughout the day, it becomes very flakey. So now I only use it if I'm going out for a few hours."
      },
      "GlassHips":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"7 Mar 2016",
         "title":"flaky",
         "description":"I've used this for about a week and every time it has flaked after only 4 hours of use. I really wanted to like this but unfortunately I do not like the fact it flakes.. Gave it 3 stars for good volume and lengthening but long-term wear and quality wise, it doesn't impress me."
      },
      "Lor96":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Jan 2016",
         "title":"A make up must-have!",
         "description":"For awhile I held off on buying this mascara to see if the hype would go down. You know the drill, a new make up product comes out and all your friends go crazy over it for a month or so and then they find a better product and stop using it. Better than Sex mascara has been out for quite some time now and still so many people love it- so a couple weeks ago I decided to splurge and buy it myself. There were many reviews on here that claimed it was incredibly clumpy so I expected the formula to be goopy and hard to separate my lashes. However that was not the case at all! When applied, I started with bare lashes, typically I use a lash primer but for this I decided to try it without that first. What I first noticed was how very black the mascara went on. I applied a couple coats, as I don't go for the \"natural lash\" look. I didn't find it to be difficult to apply or clumpy at all while applying it, the formula is creamy but visibly thickens your lashes. It really grabbed each of my lashes and lengthened them. When applied with a lash primer it lengthened my lashes even more. Very happy with this product overall. Will be buying again!\n…read more"
      },
      "maisyisadaisy":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Nov 2016",
         "title":"So much length!",
         "description":"I love this mascara! With naturally full & thick lashes, I bought it looking for added length & it did not disappoint! Effortlessly made my lashes more full, dark & extremely noticeably longer! I have been using this product ever since!!!"
      },
      "MegAbdalla":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"16 Feb 2016",
         "title":"Not Better than Sex",
         "description":"This mascara applies very easily and makes your lashes look great without much effort. HOWEVER, every time I have worn this mascara I have been left with flakes running down my face after a few hours of wear. It does not hold well during the day, therefore I will not be buying again."
      },
      "livelaughlove58":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"29 Oct 2015",
         "title":"wasnt impressed!",
         "description":"Let me just say I bought this prouduct because of all the hype and amazing things I hear! I was impressed initially when putting on the mascara as t made my lashes long and had lots of volume. But I noticed every time I wore it not too long after it would melt off and be under my eyelids. I ended up returning it because it looked awful thought the day everytime I wore it :("
      },
      "laurab86":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Oct 2014",
         "title":"5 stars!",
         "description":"I finally purchased the full size mascara for this because I was using the smaller ones that came in a set. I have tried so many mascaras and believe that this is the best high end one! You literally only need one swipe and your lashes are transformed! It is worth the price!"
      },
      "agacosta":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"1 Jun 2015",
         "title":"dries quickly",
         "description":"I wish I was able to enjoy this product more but unfortunately it dried out before I could. Also I didn't see any amazing affects that you couldn't get from a drug store mascara."
      },
      "btm1998":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Jan 2017",
         "title":"The best out there",
         "description":"Makes my unimpressive eyelashes look amazing. Cannot recommend this enough"
      },
      "AliciaKeochai":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"14 Apr 2017",
         "title":"UHHHMAZING",
         "description":"Okay, so I never bother with mascara bc I have the straightest Asian eyelashes. I usually just put false lashes over my short straight ones and call it a day bc The curl NEVER stays no matter what mascara I used. I got this as a free sample and OMG IVE BEEN MISSING OUT ALL THESE YEARS!!!!! You bet I got a full size one now. Not only did my curl stay for the ENTIRE day, but my lashes looked longer and fuller!!! (That's a miracle in my case) I 10000% Recommend this mascara. The only con I would say for me personally is that it did transfer a bit under my eyes but that only has to do with my skin being extremely oily. I'll take that over short straight lashes any day!!\n…read more"
      },
      "Eac33":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"3 Jun 2015",
         "title":"disappointing",
         "description":"I was expecting a lot from this product. I enjoy too faced and this mascara did not live up to their brand. It is a nice color, the volume was decent but after a few hours of wear....under eye smudge. I do not rub my eyes and barely touch my face so this was simply from blinking."
      },
      "greatergatsby":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"3 Jul 2015",
         "title":"Not Worth the Trouble",
         "description":"When I first put this mascara on, it seemed fantastic. It lengthened and thickened my eyelashes, and I thought I had found the perfect mascara. However, during the day it started to smudge, the black pigment actually getting in the creases beneath my eye. I returned it the next day."
      },
      "mberteig":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"9 Oct 2013",
         "title":"The good and the bad...",
         "description":"Overall, I was pleasantly surprised by this mascara. I have not liked any of the other Too Faced mascaras, so this is a first for me! The brush is large and clunky, Works surprisingly well on top lashes, doesn't work at all on bottom lashes, it is way too easy to get mascara everywhere except on the bottom lashes! The brush separates the upper lashes well, with less clumping than other mascaras I have used, another pleasant surprise. I am used to layering mascaras to get the effect I want. This one works all by itself and provides length, volume and curl. Again, I was pleasantly surprised by this, as my lashes never hold a curl, and they are definitely holding one with this product. Another first! I applied 3-4 coats. So far there doesn't appear to be any smearing or fall-out. I agree with other reviewers that too much product comes out on the brush, this is wasteful and the tube should be redesigned so more product is wiped off the brush as you withdraw the brush from the tube. Overall, pretty good!\n…read more"
      },
      "Marilyneyvonne":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"15 Mar 2014",
         "title":"It flakes",
         "description":"At the end of the day I had major flaking. It is really too bad because this mascara did a good job as far as volume and lengthening."
      },
      "lipstickjunkee":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"7 Mar 2016",
         "title":"Definitely NOT better than sex...",
         "description":"My eyelashes are thick and this mascara did nothing but create a mess for me. It doesn't separate or add length. I don't like it at all."
      },
      "ND11":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"16 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Am I missing something?"
      },
      "beautybelle19":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"19 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"My favorite mascara!"
      },
      "floggingmelly":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 Feb 2015",
         "title":"Slightly disappointed",
         "description":"This mascara will lengthen and curl your lashes - but it is also quite clumpy and ends up flaking down my face midway through the day. I wanted to love it."
      },
      "din12":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"8 Aug 2016",
         "title":"I used the whole tube but",
         "description":"Honestly , it does do a bit of length & some volume but IT FLAKES SO MUCH under the eyes no matter what . Even if you wear it a short period of time .. Don't waste your 20$ on this ... Look @ others"
      },
      "sare16":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 Jan 2017",
         "title":"hit and miss",
         "description":"Love the way the brush loads on the product and gives a very defined look, and the packaging is solid which makes it feel high quality, however, this mascara flakes the entire time I'm wearing it and I've always had it smudge no matter whether I've just applied t or have been wearing it for hours and accidentally touch it."
      },
      "ShortyLuv":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"27 Mar 2016",
         "title":"Too clumpy",
         "description":"I had to try this mascara because of the wonderful reviews I read. I returned it the next day. It was too too clumpy. My lashes looked like one big glop mess."
      },
      "RaeLee6":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"23 Feb 2015",
         "title":"THE BEST MASCARA EVA!",
         "description":"I absolutely love this mascara!!! it does have its flaws though, but overrall a very good product. cons- cant keep in makeup bag will cause you to use too much product... too much of it weighs down your lashes... its very thick, and gets the job done. many people have been commenting on my eyes more and more now that i use it. a little on the expensive side for just mascara but OMG amazing!"
      },
      "AndreaVR":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Jul 2015",
         "title":"MASSIVE LASHES",
         "description":"Best mascara ever, if you need volume and length this is what you need. Also is easy to built up, 1 coat is enough for a natural full length, 2 coats is a more impressive long lashes and 3 coats is a dramatic look. For some people it may fell a little bit heavy (but really.. Its nothing crazy) love it! Must have! Plus the package is cute."
      },
      "cheriwashere":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Jul 2014",
         "title":"GLAMEROUS MASCARA",
         "description":"I can say this is my holy grail! I can never be without it! this is the first mascara that has ever made me feel glamorous and pretty and if you don't like it you aren't applying it right! There is no comparison. I tried They're Real & Perversion. Does not compare!"
      },
      "momof3dearones":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Feb 2015",
         "title":"Works wonderfully",
         "description":"I received a sample of the Too Faces Better Than Se* (the system wouldn't let me use the \"x\" - said they detected \"profanity\" LOL!) mascara and that's all it took! Went straight to the computer and ordered a full-size tube for me, and also one for my teenage daughter, as soon as we used it for the first time. We both absolutely LOVE it!"
      },
      "emmaroberts":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Apr 2017",
         "title":"I love this mascara!",
         "description":"I got this mascara about a month ago and I absolutely love it. My eyelashes are more on the short side and they look extremely long when I use this mascara. It also separates my eyelashes really well. It has been hard for me to find a mascara that separates my eyelashes because they are very thick but this one does it."
      },
      "NataliaMatusz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"7 Apr 2015",
         "title":"This is great",
         "description":"I have about no eye lashes to begin with, but this mascara actually made it look like I have them! It goes on in sufficient amounts and really volumizes. I do not have to put on a billion coats to get the look I want. It's quick and easy and really is what the name states."
      },
      "katrinae13":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"18 Jan 2015",
         "title":"i was really hopeful about this mascara because of all the great reviews, but should've read more of the negative reviews... This mascara is very clumpy and flakes off during the course of the day, though it does hold the curl very well until it starts to flake off. I will be returning this very soon.",
         "description":""
      },
      "Cynchaa":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"15 Nov 2016",
         "title":"Disclaimer: I used this as a sample size. Not sure if the fill size product is any different. The sample size gave me clumps. It did make my eyelashes thicker and longer but often became spider-legs looking which I am not down for.",
         "description":""
      },
      "jessicaann8389":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"14 Feb 2014",
         "title":"Disappointed",
         "description":"I usually love Too Faced… however their mascaras seriously disappoint me. Their packaging is super cheap. That goes for a compact I got from them too. This really wasn't as amazing as I was expecting it to be…or everyone else has been saying. It was okay but gave me serious clumpy gross lashes. The tube dried out in a week and the brush broke out of the pink part if that makes sense. So disappointed. This has not been the only mascara from them I've had this problem with.\n…read more"
      },
      "ChelseaLynnnn":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Jan 2016",
         "title":"SO HAPPY",
         "description":"I am in absolute love with this mascara. I've been looking for something that would give me that full, long baby doll lash look and this is it!!! So happy :)"
      },
      "Dmmmakeup":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Apr 2017",
         "title":"always dried out",
         "description":"I honestly dislike this mascara, every time I get a sample it's all dried out and the brush crests clumps. Always flakey:("
      },
      "bitchie":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"10 Jul 2015",
         "title":"YASSSSSSSSSS!!!!",
         "description":"This mascara is EVERYTHING!!! It makes my lashes POP and POW! I'm on love with this product. Also, if you have it on all day it stays nicely and actually lets you reapply in case you are going out after work and need a freshening up. YASSSSSS!! Thank you Too Faced! You are my hero!"
      },
      "Ains09":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Mar 2017",
         "title":"The last mascara you'll buy",
         "description":"This is hands down the greatest mascara known to mankind! For a girl that has next to no lashes, this mascara makes me look like I was blessed in the lash category."
      },
      "MellieJlady97":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Nov 2015",
         "title":"LOVE!",
         "description":"Great mascara! My lashes look amazing and it doesn't flake."
      },
      "brutumfulmen":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"13 Dec 2016",
         "title":"Great product, not so great applicator",
         "description":"This product is great for individuals with long and dense eyelashes. I sometimes have trouble getting my mascara to separate my eyelashes, and this worked really well! I only had some clumping around the outer corner of my eye (understandable, seeing as my eyelashes are super dense in that area). The only downside to this product is the applicator. It's a bit awkward to use and makes getting into the inner corner of the eye difficult.\n…read more"
      },
      "roseposey":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"9 Mar 2017",
         "title":"I don't understand the hype for this at all.",
         "description":"I bought this because it was recommended to me. Very voluminzing, very lengthening but the smudging that I got under my eyes throughout the day was SO BAD. I tried layering this with the Clinique Long-Wearing mascara which was my go to before but it didn't help. Maybe I have more oil around my eyes than average? Idk, this mascara really didn't work for me though."
      },
      "Erica39":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Nov 2015",
         "title":"Found my new mascara",
         "description":"I have been trying new mascaras for months now (ever since learning wearing waterproof mascara on a daily basis is a bad idea) and I think this is the one. Smears and flakes are minimal for a non-waterproof formula and I have already received two unsolicited compliments from people who didn't know I had recently switched mascaras."
      },
      "M3talMuffin":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"21 Oct 2016",
         "title":"Not even better than brussels sprouts",
         "description":"After reading lots of reviews, I decided to buy this mascara and give it a try. I regretted it as soon as I put it on. It was dry, and didn't lengthen my lashes or give them volume. All it did was clump my short little lashes together. Sorry Too Faced, but you need to rename your mascara. Will not be buying again."
      },
      "SarahAnnePDX":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"26 Nov 2014",
         "title":"Really IS the best!",
         "description":"You know how they always have makeup artists saying how they use that cheap pink mascara? I don't buy it. Maybe if you've alre got fake eyelashes on... So, I bought a collection of 5 different mini mascaras that included a coupon for a full sized one that you liked best. This was it, hands down. Full and thick without being clumpy. I've never had a problem with it flaking off. I am a minimalist and often only wear mascara, so it's really important in my book. This one had just a little more than the other four options. I think you'll like it too.\n…read more"
      },
      "corijennie":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"2 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1533439+sw-62.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"SO UPSET"
      },
      "rachelvl":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"28 Mar 2017",
         "title":"just your average mascara",
         "description":"Let's be real, this product comes in such a cute package and has a stand-out name. I wanted to love this product, but it didn't live up to the hype. I'm a mascara junkie and I love my lashes to look flawless. This product is very comparable to drugstore mascara brands and I believe you can achieve the same look for much cheaper. With that being said, it does lengthen your lashes and do a good job of not clumping, but it will flake off during the day, which is sad.\n…read more"
      },
      "AnaGabyArre":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Apr 2016",
         "title":"Best Mascara Ever i just love it, wanna try waterproof version !!",
         "description":""
      },
      "lizziroxx":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Mar 2014",
         "title":"SUPER",
         "description":"LOVE this mascara! pricey but over all good mascara....."
      },
      "arniea04":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"6 Jun 2017",
         "title":"Voluminous but clumpy",
         "description":"I really like the results this gives me, but I have to make sure I heat it up before I use it by rolling the tube in my hands- otherwise it clumps a lot. Took me a few uses to get used too, but definitely gives great volume and length!"
      },
      "Francinator":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"30 Jul 2015",
         "title":"It's ok",
         "description":"Pro: Most voluminous mascara I've ever used and looks great with bold smoky eye Con: It started to flake onto my face within 4 hours! I thought that maybe I had received a bad tube since I've heard so much buzz about this mascara. So I purchased another. Same thing happened. Will not be repurchasing. I'll only use it if I receive a sample."
      },
      "kimjmtz":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"11 May 2015",
         "title":"Messy and Clumpy",
         "description":"This mascara did nothing for me. It was very messy and clumpy, I have to comb my eyelashes out after application. When the mascera dries it is very flaky and falls off."
      },
      "sandylove2":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"28 Aug 2013",
         "title":"Lots of length and fullness",
         "description":"Very volumizing. Made my lashes long and full. Does not clump on my lashes."
      },
      "Jackiee987":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"21 Mar 2016",
         "title":"It's alright",
         "description":"I like the way this mascara makes my lashes look but....it flakes so bad!"
      },
      "ananunez09":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"28 Sep 2015",
         "title":"This mascara is horrible! I get at least 20 minutes of wear time before I have panda eyes! Also, it gets really clumpy after the second coat.",
         "description":""
      },
      "Baroquep":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"19 Nov 2014",
         "title":"Better than s*x ? I don't think so ...",
         "description":"didn't like this mascara. Made my lashes clumpy and lumpy. The only think I did like was it is the blackest black mascara that I've ever used. Hated the brush, far too large and difficult to use. Would never buy this mascara again."
      },
      "merrill1999":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Jan 2017",
         "title":"OUTSTANDING",
         "description":"Great mascara couldn't be more pleased!! Truly is better than sex(I mean maybe)"
      },
      "Noelle436":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"22 Sep 2013",
         "title":"Just Okay",
         "description":"Mascara was good the first few times I used it. But I do think too much comes out on the wand making it impossible to get non-clumpy lashes. Does start flaking by end of day leaving the under eye \"shadow\". Try another mascara, it's definitely not \"better than s*x\"."
      },
      "savaynaynay":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"12 Mar 2016",
         "title":"Great volumizing mascara",
         "description":"Works great at volumizing, tends to be clumpy until you learn how to use it."
      },
      "starrfire":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Jun 2015",
         "title":"in loveee",
         "description":"This mascara is my holy grail I have already went through one and purchased another.... This mascara volumizes, lengthens, and separates and blackens them... It's just that great and works amazingly"
      },
      "sammie88":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Apr 2014",
         "title":"Awesome!",
         "description":"Love it! Even got asked if I had fake lashes on! Makes lashes thick and mine didn't clump"
      },
      "sourdough":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"5 Apr 2014",
         "title":"A good argument for celibacy",
         "description":"I hate the name of this mascara, and I wouldn't have bought it except in the collection of mascaras Sephora was selling around Christmas time. The product went on in a rather clumpy manner, thanks to the weirdly shaped brush, and the product rubbed off easily with little provocation. Buy a mascara with a dignified name. It's got to be better than this one."
      },
      "Megan2193":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"21 Apr 2016",
         "title":"Kind of a let down",
         "description":"I was so excited for this product. I actually really love how big the wand is and the first few hours the mascara is amazing! Later in the day it gets really flaky and you have black speckles everywhere. :( so sad"
      },
      "Ceece55":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"7 Jul 2015",
         "title":"horrible",
         "description":"honestly terrible. flakes and smudges everywhere. my eyelashes have never looked so clumpy and ugly."
      },
      "lindalouhoo":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"6 Oct 2014",
         "title":"Need a new makeup bag",
         "description":"This mascara works great until something within the applicator happens and you end up with huge globs of black mascara everywhere. After this happens, you can clean the wand and applicator off but once you stick it back in, you are right back to square one. So, you have no choice to throw it away. This has happened to me with two tubes."
      },
      "princessvmb94":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Jun 2015",
         "title":"amazing",
         "description":"I use this as my last mascara after my fiber lash and this mascara is just amazing! I normally have to put 3-4 layers of mascara on and with this one I don't, just one layer! And it stays on all day!"
      },
      "WendyM7":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"16 Nov 2015",
         "title":"I just don't understand the hype. It was very clumpy.",
         "description":""
      },
      "Jeannaxmarie":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"24 Jan 2016",
         "title":"I am IN LOVE! This mascara makes my lashes long, voluminous, and makes my eyes pop! Best mascara I have EVER used. Only reason I put 4 stars is because after a while it does start to flake off. But its an easy fix. Overall, my favorite mascara and I will defiantly be repurchasing.",
         "description":""
      },
      "emilyosborne6":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 Jan 2017",
         "title":"the best",
         "description":"seriously, buy this. ever since I started wearing makeup i've been trying to achieve Shelley-Duvall-meets-Tammy-Faye-Baker, almost-looks-like-falsies eyelashes from one product with only a couple coats on my blonde, short eyelashes. I've used Bad Gal, Diorshow, and countless others over the years but nothing compares to this product. The versatility is great- one coat gives you a natural look, two or three really bring it home. It doesnt clump or look spidery at all! the only negative is that it does shed a bit and I get a little residue under my bottom lashes by the end of the day, but I just keep this in mind when doing my makeup in the morning and keep my lower line super light so it doesnt look bad by the time I get home. If I were to pick one product from Sephora I couldnt live without, this would be it.\n…read more"
      },
      "Ritaah":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"14 Mar 2015",
         "title":"i dont have the flaky problem",
         "description":"Before I bought this I read a lot of reviews on how the product flakes through out the day so I was a little skeptical but wanted to try it. I haven't had any flaking, I do find it clumpy on the wand and I seriously only dip it one time and get the product on both eyes so I guess that's a plus since I don't have to keep dipping the wand back in to get more product. I like it, my eyelashes are so long when I do use it and I'm satisfied.\n…read more"
      },
      "EmilyRebeccaRN":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"6 Feb 2016",
         "title":"Smudge Town Express",
         "description":"If you're looking for a luxury brand mascara that smudges in literally minutes, this is the one for you."
      },
      "KOXO":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"11 Aug 2015",
         "title":"Best mascara I have ever used",
         "description":"I was forever loyal to Max Factor 2000 calorie mascara --the best mascara around and the only remaining drugstore makeup product for me. Since it was discontinued many years ago I have tried them all and more than once - all the heavy hitters that people recommend - Diorshow, YSL, Lancome Hypnose Drama (my 2nd choice) and Benefit They're Real (dreadful). I don't have long eyelashes and two coats of this looks like I have lash extensions. I see the negative reviews about how the brush gets gooey and clumpy and honestly, take a q-tip or tissue and wipe it off. Not a big deal. Better than the more expensive Diorshow that dries out in a minute. I am on my 4th tube of this. Safe to say this is my mascara now.\n…read more"
      },
      "melly09":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Apr 2014",
         "title":"Love it!",
         "description":"I went to a sephora store and was recommended this mascara by one of the employees there. It's amazing mascara! Love how dark it looks and makes your eyelashes look amazing. Would defiantly reccomend this to people."
      },
      "jasminebryant":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"9 Apr 2016",
         "title":"zero stars.",
         "description":"this mascara is so over hyped! I bought it because of the ad too faced did with Gigi Gorgeous, products she endorses and raves about so much have always worked well for me. but this mascara is something completely different. the formula is horrible and gooey. too much gets on the brush at once, meaning if you want to be able to use it, you have to wipe off the excess and wast so much of this overpriced mascara. but it still seems like after being wiped off, my lashes were immediately swamped with this goo! it dries so slow, I think I waited 8 minutes? and it isn't buildable at all. it gave my lashes no volume with one coat, but with two they were completely clumped together. and the best part? after fifteen minutes, there are flakes on EVERYTHING. this mascara is horrible.\n…read more"
      },
      "madixshay":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Jul 2014",
         "title":"So glad I didn't buy the full size",
         "description":"I received this product as a 100 point gift with my Sephora points. I'm really not impressed. Granted I don't have long lashes, but this does nothing for them."
      }
   }
}