{ 
   "product_name":"Better Than Sex Waterproof Mascara",
   "product_type":"Mascara",
   "brand":"Too Faced",
   "url":"https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908",
   "reviews":{ 
      "sydney1227":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"1 Sep 2016",
         "title":"super excited then super disappointed",
         "description":"I absolutely love the regular Better Than Sex so I was super excited when the waterproof version came out because of my watery eyes. I'm super disappointed due to the fact the waterproof mascara is very clumpy and don't have the same natural but volumous look that the normal mascara has. Extremely unhappy customer here."
      },
      "KisV":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"8 Apr 2016",
         "title":"Works Only If...",
         "description":"You let it dry! Worked the first time I applied without any trouble, no smudging, I cried twice on that day, even sprayed setting must in the morning and never budged! I was amazed and didn't understand all the bad reviews. Second day applying I realized I looked like a panda when I was out running errands! It was a MESS!! Understood what bad reviews were all about. So I was on the fence and about to return but figured I was doing something different both times to result in working one day and not the next. I came to realize it takes a decent amount of time to let it dry completely!! So Third day: I tried letting it dry for about 25 mins and tested it out with my finger, applied generous face mist: no smudgy mess!!! I think I made it work for me!! Hope this helps with those on the fence like me. Not sure if I'd recommend as you have to be very careful and let the darn thing dry out like crazy. Volume isn't as good as original but I'm keeping mine as I really love decent waterproof mascaras. (Lots of room to improve formula!) I can live with these two downfalls for now (hence 3 stars.)\n…read more"
      },
      "jenlynn":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"7 May 2016",
         "title":"So disappointed",
         "description":"I'm always on the look out for the PERFECT waterproof mascara. I was actually really excited to try this one when I heard it was being released. However, it was one of the biggest disappointments I've ever had in a cosmetic product. I will first mention that I have very long lashes and extremely oily skin. Because of this, many mascaras transfer both to my eyelids (where my lashes touch, just under my eyebrow), and under my eyes. It makes looking for the perfect mascara an exercise in futility. The cons: CLUMPY. I even tried to scrape the excess off when pulling the wand out and still had terrible clumps. They should have made the container with a narrower opening to help take off the excess goop. TRANSFERS EASILY ON OILY SKIN. It must be very oil-soluble, because after just a couple hours, I had tons of blacks spots and smears on my eyelids (just underneath my brows, like I mentioned above) and all under my eyes. I returned this mascara.\n…read more"
      },
      "cindyrs":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"20 Apr 2016",
         "title":"I've been waiting for too faced to come out with a waterproof version of this mascara because mascaras that aren't waterproof do not hold my curl and I've heard great things about the original version... But this was a big disappointment. I don't like the formula one bit. The mascara makes my lashes clump together and it takes forever to dry. Regret spending my money on this so I will return asap!!<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "nouchyangg":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"27 Dec 2016",
         "title":"clumpy and messy!",
         "description":"Bought it a few months ago cause everyone is in love with this mascara, but all my lashes turn into a big clump. Very messy. Great volume, but very clumpy take extra long to separate lashes and clean everything up. Honestly will never ever buy again. It's just sitting on my desk. Only used four time and each time I do use it I want to love it, but I just don't. The wand picks up way too much product. It's just too messy for me and get all over my eyelids.\n…read more"
      },
      "Dae1413":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"24 Apr 2016",
         "title":"disappointed",
         "description":"I was so excited to try this out! But the formula is horrible it clumped my eyelashes together when I applied to my lower lashes when I blinked it would go everywhere & it never fully dries. I absolutely love the OG formula & im in love with the packaging but this did not live up to better than sex. Don't waste your time buying."
      },
      "eggroll1968":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Jul 2016",
         "title":"globby mess",
         "description":"This mascara is one of the worst I've used and I can't believe I paid $23 for a tube of it. In addition to being a globby mess, it runs down into my concealer and creates a dark shadow under my eyes. If I could give this no stars, I would."
      },
      "tessuhmunster":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"8 Apr 2016",
         "title":"Disappointing",
         "description":"Well, I waited since 2012/13 for a waterproof version of my favorite mascara, and I am super disappointed. I put it on this afternoon at the end of my makeup routine. And about 5-7 minutes later, I had looked in a mirror and had a smudge on my eyelid, and my lashes were clumped together. So I tried to separate them and noticed the mascara was still wet.....and all day my lashes feel weird. Sad. I will be sticking to the regular formula.\n…read more"
      },
      "hairbyanna":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"16 Jan 2017",
         "title":"buy the non waterproof version",
         "description":"I love the better than sex mascara and the cute packaging led me to trying the waterproof version. I absolutely hate it, its so clumpy and it seems like it never fully comes off all the make up remover in the world and theres still black smudges under your eyes the next morning."
      },
      "CarolynMo":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Oct 2016",
         "title":"NOT super waterproof...",
         "description":"BUT It gives fantastic length and makes my lashes gorgeous without falsies! It is not on the same level of waterproofness as all the drugstore ones I've tried but I have very watery eyes and it's never transferred to my skin. Does not come off easy with makeup wipe (no waterproof does) but comes over super easy with Clinique Take the Day Off balm!"
      },
      "DTStrat":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"21 Apr 2016",
         "title":"I'd give it zero stars if I could...",
         "description":"First, I'll preface my review by saying that I have never used the original Better Than Sex mascara. I only use waterproof formulas, so I had never tried it. I've always heard great things, though, so I was thrilled when I saw that they had started offering it in this waterproof formula, but was a little skeptical that it would be as good as everyone said the original was. Well, I was right to be skeptical. Upon opening the mascara, the bristles on the brush looked smushed and deformed to the point where you couldn't even recognize its \"hourglass\" shape. The mascara itself was caked onto the brush in a clumpy way. I could tell that it wasn't going to apply nicely, but I had spent the money and waited for it to be shipped to me, so I was going to try it out anyways. As I predicted, it did not apply well at all. It immediately started clumping with itself and making my lashes clump together, and it looked terrible. I tried to get it to apply nicer, but nothing I did worked. I ended up taking it off and using one of my other mascaras, because it looked so bad, and I shipped it back for a return. I'm really disappointed that such a great brand, with a great original mascara formula, couldn't deliver on a waterproof formula. Hopefully they'll be able to work out the issues and improve this waterproof version.\n…read more"
      },
      "MarikaScala":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2016",
         "title":"wish if I could give 0 stars",
         "description":"Worst mascara EVER! Does not dry, gets everywhere around the eyes if u blink."
      },
      "EricaBrennan":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"22 Nov 2016",
         "title":"clump city",
         "description":"I love the original but this one goes on extra clumpy no matter what I try. It also had a hard time drying on hot summer days. I wanted to love this but it was a waste of money and time!"
      },
      "katiekenj":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"28 Apr 2017",
         "title":"Not worth it at all",
         "description":"I swear by the original better than sex, I use it everyday and it's my favorite by far, but the waterproof version was such a waste of money. It is SUPER clumpy, even when applied very carefully and lightly and made my eyelashes look disgusting. It didn't give me the length the original does at all either. I'd rather use $3 drug store mascara than this. I gave it 2 stars only because it really is waterproof, in the shower and in the pool it has stayed put, but be careful because even with 2 different makeup removers I've tried it's nearly impossible to get off, especially from your skin if you smear it trying to remove it.\n…read more"
      },
      "imalwaysbroke":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"17 Dec 2016",
         "title":"Hate it",
         "description":"I was so excited to buy this because I've heard many good things but instead of adding volume and making your lashes look longer, it clumps very bad. Also when I wore it, I had a reaction causing my lashing/eye to get very ichy :("
      },
      "6427986422":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"20 Jul 2016",
         "title":"NOT waterproof and super smudgy",
         "description":"I was recommended to buy this mascara by a Sephora sales associate as she said the non-waterproof one was super popular. I prefer waterproof mascara so I tried this one and it is super clumpy, smudges easily and not exactly waterproof. I wouldn't buy it again"
      },
      "mak3up611":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"23 Mar 2017",
         "title":"Clumpy",
         "description":"I bought this because the original was sold out and although I love waterproof makeup this mascara is very clumpy on the brush and I have to keep wiping and wasting most of it when applying which is a waste."
      },
      "mslovecats":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 May 2017",
         "title":"Pulled my eyelashes out",
         "description":"This mascara is waterproof, but it also pulled my eyelashes out whenever I tried to remove my makeup. I used Lancome's eye makeup remover and usually don't have problems with other mascaras. It also was very clumpy when applied."
      },
      "sclark123":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"24 Jul 2017",
         "title":"not too sure",
         "description":"I can't lie, I loved the first original Better Than Sex mascara. I decided to try the waterproof version, thinking it would be an upgrade. This mascara has to be the clumpiest mascara I have ever purchased. To be completely fair, after 15 minutes of fixing and perfecting the clumps out of my lashes with my fingers, my eyelashes look great and long. Another downside is that it leaves black smudges on the lids of my eyes right below my eyebrows. I have very long eyelashes naturally, and this mascara could rub below my brows all day. There have been times when I would come home and my eyeshadow would be rubbed off with the result of me constantly rubbing off the black mascara smudges. If you have lots of time on your hands, purchase this item. However, if you find yourself in a rush like I do when I get ready, I would save myself some money and just buy the original Better Than Sex mascara.\n…read more"
      },
      "caitthecrusader":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"8 May 2016",
         "title":"I bought this thinking it would be a great alternative to the original product, as it is usually my holy grail, save for the fallout I sometimes receive. I was sadly disappointed, however. This product is the clumpiest, goopiest, most challenging to use mascara I've ever had. I tried cleaning the wand to see if it was just too much product, but no success. I will be returning it.",
         "description":""
      },
      "Natalie1912":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"7 Apr 2016",
         "title":"Not so amazing",
         "description":"I was SO excited to get this mascara and went to the store multiple times to check if it was available (because apparently stores don't listen to release dates) and finally got my hands on it. But, I will be returning this mascara because it transfers onto my eyelids even after 8 hours of wearing it. It doesn't fully dry down. So disappointed. The only reason why it gets 2 stars rather than 1 is because it does give your lashes volume which I love.\n…read more"
      },
      "Marbellaaa":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Apr 2016",
         "title":"DO NOT BUY until they fix the formula!!!!",
         "description":"I was hoping the reviews wouldn't be true, but It really doesn't dry DOWN. I barely touch my lashes and I can see the mascara on my fingers. If I press on my lashes it definitely comes off. The formula is super thick making it very clumpy! Luckily I got it for free because I sure wouldn't pay money for this. I was excited to try this but this definitely didn't meet my expectations :-("
      },
      "Rowansmum":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"15 Apr 2016",
         "title":"meh",
         "description":"I was really excited when I saw this product was being released since I really liked the original formula but it didn't hold a curl in my stick straight lashes. I was pretty disappointed. It took forever to dry and I kept having to wipe black specks off my brow bone. Plus it made my lashes a little spidery. Not impressed. Back it went. I'm still sticking to drug store."
      },
      "jesslcas":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Apr 2016",
         "title":"Disapointing",
         "description":"I had such high hopes for this product, since the original is one of my favourite mascaras, but this one I think I could say was the worst mascara I've ever tried. The container is beautiful, but everything else is a MESS. When you take the applicator out, it's like there's this huge clumpy ring of mascara just sitting on the top, I had to wipe it off every time I took it out of the bottle. Second, the mascara just LOOKS awful, clumpy, uneven, hard to work with, takes forever to dry, literally doesn't even make my eyelashes longer, I could go on. Once I thought I'd had enough, I tried taking it off. Tried. I had to mix two makeup removers to finally get that mess off of my face. Extremely disappointed and as soon as possible am going back in to return this.\n…read more"
      },
      "ermccurr":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"20 Aug 2016",
         "title":"Great Waterproof Version",
         "description":"As someone who cannot wear non-waterproof mascara if I want my eyelashes to hold a curl, it was nice to be able to try BTS in a formula that works for me. It does make my eyelashes look very full, long and holds a curl, but I don't see any real value in spending more money on this than a drugstore waterproof mascara."
      },
      "thegirlof99":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"22 Jul 2016",
         "title":"It is really hard to put on and on oily skin it smudges after a couple of hours of wear",
         "description":""
      },
      "shannong84":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"26 Jun 2017",
         "title":"so bad",
         "description":"I wanted to love this mascara and it was awful. It goes on so thick and sticky. It made my lashes stick together and look terrible. It is so sticky and thick that it just looks terrible. I know it's waterproof but the formula doesn't seem to work.Threw it out after trying a few times. One of the worst mascaras I've ever used."
      },
      "stylecoach":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"29 Apr 2016",
         "title":"dries slowly",
         "description":"I was excited enough about this mascara that I wore it to work the next day. About 10 minutes after applying it I sneezed, and I felt most of the mascara transfer to my cheeks. I cleaned up with makeup remover & went on about my morning. Before I left for work I double checked to make sure I hadn't missed anything, only to find that through more normal wear I had managed to get mascara all over my cheeks & eyelids. So I touched my lashes-at this point they had had more than a half hour to dry. They were wet & gummy. I spent another ten minutes blotting my lashes with tissues. If you really need a LOT of working time, this is probably your holy grail mascara, for me it was an epic fail.\n…read more"
      },
      "danasegan":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"26 Apr 2016",
         "title":"upsetting",
         "description":"I bought this bc I love the original BTS mascara. The packaging is beautiful, but it made my eyelashes look like spider legs. It smudges so easily and take a lot of effort to take off."
      },
      "TiffPT":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 Apr 2016",
         "title":"Wanted to love but...",
         "description":"I had high hopes for this mascara but had to return as it was a smudgy mess within 30 minutes of putting it on."
      },
      "CSChen":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"27 Feb 2017",
         "title":"Don't Purchase",
         "description":"I heard the Better Than Sex mascara was highly rated, but I typically like to use waterproof mascaras, which leads me to here... I made the mistake of not reading the reviews first, but hopefully you do not make that same mistake. This formula is horrendous. It smudges. It's clumpy. It makes my eyelashes look spider-y. It's hard to remove, and when I try to fix the clusters of mascara gluing my eyelashes together, it tends to get worse.\n…read more"
      },
      "MegannCarol":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"20 Apr 2017",
         "title":"Worst Mascara Ever!",
         "description":"This is by far the worst Mascara I have ever used!! It gets EVERYWHERE, and is sooo clumpy. I can put on 1 coat of Mascara and my lashes are STUCK together so there is absolutely no volume. I would NOT recommend the waterproof at all. I wish I hadn't wasted the money on this."
      },
      "mimisaur":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Dec 2016",
         "title":"Volume!",
         "description":"This must be the best mascara I ever bought! Do you want volume and fuller lashes? Without having to put falsies? Well this is the product you want!"
      },
      "hayleidai":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"12 Apr 2017",
         "title":"Dry &amp; Clumpy Lashes",
         "description":"I love the regular \"better than sex\" mascara but my only issue with that mascara is it would smear on my eye lids/under brows area during/at the end of my nights.. I figured I could solve this issue by buying the waterproof version but they're like two different products. Regular makes my eyes look huge & lashes luscious, easy to apply. Waterproof turns my lashes clumpy almost right away, makes my lashes look dry,crusty & flaky\n…read more"
      },
      "Zey33":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"4 stars",
         "date":"22 Apr 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I’ve been using this mascara for a couple of years now and I love it. My one complaint though is that almost after a couple of weeks of my constant use, it starts to dry out and clump near the bottom of my brush. For 23$ I wish it lasted longer. But the overall look is still amazing."
      },
      "pjswan":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Apr 2016",
         "title":"Epic Fail.",
         "description":"As a fan of the original BTS mascara, I couldn't wait for the waterproof version to hit the shelves. Totally disappointing & NOTHING like the original. Everything I loved about the original mascara is absent from this product. It is smeary, takes FOREVER to dry, clumps, and mats on the lashes. Why, Too Faced...WHY?"
      },
      "SCHUNG88":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"19 Jun 2016",
         "title":"Very volumizing and lengthening, however, does not dry completely! Not waterproof.",
         "description":""
      },
      "RowGirl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"4 Dec 2016",
         "title":"This is great... but here's what you need to know:",
         "description":"This mascara DOES add incredible length and is waterproof. Exactly what I'd been waiting for for eons. I have been using fake lashes less and less and using this mascara more and more and it saves me time. People say it is chunky. Yes. Yes it is. I actually tried to run some hot water over the wand to try to break it up a bit in the tube and saw something I'd never seen before in the sink: First of all, there were tons of tiny little fibres floating around. One of the reasons this mascara is so chunky but is also so effective, is that because even though they don't advertise it as a fibre mascara, it is one. It's got these tiny little hairlike things that will stick to your lashes and add length, but can also add clumpiness if you're not careful. I also saw how unbelieveably waterproof this mascara actually is. It was a super hydrophobic blob in my sink that water just balled up over and pooled off of. I have never seen that before when I had waterproof mascara in the sink, so I know this one is really truly waterproof to the max. How I use it: First of all, I have always used multiple mascaras at a time, so there's no downer about the fact that I do that here. Normally, I use a cheaper mascara to first coat my lashes and get them kind of \"into position\" (you know how lashes sort of harden once they have mascara applied? That's what I'm talking about.) Then, I apply my next coat using Better Than Sex Waterproof, and right after I do so, I use my sephora metal lash comb to comb off the excess chunks. It works like a dream. I have the most beautiful lashes that take almost no time at all, without having to apply fakes. The only thing I really dislike about this mascara is that I find it takes much longer to dry than any other mascara I've ever used. Once I put it on, I have to be careful where I look around because I often will get little black specks up above or below my eye if my (now elongated) lashes touch anywhere else before it dries (and these have to be mopped up instantly or else the amazingly waterproofness of the mascara will cause the black dots to adhere quite strongly to my face.) Anyhow, I can see why a lot of people don't like this product. If you would rather sacrifice performance (lash length and \"waterproofness\") for a less clumpy and easier to apply mascara then this isn't for you, but if you're willing to take a brief second to use a comb, you will love this product. It's a gamechanger for me and I have twice repurchased.\n…read more"
      },
      "smcox":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Jan 2017",
         "title":"end all be all",
         "description":"Doesn't smudge and lasts all day. My eyelashes have never had this much volume. I don't see myself ever buying a different mascara."
      },
      "AdventureGirlCO":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"1 star",
         "date":"20 Apr 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Clumpy Wet Mess"
      },
      "suncoast215":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"20 Jan 2017",
         "title":"horrible",
         "description":"I really thought this product was going to be amazing, boy was I disappointed. I tried it a few times trying to make it work and it never did. It was clumpy and smudged everywhere. The brush applicator was so big when I try to do my bottom lashes it would hit my lower lid and when I did my top ones it would hit the top of my lid. I never use the regular better than sex mascara so I can't compare with this one. But this was a no go for me anyway back to the store.\n…read more"
      },
      "whitchop":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"27 Feb 2017",
         "title":"Didn't like it",
         "description":"My 6$ drug store mascara does a better job than this. It is waterproof I wore it to my brothers wedding and it stayed on through many tears without smudging. But it did nothing to make my lashes look good they stuck together and putting it on was a nightmare."
      },
      "Kattt098":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"15 Apr 2016",
         "title":"N. O.",
         "description":"Not good for Asian lashes. It didn't do anything at all to my lashes. It held it down and did not curl them. The drugstore have better waterproof mascara a for a more affordable price! Plus they hold the curl better. This is going back to the store"
      },
      "ZoShmo":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"26 May 2017",
         "title":"Clumpy",
         "description":"This mascara was really clumpy and didn't hold a curl as well as other waterproof mascaras I've tried."
      },
      "AraRod":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2016",
         "title":"disappointment",
         "description":"Honestly I was super excited when buying this product. But it turned out to be a huge disappointment. When applying it, it took me a couple coats to make my lashes look long. They it started to flake off throughout the day. Also it's not as waterproof as you may think. When I got into the pool with some friends, they noticed it began to run down my eyes. I don't recommend this product at all.."
      },
      "laurenschroer":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"10 May 2016",
         "title":"Smudges Everywhere",
         "description":"I was so excited to try this as I love the original Better Than Sex formula but the original smudged on me. This one, however, smudged even more on me! Within just a few hours of wear I had black smudges under my brows/on my lids. It's also not as volumizing and lengthening as the original formula. Would not recommend."
      },
      "shaynardo":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"21 Apr 2016",
         "title":"ugh.....",
         "description":"Not a fan. I found the original too flaky, so tried this, hoping it would stick a little better but totally wasn't happy. The brush is always so goopy, it doesn't separate my lashes at all, Looking like a total disaster after I use it. I've tried to work with it like 4 times and I give up. In the garbage for this girl"
      },
      "annachovie":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"21 Jul 2016",
         "title":"yeah it's that bad",
         "description":"Crumbly, flaky, and most offensive-- CLUMPY! Got talked into this one at a store, kept trying to make it work bc of my oily eyelids I thought I needed waterproof. On my next visit an actually helpful employee gave me a trick to put translucent powder on my lashes before using any mascara and now I love my Non- waterproof lashes!!!"
      },
      "IZ95":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Jan 2017",
         "title":"straight lashes will love this!",
         "description":"All the negative reviews had me skeptical but I love this mascara. I have stick straight lashes that are weighed down by almost every mascara (roller lash, ysl babydoll, lancome hypnose, blinc, etc.) but this one HOLDS A CURL. It also adds great volume to my Asian lashes, which never happens in a curling mascara for me. Plus, this formula doesn't flake or smudge all day. The application didn't give me any more clumps than a standard mascara. This is everything I've dreamed of in a mascara. The only con to this product is that since the brush is so fat, it's easy to get product on your lids. This can probably be avoided with practice though (I don't use mascara often because I gave up hope on any working for me) and is great for the tradeoff. I'll continue using this and maybe try out some others in the meantime, like the Lancome definicils and Dior Overcurl. I tried the non-waterproof version and that one weighed down my lashes like CRAZY. It gives more volume for sure but made my lashes stick straight, and also clumped easier.\n…read more"
      },
      "shaeshaeshaeee":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Aug 2016",
         "title":"so awful",
         "description":"Gave absolutely no volume or length just clumped up my lashes. Throughout the day it just smudged onto my eyelids. Don't waste your money on this"
      },
      "MegRose93":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"1 May 2016",
         "title":"Awesome Formula, Flawed Design",
         "description":"I'm writing a review for this because I noticed that none of the other reviews really tell you what you need to know: do you want this? A lot of people are saying that it's too wet, and it's true that it is a wetter formula, but once it dries it stays put. And boy do I mean stays put, I've gone swimming and showered twice and this stays on. So if you're looking for waterproof mascara that is actually water PROOF, this is it. The issue is in the design of the brush and the bottle itself, when you go to put it on the brush just pulls out too much product, making it really easy to smear and get all over, I found however that if I take a damp cloth or a makeup wipe and pull some of the excess off that it goes on amazingly and provides a lot of definition with a little lengthening effect. So it really depends on what you're looking for, if you want an all day beach-proof water-park proof product that will look as good at the end of the day as when you put it on, GET IT. If you want an everyday water-proof mascara, pass.\n…read more"
      },
      "AmandaMarks":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jul 2016",
         "title":"horrible",
         "description":"Very smudgy and takes forever to dry and doesn't compare to the original BTS. I returned mine."
      },
      "Elenka2016":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"14 Jun 2016",
         "title":"The worst mascara ever!!!\r\nUsed to wear Better than Sex the pink one- it was awesome, but this one..\r\n\r\nDry out about in 1 hour. You will look like panda , being blackish everywhere. Impossible to remove even with the strongest make up remover",
         "description":""
      },
      "Wawia":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"21 Apr 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Nice"
      },
      "cbockisch":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"26 Apr 2016",
         "title":"Not the best, but it's waterproof",
         "description":"I bought this to use for my wedding since I did my own makeup and couldn't get the hang of false lashes. I'm so glad I did multiple makeup trials because this was difficult to use! For one, it clumps up so easily, and I had to wipe off the brush to avoid my lashes looking spidery. Usually I wiggle my brush to get extra volume, but doing that just led to the spider look. Also, it takes FOREVER to dry, and I found it transferring to my face and eyes while it dried if I wasn't really careful. BUT, it is waterproof! I cried like crazy at my wedding, and my mascara stayed in place. I wouldn't necessarily re-purchase, but I'm glad I used it for my wedding.\n…read more"
      },
      "Paulie20":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"15 Sep 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"This mascara was very dry, as sooon as I was done applying it black flakes feel under my eyes and ruined my makeup."
      },
      "joann2234":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"28 Mar 2016",
         "title":"Good enough",
         "description":"My eyelashes will only stay if waterproof. It stays all day. Hard to take off. But it does flake. I'd recommend taking a look in the mirror before walking out the door. Umm not sure if I'll repurchase this yet."
      },
      "cloudmerry":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"27 Feb 2019",
         "title":"Kinda surprised this has such low ratings. My lashes are problem central. They don’t stayed curled, are not lengthy, and basically all mascaras go on with added clumps. Once I used this it was like a miracle. Worked great for me. My lashes lengthen out, no clumps, and looked so beautiful. I got lots of compliments. My co workers even went out and bought the same one. I do however recommend when applying take your time. Very easy to mess up with this but once you get the hang of it, works wonders.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "blank2aa":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"3 Jul 2016",
         "title":"Hate it",
         "description":"This is one of the worst mascaras I have ever used. It is smudgy and does not dry. I really wanted to like it and have given it several shots but I just cant do it. This will be going straight in the trash!"
      },
      "littlelostchild":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"22 May 2016",
         "title":"fabulous lashes",
         "description":"I was using a fairly good waterproof mascara that didn't budge regardless of how oily my eyelids were but it just didn't add any volume or extra oomph to my lashes for those days when I just want to be a little dramatic with my makeup. I liked the non-waterproof version of this but sadly it smudged halfway through the morning so I jumped at the chance to get the waterproof version. The wand seemed heavier compared to other mascaras but the formula...wow, it added volume to my lashes and made them pop. I felt it made my eyelashes seem longer too. I agree with other users that said that it seemed like it took longer to dry versus other mascaras. I had some smudging occur when it was still wet but once it was dry, it stayed on my eyelashes and went nowhere else.\n…read more"
      },
      "ksulli":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"28 Apr 2016",
         "title":"Not what I thought it was going to be",
         "description":"I was super excited for Too Faced to come up with a waterproof version of the better than sex mascara as it is one of my favorites. However, I was extremely disappointed. It left huge globs all over my lashes. Not an easy fix. I had high hopes, but I ended up returning."
      },
      "JessyyBee":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Mar 2016",
         "title":"awesome",
         "description":"This mascara is definitely waterproof. It gives your lashes volume, but I find that the original gives more volume... 4 stars because this doesn't achieve the same volume. I still recommend!"
      },
      "catsea1":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"5 Apr 2016",
         "title":"Disappointing clumpy and gloopy mess.",
         "description":"First of all, I am a HUGE fan of the Better Than Sex Mascara. I was so excited and looking forward to the waterproof version to use this summer for humid evenings and water adventures. So I purchased the waterproof version and as soon as I came home tried it out and was utterly disappointed. My pretty lashes were clumped together in a goopy mess. I thought it was perhaps because I had residual mascara on from earlier in the day that caused this disaster. I was willing to give it another chance. Fast Forward to next time. So I just finished my entire face of makeup and I always apply mascara last. I use the Better Than Sex Waterproof Mascara on CLEAN lashes.. and to my dismay and gloopy, clumpy mess! It was horrible, I had to take off ALL of my makeup and redo my face before starting my day. Needless to say, i returned this disappointment and exchanged it for the regular, well loved version.\n…read more"
      },
      "BeTQ":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"4 Apr 2016",
         "title":"Not all that I expected",
         "description":"I am a huge fan of the Better Than Sex mascara, but I always had to use a waterproof lash topcoat in order to make the mascara not transfer (aka panda eyes after a few hours). Was super stoked to try this waterproof version. I've been using it for a few days now and every day I've ended up with the mascara all over my bottom lid... Probably going to return this or not repurchase. Not as waterproof as I thought it would be. I prefer the waterproof topcoat method with the original Better Than Sex mascara because the original formula seems to be more moist and easier to work with.\n…read more"
      },
      "NYmakeupluv":{ 
         "extra_info":"<b>Skin Tone</b> Light",
         "stars":"2 stars",
         "date":"31 Mar 2016",
         "title":"Comes out in clumps",
         "description":"This is not worth the hype or the money, most of the product comes out and you have to wipe it off and throw it out, there is so much all over the wand and the applicator it goes on wet, not as volumizing as the regular better than sex, want to return"
      },
      "Cayee":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Sep 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I won’t use any other mascara. Love the volume it gives and I have no had any issues with clumps! I have been using this product since it came out and I absolutely love it."
      },
      "lynneahcarey":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"8 Jan 2017",
         "title":"The formula is nice. However the brush is just too big. I have never owned a mascara that gets all over my eyes even when I'm being super careful. Every single application I end up having to hope to God I can remove the smudges under my eyes and on my eyeshadow (once as high as my crease) because I've somehow touched my skin with the brush. I'll use it up but I won't repurchase",
         "description":""
      },
      "melissax8198":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Apr 2016",
         "title":"Extremely waterproof",
         "description":"I love using waterproof mascaras because they actually keep my lashes up ALL day! So obviously when I saw that they best selling mascara was finally waterproof, I was completely on board. The wait was worth it. this mascara is so waterproof that I actually have to use coconut oil to remove it! TIP: OILS REMOVE ALL WATERPROOF MAKEUP! The original is very clumpy and since this ones waterproof it's even thicker, but I was expecting that. I just use a lash definer brush to brush them out a little more. Other than that I love this mascara. I can go swimming in it\n…read more"
      },
      "natnatbrat":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"15 Apr 2016",
         "title":"disappointed",
         "description":"I thought it was going to be great but it's honestly below average. Very clumpy and smudges. I've had better mascaras. :("
      },
      "Kleegarrett":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"24 Apr 2016",
         "title":"I was really excited to try this mascara because I was in love with the original. But I was just disappointed with this. I felt like as soon as I put in on it got very clumpy and never really dried it was always kind of sticky. It did not seem to have the same or similar formula as the original. Getting this mascara off was very difficult. I understand that this is waterproof, but it took me almost three days of makeup wipes and oils and waterproof makeup remover to get this stuff off of my eyes. Honestly, I would just skip this product and go for the original. The reason I gave it two stars was because the packing was absolutely gorgeous.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "missmontes23":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2016",
         "title":"never again!!",
         "description":"I will never buy this mascara again!! It was waaaay too clumpy I thought it would be a good mascara but apparently not! I used it only once n went n got my money back the next day!! Never again"
      },
      "InPhoenix":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"21 Apr 2016",
         "title":"Much Wetter Than Original",
         "description":"I LOVE BTS original formula. It dries quick and leaves lashes full and feathery. This BTS Waterproof formula is incredibly wet. I couldn't build up my lashes because the formula was so wet that all it did was make my lashes droop and clump together. Additionally, I inadvertently smeared it around my eyes a couple times touching up my lids or looking down because it was so wet. It also seemed to take forever to dry. I was hoping this formula was like the original sans the flakes but it is certainly not.\n…read more"
      },
      "DelDeci":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"3 Apr 2016",
         "title":"Smudges",
         "description":"This was a major disappointment. I'm so sorry to have to leave this review but this smudges terribly. Hours later I can still rub my lashes and have it smudged all over my finger. Doesn't seem to dry. This is with one measly coat too. Also it's clumpy"
      },
      "Araeli":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"19 Jan 2017",
         "title":"Great for hard to curl lashes",
         "description":"I have very flat and thin lashes that are hard to curl, but this mascara keeps them curled all day. I've also used the one that isn't waterproof and it also keeps my lashes pretty curled but not like this one. The only problem is that it does end up making my lashes fall out, which is disappointing, but it seems to be the only mascara that works for me right now. I used coconut oil to remove the mascara at night and I'm extremely gentle with it, but I may have to go back to the regular non-waterproof one so I won't lose anymore lashes.\n…read more"
      },
      "HannahElaineW":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"13 Apr 2016",
         "title":"will repurchase",
         "description":"Is waterproof. Holds curl better than the original. Doesn't add volume."
      },
      "Xicana94":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"13 May 2016",
         "title":"The brush seemed to be very worn, it did not look like on the picture. The formula is ok if applied with another brush.",
         "description":""
      },
      "EmGiannopoulos":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"14 Jun 2016",
         "title":"Hugely disappointed",
         "description":"I am a huge fan of the Too Faced Better Than Sex mascara, so I was excited when this was released. Unfortuantely, the waterproof version is nothing like the original. It's very goopy, thick, and extremely hard to get off your lashes. I tried to use my regular makeup remover, which I've used for years, and it was so stuck that it actually pulled out several of my eyelashes when I tried to remove it. It also doesn't dry for probably 20-25 minutes, so your face ends up looking like a disaster of mascara.\n…read more"
      },
      "luceewhoo":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Mar 2016",
         "title":"yasss girl",
         "description":"I stopped using the original because it would be gone by the end of the day. This one stays put all day!! Eyelashes on fleek! I feel like it doesn't give you as much volume as the original one.. You can just apply an extra coat :) I really do like this mascara:)"
      },
      "Melissa136":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"5 May 2016",
         "title":"Volume and Length!",
         "description":"I took the plunge and tried out the mascara despite the negative reviews. I hated it at first, but as the tube dried the formula got better and more like the original BTS. It is a very wet formula and the wand picks up too much product. The original BTS also picks up too much product, so I wasn't expecting that much of an improvement with the waterproof version. Like other reviewers have said, it takes a long time to dry. That's the only negative I have with the mascara. It is messy and clumpy, but I think it's mostly due to the brand new tube. My first impression was bad, it got all over the place and my eyelashes looked horrible. I really wanted to love the mascara, so I kept trying it. As the tube dries, the clumpiness goes away. I can do a couple coats without getting as clumpy as I did the first time. And I'm no expert with mascara at all. I have thick yet sparse eyelashes. Volume, length, and definition - I need it all. And my lashes only hold a curl if the formula is waterproof. The mascara gives me all of that, and I believe it will only get better as the tube dries. It's been a week and I'm slowly starting to love it, so don't give up after the first try!\n…read more"
      },
      "ellenwhitehorn":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"31 Mar 2016",
         "title":"LOVE",
         "description":"I have naturally long lashes and this works GREAT... My favorite mascaras are the original BTS and benefit they're real, and this is like a combination of both. AKA the best ever. It has longer staying power and less flakiness than the original BTS.... Only an improvement on an already great product. Week 1 with this product and I doubt I'll be trying any other mascaras. It's fabulous!"
      },
      "Lisette666":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Mar 2016",
         "title":"AWESOME",
         "description":"Now I can cry all I want without having to worry about looking like a racoon! It's better than the original by far."
      },
      "cadubois4":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Apr 2017",
         "title":"LOVE",
         "description":"Not sure how people are unable to remove this - both baby oil or coconut oil on a cotton ball remove every little bit easily with no tugging. In regards to people getting the \"spidery\" look - there's a learning curve with this mascara. It's extremely wet and you have to go in very lightly until you get the hang of it. You can't go in hard with a heavy hand or you'll get clumps and spider lashes. Go in with a light light touch, don't do too many repeated strokes, give it ample time to dry, and once you figure out the hang of this mascara, you won't believe the length and volume of your lashes. Also you must curl your lashes before applying!!\n…read more"
      },
      "denas":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"4 May 2016",
         "title":"Slow to dry, hard to remove",
         "description":"I love the original formula, but prefer waterproof mascaras. This waterproof version does NOT compare to the original. It took forever to dry. It was actually spattering on my eyelids and under my eyes. Eventually, I used my hair dryer on a cool, low setting to dry this. At the end of the day, it took forever to remove this mascara, with traces appearing up to 3 days later. This is going back."
      },
      "MrsKeller":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"1 Aug 2016",
         "title":"Yuck",
         "description":"This mascara was recommended by a Sephora employee, and I wish I hadn't listened. I tried to use it for the third time, and I couldn't even see the brush because of all the mascara all over it. I won't put that on my eyes. Whoever named this is having sex with the wrong person."
      },
      "suzieeeee":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"3 Jul 2016",
         "title":"DONT WASTE YOUR MONEY!!!",
         "description":"This product is horrible! I was REALLY HOPING to love it bc I absolutely love Too Faced products but the formula is clumpy and dry and it's a total mess!! Please don't waste your money on this!!!"
      },
      "hayleymoo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Apr 2016",
         "title":"Way Better than i expected",
         "description":"ok I was SUPER skeptical about purchasing this after seeing the low reviews. I am constantly on the search for a holy grail waterproof mascara. I have oily lids and the weather is always hot. Every mascara that claims to be waterproof either smudges or flakes. I love the original better than sex mascara but it smudges! Right after receiving the waterproof version i wore it to the hot farmers market and it didn't smudge or flake! The mascara is dark, volumizing, and lengthens. i found my new go-to mascara.\n…read more"
      },
      "Karina1202":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Mar 2016",
         "title":"AMAZEBALLS!!",
         "description":"Always wondered when they'd come out with this bad boy, glad it's finally here. I can wear it and not worry about seeing flakes on my under eye. I curl mine after it dries because they hold in place all day! I've always preferred waterproof, but dealtwith the original one because I love the way it leaves my eyelashes so I would always put a waterproof on top!! Now I don't have to! I bought a few because I don't want to run out!\n…read more"
      },
      "TGull":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"18 Apr 2016",
         "title":"Better than Sex? I think not.",
         "description":"I am so disappointed with this mascara. It did absolutely nothing to shock me. Do not let the name fool you ladies, you can honestly buy a different mascara at the drug store that gives better results than this $20 something mascara. What a joke."
      },
      "magdarun":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"15 Mar 2017",
         "title":"hard to remove",
         "description":"This waterproof mascara really holds up for regular wear. I bought one tube but I do not plan to repurchase. I am in search for a better waterproof mascara. Pros: I have watery eyes due to allergies and this mascara does not smudge during the day. It made my lashes look very long, curly, and full, which also holds up during normal wear. Cons: It does smudge during humid or very sweaty days, such as gym days. It is very difficult to remove. It often pulls off my lashes when trying to remove. I did not buy the remover that is sold with it. The brush can smudge on my eyelids if I don't do it very carefully. If I reapply more than one coat the lashes clump. If you don't mind buying the mascara remover they sell for it then it may be great for you.\n…read more"
      },
      "vero96":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Feb 2017",
         "title":"the only mascara that works on me",
         "description":"I have super straight lashes to the point where they even get into my eyes and bother me (yes that straight) and I've honestly tried every mascara out there from low, medium and high end and even waterproof I've tried maybelline, rimmel to benefit, bare minerals and Dior, Gucci and even chanel but none of them can keep my lashes up for more than an hour before they fall pitifully straight and clumpy thankfully I found this mascara through my bestfriend and it's a miracle my lashes stay up all day and look like falsies! Their is minor clumping which can really just be fixed with a clean mascara brush and slight smudging which was manageable but it's truly amazing everyone's lashes are different but I can def. recomend this to anyone with super straight lashes\n…read more"
      },
      "cassrenae":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Apr 2016",
         "title":"disappointing",
         "description":"I never write reviews, but had to leave one for this. I am beyond disappointed.. It is awful. Way too clumpy. I love makeup and will always be honest about it."
      },
      "PentecostFriday":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"3 Jul 2016",
         "title":"ABSOLUTELY TERRIBLE!!!",
         "description":"I had high hopes for this mascara. It smudges easily and never really dries. Your lashes stay sticky for about 5 hours after applying it. It flakes off and gets into your eyes. Big disappointment!!"
      },
      "Meridyan":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"3 Apr 2016",
         "title":"nothing like the original",
         "description":"I really wanted to love this. My daughter and I both adore the original bts and couldn't wait for the waterproof. It did NOT live up to our expectations. It didn't have the same look we have come to love. It was an ok waterproof and did really stay put for both of us but the actual look of the mascara was very disappointing. This will be used for high humidity days or time we know we will be shedding tears. So sad, with all the hype this fell very flat.\n…read more"
      },
      "lipstickfix":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Feb 2017",
         "title":"love it!",
         "description":"This mascara is great for my sensitive, watery eyes and oily lids. Stays put, gives dramatic results, and doesn't make my eyes freak out. I know a lot of people prefer the original formula, but I have to use waterproof because my eyes water in the smallest gust of wind, bright sunshine... literally anything! Out of all the waterproof mascaras I've tried, this is the best."
      },
      "tayelspeth":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"26 May 2017",
         "title":"Eh",
         "description":"I love the original Better Than Sex mascara but the formula is obviously different with the waterproof kind and I just dont like it."
      },
      "sherlynmendes":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"17 Aug 2016",
         "title":"only use is needed...",
         "description":"I love the look of this mascara but it is a very messy mascara.... Takes forever to dry so it tends to get everywhere even after 15 minutes! I have to put my eyeshadow on after I put it on, and we all know how difficult that can be with a voluminous mascara! So annoying! On a good note it is definitely a water proof mascara that doesn't flake off throughout the day so it's awesome for the days needed."
      },
      "BlitzyWitch":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"14 Dec 2018",
         "title":"LOVE this. My girlfriend gave me a gift card for my birthday with the suggestion to try this. Best waterproof mascara I've ever used (I'm 45, that covers a lot of brands)",
         "description":""
      },
      "21Jenn21":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"21 Sep 2016",
         "title":"awesomeness",
         "description":"finally found a mascara that does not clump and actually work the way it says"
      },
      "smudged123":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"26 Dec 2016",
         "title":"smudged and clumped",
         "description":"I had high hopes for this mascara but I was disappointed the first time I used it. Even though I got the waterproof one, it smudged and transferred to the bottom of my eyes. Then a week or so after I started using it, it started to clump. Save your money and buy something else. The shape of brush is nice because it targets the outer and inner lashes but that's all it is good for."
      },
      "slh5243":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"5 Apr 2017",
         "title":"Don't understand the hype!",
         "description":"I don't get why people love this stuff. It is super dry and feels awful to apply, and it isn't waterproof! My non waterproof mascaras do better at being waterproof than this one! It also smudges like crazy. So if you want crunchy lashes and raccoon eyes within minutes of applying this is the stuff for you, otherwise try literally any other waterproof mascara and you'll be much happier. Hopefully I can return."
      },
      "Leighcarter":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"11 May 2016",
         "title":"Didn't dry very much at all I prefer the regular better than sex, the regular isn't as clumpy",
         "description":""
      },
      "Katelyn89":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"3 stars",
         "date":"16 Jul 2016",
         "title":"Doesn't dry down, and is deffiniatly not waterproof, but better then the original. 3 stars because it makes your lashes look amaaazziggg. Mix with another waterproof mascara to make it actually waterproof.",
         "description":""
      },
      "bambispice":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"30 Oct 2018",
         "title":"Shocked by the bad reviews.",
         "description":"I can’t belive all of the crap reviews this mascara has. I’m obsessed with it, it holds my stick straight lashes in the most perfect curl (using an eyelash curler), comes off so easily with coconut oil. It doesn’t dry quickly but I put it on as the first step in my routine and brush my teeth, do my hair, etc, before I finish my makeup and it’s PERFECT. Lasts an entire 12 hour shift as a RN. People always think I have lash extensions!\n…read more"
      },
      "clairreee":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"19 Jul 2016",
         "title":"okay this stayed on through me finding out my boyfriend cheated on me multiple times. it is very good. doesn't run, stays on in pool, always stays",
         "description":""
      },
      "k4t3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"9 Feb 2017",
         "title":"Great, but not perfect.",
         "description":"I love both BTS mascara's. I prefer and have used consistently - the waterproof version because it doesn't flake like the original formula, and it's very volumizing. Most mascara's I buy end up flaking, landing just under my bottom lid and before noon I have dark under eyes. The waterproof BTS doesn't do this. It does dry out too fast. On average I need a new mascara about 3 weeks after first application."
      },
      "jilliansabrina":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"24 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"HOLY GRAIL MASCARA"
      },
      "kgibbs":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"9 Jun 2016",
         "title":"I love Too Faced products and have used the regular Better Than Sex mascara for years. The waterproof version does not live up to its predecessor! I've spent the past five days at the beach and this mascara does not hold up to the heat and humidity. It takes forever to dry, is super clumpy and melts off on my fingers and under eye area up to an hour and a half after I apply it. I won't be purchasing this product again.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "cgmitt":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"18 Apr 2016",
         "title":"4.75 stars",
         "description":"I need to use waterproof mascara because my eyelashes uncurl with normal mascara (I have stick straight, very stubborn lashes). I currently have a favorite mascara (Tarte Lights Camera Splashes) but I heard so much about the original formula of Better Than Sex, so when the waterproof version came out, I bought it right away. I cannot compare this to the original formula, but my first impression was that I don't like the brush. The mascara tends to glob onto the thicker ends of the brush. I had to spend a lot of time combing thru trying to get the thick clumps out. On the plus side, I only needed one coat! When I was done applying, I was VERY impressed with the volume I had. This stuff is no joke. Also, it is a great waterproof formula. This did not budge at all during the day. Sometimes I get smudge marks under my eyes from other \"waterproof\" brands. When I want a dramatic look, this is now my go-to mascara.\n…read more"
      },
      "annaday":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"24 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"BEST MASCARA EVER!!!"
      },
      "krastins":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"7 Sep 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I have extremely long eyelashes, and I need a mascara that will keep my eyelashes curled (having them touch my glasses everyday is uncomfortable) as well as stay waterproof. I dislike the Better than Sex formula because I find it flakes off during the day and does't hold my curl. However, this does! I had a stressful moment at work recently and a few tears sneaked out of my eyes, so I went to the bathroom to wipe the raccoon streaks from under my eyes...and there weren't ANY. I couldn't believe it. I've tried Dior, Marc Jacobs, Too Faced, you name it, but this mascara is my HG. Not sure why there are so many low reviews, but for me, this is as perfect as it gets.\n…read more"
      },
      "xoarielll":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"3 Apr 2016",
         "title":"love it more than the original",
         "description":"I absolutely love this! I was so excited when I heard they were making better than sex waterproof because I use it everyday! I love it this so much more now, the only problem I had with better than sex was it wouldn't stay all day and would sometimes smudge a little bit under my eye. Definitely doesn't happen with this and it gave me the same volume/length and holds a curl very well. It is a wetter formula which I also like because it's less clumpy. Sooo happy with this, thank you too faced!\n…read more"
      },
      "Floence":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Apr 2016",
         "title":"Amazing",
         "description":"This mascara is absolutely amazing, I have straight eyelashes, and this keeps my eyelashes curled very well, all day! Would definitely repurchase, and I recommended this for anyone."
      },
      "Kalinchavez":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Jan 2017",
         "title":"Best mascara ever ! It is Waterproof",
         "description":""
      },
      "iamjenneee":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Sep 2016",
         "title":"Amazing!!",
         "description":"This mascara was recommended by a friend very into makeup and let me tell you...I DO NOT regret my purchase! Let's just say, I met a guy on tinder, things were going great, we dated, the next thing you know, I'm drinking bottles nd bottles, crying profusely till I fell asleep and the next morning I wake up and still look bangin!! This product did not budge or smudge!! Love love love it!"
      },
      "Emmiewall":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Jul 2016",
         "title":"wow!",
         "description":"This mascara makes my eyelashes look AMAZING!! Also water proofimg lasts forever!"
      },
      "fezhora1":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Jul 2016",
         "title":"not what i expected.",
         "description":"I wanted to love it, since I already spent my money but it's just not working for me, it even made my lashes fall off. The bruh didn't seprate the hairs which is horrible I definitely don't recommend it to anyone."
      },
      "lovelyleslie2":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"16 Nov 2016",
         "title":"Brush",
         "description":"I think this is a really good mascara and does not fade or smudge on the eyes. I do think that the brush has so much mascara on it. Before I use it I scrape the brush on the sides to take some of the mascara off. It's really irritating to do that each time. If I don't the mascara will all go on my eyelashes causing them to thin out, looking like I have none."
      },
      "Callienicole216":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Mar 2017",
         "title":"UHMAZING",
         "description":"Guys. Why is this mascara getting anything less than 5 stars? I've used this mascara for about 8 months now, and it's perfect. I have eyelashes that are basically not visible, and short. This mascara gives me lashes I don't even have!!! I get compliments on them all the time. No smudging, idk why everyone else has it. Maybe because they don't let it dry? Idk. I just put on at least 3 layers and bam. I've literally had people ask me where I get my fake eyelashes. ITS WORTH THE MONEY, PEOPLE!! Also, hack for removal: coconut oil. Works like a charm(:\n…read more"
      },
      "Maril55":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"16 Aug 2016",
         "title":"Not pleased",
         "description":"This mascara clumps and does not separate lashes."
      },
      "ashlynnichole":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"7 Apr 2016",
         "title":"As far as looks it's definitely just like the original BTS mascara, only this one doesn't dry. I've had it on for a few hours now and it is still smudging all over my eyelids. Will definitely be returning or exchanging for the original.",
         "description":""
      },
      "Zyrah":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Sep 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"I hate it! Clumps, too much product on the wand, never dries... great result but so much trouble to apply!"
      },
      "TerahT":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"30 May 2016",
         "title":"Tricky but worth it",
         "description":"Let's talk about the uses for this mascara. This is a great mascara for people who NEED waterproof mascara such as swimmers. This is probably not a great mascara for people who are looking for an everyday mascara that won't smudge or run. I personally only use this mascara if I know that I might go swimming or cry. The pros - This mascara sticks to your lashes like superglue. It will NOT budge the rest of the day and probably the rest of the week too. I could probably wear it during the zombie apocalypse and still come out with no smudging. -It's super volumizing, black and lengthens really well too. It makes you look like you're wearing falsies. The cons: -This mascara takes some getting used too. It is a very wet formula and there's a ton of product on the brush. I would strongly recommend combing out your lashes with a spoolie if it seems there is too much product. -It takes a long time to dry (approximately 15 min), probably because the formula is so wet. (This is probably a good thing it's so wet because it won't dry out quickly in the tube.) -It's incredibly hard to remove. There's a reason why this is sold with a special remover. Overall, this is an amazing waterproof mascara. If you're looking for \"THE waterproof mascara\" then buy this!! It will not budge. If you're looking for just a volumizing mascara, it's probably better to just stick to the original BTS or another nice mascara.\n…read more"
      },
      "girlforgators":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"13 Sep 2019",
         "title":"horrible names",
         "description":"dirty juvenile names of products are a total no for me. i find too face products to be very good but the names forces me not to buy!"
      },
      "beauty125":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"17 Apr 2016",
         "title":"Goopy mess",
         "description":"I love the original mascara so I was excited for the waterproof version despite all the negative reviews. It is horrible. I returned it immediately. Gloopy mess! It made my eyelashes all clumped together in thick black goo."
      },
      "SusanBee":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"12 Aug 2017",
         "title":"Great Stuff!",
         "description":"I have used so many so-called waterproof mascaras over the years and this one is the best by far. I am a swim instructor and swimmer so I've tested them all actually in the water. It is a thick formula so I gently take some off the brush on the container edge. I like a bristle brush for mascara application so no complaints there. I apply to clean, dry lashes. It does take a minute to dry but I can tell you that after being in the water for hours I do NOT have raccoon eyes (I do not rub my eyes at all) I do think it wears off gradually while I'm swimming so my lashes may not look as good as they did in the morning, but in the evening I do need to use a makeup remover to remove whats left so I know there is still some there. I love it and have yet to find a better waterproof mascara.\n…read more"
      },
      "choik":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Sep 2016",
         "title":"one of my favorites now",
         "description":"I'm surprised to see the negative reviews on this product. I fell in love immediately after buying a travel size version to try out. I didn't think the brush would \"wow\" me, but it doesn't clump the product on my lashes, separates them beautifully and holds curls so well. (Thick straight heavy Asian lashes for ya) It provides just the right of length and volume to my liking. Mascara is a very personal beauty item, but I definitely love it! I have hooded eyes, and there was no transfer, no smuding whatso ever. The packaging is also sturdy. I'm getting myself another travel size because I actually sadly lost my last one.\n…read more"
      },
      "torasa":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"21 Jul 2016",
         "title":"Actually loved this",
         "description":"I actually love this and find it to be very waterproof, it even stayed on when my eyes teared up and I found it hard to come off at the end of a night. My only issue with it is that it's a little clumpy but other than that it was a great purchase. I'm curious why some people had so many issues with it"
      },
      "aquanet":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"16 Apr 2016",
         "title":"terrible terrible terrible",
         "description":"How this mascara claims to be the best remains a question. Sure, it goes on nicely, which made me think that in my quest to find the perfect mascara, I was nearly there. Unfortunately, from the time I put it on, checked it, rechecked it 10 minutes later, left the house, then checked it again before I walked into the office, it was a disaster. I had mascara under my eyes, on my upper eyelids, and flakes that had somehow appeared out of nowhere in the 60 minutes I had it on. Definitely returning. Definitely FAR from better than sex. Such a let down.\n…read more"
      },
      "Leni331":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"15 Apr 2016",
         "title":"High Maintenance",
         "description":"Pros: extremely volumizing, very black, doesn't smudge as much as the original, fairly easy to remove (I use the Sephora waterproof makeup remover) That being said Cons: wand gets too much product on it I would suggest wiping it off, clumpy so a fine toothed eyelash comb is a must, the wand is difficult to control so as not to get mascara all over my eyelids, I have very oily eyelids so this still smudges a little bit on me but it's nothing I can't fix by just wiping away with my finger Bottom line: if you want a ton of volume and don't care about length or how much you have to do to get this to look good then I'm sure this will work for you but personally I think this mascara requires too much work to use on a daily basis\n…read more"
      },
      "MarissaDawn98":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Apr 2016",
         "title":"At first I did not like it but...",
         "description":"This is the first High end mascara that I have bought. The first time I used it I was a little put off by the results but then I figured how to apply it so that it worked best for me. I did read the comments before I spent my money and went out on a limb. The way I apply the mascara is I put Urban Decay primer plus setting it with a face powder and I only apply the mascara on my top lashes, on my bottom I put a waterproof drugstore mascara( L'Oreal waterproof Voluminous Butterfly mascara which is extremely waterproof!!) I take time in between coats ( around 2) to try and avoid extreme clumps as one eye always comes out Gucci and the other doable if I rush. The Mascara formula is pretty wet so I have to pay a little attention when I apply and clean up with a Q-tip after. At the end of the day I do have some smudging but that is probably 10+hour wear and on top of that I have pretty oily skin as well. I haven't noticed flakes when I wear it. I do enjoy this Mascara. Also I am not a makeup pro by any means but have adapted to fit my needs.\n…read more"
      },
      "maryg85":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 Nov 2016",
         "title":"best mascara ever!",
         "description":"I LOVE this mascara!!!! I'm a mascara junkie, I'm obsessed with mascara and i have to say this is my very favorite. It makes my lashes look amazing but natural. It doesnt clump like benefits they're real which I really wanted to like but I cant. I do my lower lashes first just so when I do the upper ones theres not so much product that could make them clumpy And also love the packaging. Feels heavy and luxurious\n…read more"
      },
      "sveliz":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Apr 2016",
         "title":"I absolutely love this mascara! It holds my lashes in forever and when you take pictures , it accentuates them. It is a pain to remove but it's worth every penny.",
         "description":""
      },
      "JonnaeL":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"13 Apr 2016",
         "title":"Terribleeeee",
         "description":"When I bought this mascara I was soooo excited to use it because I wanted the original formula but the cashier told me that the waterproof mascara was better. BIG MISTAKE!! It does not dry which causes a mess, the brush bristles are short which causes to much product to come out and it does not go on smooth."
      },
      "Christianamw":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"3 stars",
         "date":"1 Apr 2016",
         "title":"Not as good as the original",
         "description":"I bought this today when I went into the sephora store to pick up the original and they had the waterproof in stock. The woman working told me it was much better, clumped less and looked just as amazing, but that really wasn't to case for me. The first time I applied it, it looked really nice! I didn't notice more clumps but I figured it was because it was a wetter formal than the original and I just wasn't used to it. I removed it soon after because I had a bit of a headache and didn't want makeup on any longer. A bit later I decided to play around with it again, and I just wasn't impressed. It clumped, got everywhere, and it looked really odd and uneven, which can sometimes happen with my lashes, but not to this extent. I also noticed smudging underneath the eye within minutes of applying, and I didn't even put any on my bottom lashes. So I will be returning this and getting the original instead. I'm a fan of the drier formula on the original and the overall look.\n…read more"
      },
      "OliviaAnn11":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"16 Jul 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"What a Mascara!!"
      },
      "accordingtoame":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"9 Apr 2016",
         "title":"Lasts all day, even through an intense workout",
         "description":"I only \"liked\" the original version of this, and would wear it occasionally over a waterproof mascara base. It was flaky and usually too wet. I was hoping for a waterproof version and was so excited to see it actually coming out this year. My tube arrived the other day, and I noticed that this formula is slightly drier than the original. I was curious if that would cause flakiness but I have since worn it through three full days, one of which included an hour long boxing class. Not one day did I have issues with flaking, and it was on root to tip all day each time. When I removed my makeup the night I worked out, my lashes looked as good as they did when I first applied the mascara in the morning, and that was after 18 hours had passed. No flaking, no smearing, no smudging, and above all no transfer on to my brow bone, which I often get with other waterproof formulas. In one coat of this I still get just as much oomph as I do from the original version, but with two of either version, it's va va voom. The difference is simply how long it lasts, and this one stays put all day. I like to use a really small/skinny brush waterproof as a primer first because it gets between the lashes really well, and helps lock in the curl, and then go over with a fatter brush like this. I think I found my new \"fat brush\" waterproof mascara. I am going to order a second tube so I have a backup in case I drop this one in the sink.\n…read more"
      },
      "LBD0130":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 Apr 2016",
         "title":"So glad they finally made a waterproof version!",
         "description":"I LOVE this mascara! The volume and definition it gives your lashes is just as good as the original! I do agree with some reviewers that the brush tends to hold a lot of excess product. Here's a tip: Take a tissue (or use your hand) and blot off the excess. It will make a HUGE difference and you won't have to worry about clumps. Some people think it's a waste, but mascara is only good for 3 months! I've always wiped the excess mascara before applying 2 coats once (sometimes twice) a day and I've NEVER run out before the 3 month mark.\n…read more"
      },
      "AKnee":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"2 Jul 2017",
         "title":"wow",
         "description":"I have Asian eyelashes that refuse to stay curled with most mascaras, but not this one! This hold my curl for the entire day. As other commenters have mentioned, it does flake a little, but if you have straight droopy eyelashes this will probably work for you!"
      },
      "ccstrong":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"15 Nov 2016",
         "title":"Let down",
         "description":"I had high hopes for this based on what it said it was supposed to do. I think it becomes clumpy really easily. I have trouble with the brush. I think it holds too much product and gets all over. I don't care for the hour glass curve on it either. It might be great for someone else though."
      },
      "Emilylb":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"14 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Great Waterproof"
      },
      "RaychelLeanna":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Mar 2017",
         "title":"Disappointed",
         "description":"I love the regular Better Than Sex Mascara, so I decided to try this one. Complete disappointment. The formula is clumpy, it's EXTREMELY HARD TO REMOVE, and the bristles on the brush seem harder than the regular BTS Mascara. Will be going back to the pink tube for sure. Really wanted to love this!"
      },
      "ginav17":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"27 Apr 2016",
         "title":"Need another one",
         "description":"I was really excited to buy this since I never bought the original because I need a water proof mascara. I think I'm going to return mine and ask for another one because when I opened mine, it was extremely messy and dried crumbs of the mascara were everywhere. I'll try again because maybe I got a bad batch. But I wasn't happy that's for sure. The mascara is all over the wand."
      },
      "irisunflower":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Apr 2016",
         "title":"Worst waterproof mascara",
         "description":"I'm very big on eyelashes, they are my #1 priority when it comes to makeup. I'm also a very big fan of the OG BTS mascara so I was very excited about this because I always use a waterproof mascara first. When I first opened this mascara it came out as a big black clump & got soo messy. I put it in my right eyelashes & they started to fall out as I was putting on the mascara!! I literally counted 6 eyelash hairs that stuck to the brush & I stopped & took it off. I take very good care of my eyelashes so this doesn't usually happen. Please save your lashes & don't buy this mascara!!!\n…read more"
      },
      "shelbyelizabeth":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"3 Jun 2016",
         "title":"Worst Mascara Ever",
         "description":"It's clumpy to the point where your lashes become one monster lash. Combing them doesn't help either. It also takes forever to dry and isn't actually waterproof, just smudge resistant. The only good thing about it is the packaging."
      },
      "n35w101":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"6 Aug 2016",
         "title":"Bad sex, until you find the sweet spot",
         "description":"I bought this on a trip because I forgot my UD Canonball. I hated it: thick, gooey, clumpy product and awful brush. I thought 'If this is better than sex, the people at Too Faced must be having really bad sex.' But, when I got home, I kept it and decided to give it another chance ... this time using my mascara warmer (from Godefroy). TOTALLY different experience. Once warmed, the product goes on with the least clumping I've ever experienced, and does a fantastic job of defining+lengthen each lash. Because the product doesn't clump, the wand goes from a dud to a stud. Much like with sex, you just need to get properly warmed up with this particular product. Then you'll get your satisfaction.\n…read more"
      },
      "Thatchickclaire":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 May 2016",
         "title":"I honestly don't know why this has bad reviews. A lot of people say it transfers or flakes?? I don't have either of those problems. I wipe off some of the product back into the tube before I put it on so its not all clumpy. Which in result I think helps with flaking when it's dry. It does take a little while longer to dry but it shouldn't transfer if you're not rubbing your eye while its drying. It's also 100% waterproof. Overall I highly recommend<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "alexkitkat":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"22 Apr 2017",
         "title":"BETTER THAN MOST WP",
         "description":"First time purchasing this brand and I was very hesitant since there were so many bad reviews online. I took advantage of my VIB coupons and decided to splurge and buy this on a whim. Application is a bit messy but nothing a qtip cant fix before it dries. I usually curl my lashes before applying mascara and this holds it so well! Through out the day I tend to rub my eyes and this stuff stays on no matter what. One thing which most reviews stated was that its a hassle to remove. I thought I had most of it off but in the am I had left over residue under my lower lashes. Over all this mascara is a wonder. I wish they would improve the formula a tad bit. I can see why people complain about how it clumps up. Make sure to really brush your lashes with a spooly first and give them a good lash curl. Otherwise my lashes are BOMB.\n…read more"
      },
      "AsianPrincess93":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Nov 2016",
         "title":"LOVE THIS MASCARA!!",
         "description":"I have monolids and my lashes are stick straight. I use the Shiseido eyelash curler and it keeps my lashes up all day! I wear false lashes too and I hate when my natural lashes go down."
      },
      "Logia":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"27 Apr 2016",
         "title":"Sad :(",
         "description":"Read the reviews after purchasing (oops). I did find that mascara looked nice when applied but took a really long time to dry. Transfer was a problem - my lashes do touch my upper lids and under eye area. I wore it to a wedding and thankfully the melting was minor but I kept having to wipe under my eyes to get rid of the little black smudges. The applicator was ok, but the formula is so incredibly wet it was difficult to maneuver.\n…read more"
      },
      "nanu123":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"20 Jun 2016",
         "title":"Not what I was expecting",
         "description":"I thought that I would love this mascara, given how much I loved the non-waterproof version. The pink tube was great, but by the end of the night, it would flake all over my face. I thought this would solve this problem, but instead it was clumpy, impossible to remove, and, (as I found out after a tearful night) not actually waterproof. If you like BetterThanSex, I suggest you stick with the original version."
      },
      "tabithatoo":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"31 May 2017",
         "title":"Horrible",
         "description":"Too thick, clumps lashes, and won't come off with Lancôme facial wash. If you're going for the spidery, weird crooked eyelash look, this is for you."
      },
      "Abhynson":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"11 Mar 2017",
         "title":"Love",
         "description":"The formula to me was exactly like the original and made my lashes look nice and thick. I use coconut oil to remove my eye makeup and it came right off."
      },
      "nparmar":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 May 2016",
         "title":"Disappointed",
         "description":"Bought this because I need a good waterproof mascara for my wedding day - the formula came out way to thick and was super clumpy! I thought I may have a defective bottle before I saw all the other reviews. Even after wiping down the brush the mascara was still too thick and not easy to apply."
      },
      "scraib":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"18 Apr 2016",
         "title":"Let Down",
         "description":"I LOVE the original formula Better Than Sex, and when I heard there was a waterproof version I knew I had to get my hands on it. I had high hopes for this, and it saddens me to say it really let me down. It makes your lashes look clumpy, flakey, and spidery. It dries to a very weird consistency and is just not very nice to look at. I will be returning this next time I get a chance to head to sephora."
      },
      "leslierebecca33":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"4 stars",
         "date":"22 May 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"coconut oil!!"
      },
      "fastnfancy":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"11 May 2016",
         "title":"superwoman staying power",
         "description":"This mascara stay put - no flaking, smudging or smearing. I can swim and this stays put (just don't rub your eyes). It does clump, but I use an eyelash comb to separate. It is thick...so I go light and apply several coats between 15-30 secs of dry time. It needs time to dry, but once it's dry...you look amazing all day. Easily removes with coconut oil. My lashes look long and full...this is my daily go to mascara."
      },
      "demona941":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"7 Jun 2017",
         "title":"Stings",
         "description":"I thought this was going to be a great waterproof version of the original Better Than Sex mascara but it's not. It's gloopy while the original is a little more dry. Plus, this mascara stings my eyes so bad. No matter how many times I try this mascara bothers my eyes every time. My lashes look clumpy. I wouldn't recommend this product."
      },
      "Kanake":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"10 Jan 2017",
         "title":"So disappointed",
         "description":"I've been using this one for over a month now. At first I loved it, but it didn't last long. I find I get raccoon eyes more often than not, which makes me glad I've been wearing this in the winter as opposed to summer because I sweat like crazy. I gave it a chance, but I just don't like having to check myself constantly in a mirror to see how my mascara is doing. I should have returned it at the first sign of trouble. I was really hoping this was my replacement of Fiber Wig, but no such luck.\n…read more"
      },
      "xtina61":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"6 Apr 2016",
         "title":"The real deal",
         "description":"Most waterproof mascaras lengthen but don't thicken. This is amazingly volumizing and lengthening and it lasts all day. It is wet on application so be prepared with the q-tips. Better yet do your eyes first."
      },
      "joliekc23":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"22 Aug 2016",
         "title":"I actually love it...",
         "description":"So I got a deluxe size sample of this mascara for free and I was just going to toss it since I heard/read such terrible things about it but I was going to a theme park and it was 1000 degrees out so I thought I would give it a shot and I'm so glad I did! Im not sure why everyone seems to hate it so much, I honestly love it, it stayed on all day, no smudging or flaking and my lashes looked just as fab as they do when I use the original BTS mascara (except just a little teeny bit less \"fluffy\" I guess would be the word but that's as expected for me from a waterproof formula). Maybe I'm just weird but all I'm saying is don't knock it till you try it because it worked for me! I will definitely be buying a full size when I run out of my mini! I will say though that I probably will not use it as an everyday mascara, I will still use my original BTS on the daily and this one when I know I'll be sweating or something.\n…read more"
      },
      "slyfox8909":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"7 Apr 2016",
         "title":"very messy",
         "description":"I'm not a fan of this particular mascara. Very clumpy and messy! It's annoying when you try to put the wand back in the tube cause the mascara oozes out. Speaking of the wand, it's HUGE & hard to brush through the lashes without getting all over the place."
      },
      "onlyjordanleigh":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"1 May 2016",
         "title":"Lives up to what it claims!",
         "description":"I have never used the original BTS mascara so I have nothing to compare this too. But I want to say that this is one of the best mascaras I've ever used. Not only does it lengthen my eyelashes, but this is actually waterproof. I play in soccer games, take a shower, and this mascara stays put and doesn't smudge at all. It's truly amazing!"
      },
      "SephoraGuru310":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 May 2016",
         "title":"OH MY LANTA",
         "description":"Biiiiiiiiish, this mascara not only makes your eyelashes look amazing but it also lasted through 30 minutes of intercourse, humidity, and 45 minutes of crying. The rest of my makeup was trashed but my lashes looked on point."
      },
      "mattspunkingurl":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"27 Apr 2016",
         "title":"HORRIBLE",
         "description":"This mascara is a horrible disaster. I just received it, tried it on and then boxed it back up to be returned. The brush deposits the gloppy mess mascara all over your eyelid. It's a mess. The formula never sets. It's sticky after about an hour after applying it. There is actually lint stuck in it!!!! If I touch my lashes it smears onto my fingers. The mascara has even smudged on my lower lash line and I didn't even apply it to my lower lashes. My lashes feel sticky and every time I blink I can feel my lashes sticking together. I've never had anything like this happen and I have a lot of different mascaras. This is a major flop.\n…read more"
      },
      "KDWay":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"4 Apr 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Awesome"
      },
      "ShoeDivaGA":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"13 Jun 2016",
         "title":"Wish I could give it 5 stars",
         "description":"I am surprised by the amount of reviews that have stated this is clumpy and smears because I have not had those issues at all. It is not as perfect as the original, but it has not clumped on me and it has not smeared. I have been in the water with it and \"real feel\" 110 degree heat. The rest of me looked like a drowned rat in the water and heat, but the mascara held up! What I do not like it the effort it takes to actually get it off. I have tried Sephora, Lancome, and Make-up Forever removers and none just took it off. I can live with that verses mascara running down my wet or \"glowing\" face.\n…read more"
      },
      "MrsFuradi":{ 
         "extra_info":"<b>Skin Tone</b> Fair",
         "stars":"1 star",
         "date":"11 Aug 2016",
         "title":"Smudge City",
         "description":"I really wanted to like this. I hadn't had a chance to get into Sephora for a bit so I was using drug store mascara. Finally got in and was recommended this by an employee because I requested waterproof. I will say that it does last all day...all day on my lashes, on my eyelids, and on my cheeks. I've never had any mascara that is as soft and smudgy as this is. I will NEVER purchase this again."
      },
      "emilala":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Jun 2017",
         "title":"awesome",
         "description":"oh my goodness...this is definitely a holy grail item for me. i've tried lots of mascaras but i always come back to this one. if you have flat lashes that don't naturally i suggest using a curler before applying the mascara. then i usually apply 2-3 coats waiting about 30 sec between each coat. make sure to use a \"zig zag\" motion when applying. after that i wait about an hour and curl them again. beautiful result! the waterproof always makes my curls stay and stays put even in chlorine water or intense workouts! amazing!<3 highly recommend!;)\n…read more"
      },
      "chrisstine":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Apr 2016",
         "title":"ehh..",
         "description":"when I heard that they were coming out w a waterproof version I was so so so so excited to get my hands on it. when I finally did I opened the tube and it was FULL of mascara!!! I tired it and it made my lashes extremely clumpy and stuck together. I took a makeup wipe and wiped the brush clean and then put it back in the tube and it was the perfect amount. but over 2-3 uses it became like it was in the beginning when I purchased. I wouldn't purchase again tbh..\n…read more"
      },
      "Viviana53":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"24 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Very good for ladies who have trouble having lashes stay curled. I have straight lashes so it’s hard to find a mascara that’ll have my lashes curled for a long period and this does a great job of it"
      },
      "mavium":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"23 Nov 2016",
         "title":"horrible",
         "description":"With all the hype around the BTS mascara I was very enthusiastic about trying out the waterproof version. This stuff clumps like crazy and gets all over the place! The worst part is that it is practically impossible to take off! I had raccoon eyes every single morning when using this product. It does create long, curled lashes with volume, but it's not worth the headache of dealing with the awful formula. I haven't tried the non-waterproof version, but there's no way I'm paying for one to try out.\n…read more"
      },
      "catsaysmeow":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Apr 2017",
         "title":"Perfect for thin lashes, use one coat only",
         "description":"This mascara is super waterproof and holds curls really well. I have very straight, thin but long lashes and this works perfect for me. It is very thickening so if you use more than one coat, it can look spidery real quick. But the one coat is magic for my eyes and makes me look like I have such full lashes. Only downside I can think of is the size of the wand makes it unfriendly for the bottom lashes. I know others have trouble taking it off but I use the Clinique make up removing balm and it takes it off no problem.\n…read more"
      },
      "viaraujo":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jul 2016",
         "title":"Wanted to love",
         "description":"I love the original so I was hoping it'd be basically the same formula bit just water proof. Nope. I absolutely cannot stand this product. -It takes FOREVER to dry. Which is so inconvenient - it's soooo clumpy, there is no separation at all of the lashes - it gave me no volume. It looks as if I had slept with yesterday's mascara on. I really wish this was better."
      },
      "lithay":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Jun 2016",
         "title":"AMAZING MASCARA",
         "description":"This mascara makes your lashes huge!!! I don't think it takes that long to dry like other people say, maybe like 5-7 minutes... And the more you use the better it works... Yes it's a little hard to take off but if you have a waterproof eye make up remover you're good! (That's why they sell specifically waterproof remover- don't expect it to come with regular makeup remover)!!! &&& Definitely doesn't have fall out or leaves streaks under your eyes and lasts all day!! I would re purchase again!❤️\n…read more"
      },
      "hazelgracelyn":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Dec 2016",
         "title":"Love the waterproof, this one doesn't flake off or leave marks under my eyes like the non-waterproof one.",
         "description":""
      },
      "BrendaCdna":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Jul 2016",
         "title":"So disappointed",
         "description":"I purchased this mascara on 7/10/16 with high hopes! Even though it says it's waterproof it is NOT WATERPROOF it didn't even last an hour."
      },
      "sa87":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 May 2016",
         "title":"different kind of waterproof mascara",
         "description":"This mascara stays very true to original formula in terms of keeping lash soft, jet-black and increasing volume. It does take a very long time to dry--10 minutes or so. After that, it stays on perfectly even after a hot shower! It comes off fairly easy with a makeup remove or oil. This is not the kind of mascara you throw on last minute...otherwise, it will smudge and not do what it is supposed to do. I think the negative reviews here reflect that frustration. If you give this mascara time, it really does look beautiful and stay put. I have oily lids and generally oily skin, and I have not had significant smudging issues with this. My favorite aspect about this formula is that its obviously smudge/water proof but also keeps my lashes very soft. I have very sensitive dry eyes and this does not aggravate them.\n…read more"
      },
      "idek000":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"23 Mar 2016",
         "title":"True to the name! 4 stars because it flakes just a tiny bit",
         "description":""
      },
      "Angel628":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Aug 2017",
         "title":"BETTER THAN ALL MASCARA",
         "description":"I use this mascara everyday and I'm in LOVE! So long lasting! Sometimes I'll apply it, forget to wipe off my makeup before I go to bed and, wake up and it's the same. If I run a eyelash brush through it I'm good for the day! THAT'S how long lasting it is! My only problem is it's REALLY messy to apply and I sometimes have to remove some of my eyeshadow to get the splotches. Also, it's defiantly not waterPROOF. More so water resistant. Other than that I love it!\n…read more"
      },
      "tantan":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"30 Apr 2016",
         "title":"meh",
         "description":"Well... I have been using regular too faced mascara for years and I was happy with it until the waterproof formula came out... The bottle is unique and cute but the formula is not comparable with the regular one... Sure it does stick to your lashes for more than 24 hours but it does not give your lashes length nor volume like the regular mascara... it's super hard to wipe it off once you put it on...and I felt like half of the bottle was empty so... I guess it's better to stick to the regular formula... Won't buy again\n…read more"
      },
      "chellznikki08":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"27 Mar 2019",
         "title":"Hot Mess",
         "description":"Waste of money...you're better off getting mascara from the drug store...its clumpy and messy. BEWARE THIS PRODUCT IS A JOKE.....Don't Buy"
      },
      "Allison64":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"14 Nov 2016",
         "title":"Durable but clumpy",
         "description":"This product is very hard to apply clump free, but brushing your lashes out with a spoolie does the trick. The formula is incredibly waterproof. I was impressed to see it after days in the pool, on the lake, or sad movies. Overall it took more effort to get a smooth look but I would say it was worth it."
      },
      "c1091":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"22 Apr 2016",
         "title":"Never dries",
         "description":"After two coats, my lashes looked amazing, but an HOUR later I closed my eyes tightly and got mascara above and below my eyes. I re-applied and waited several more hours before testing my lashes and they still felt tacky and they stuck to each other as well as my face. Also, it's really difficult to get this mascara off. A simple eye-makeup removing wipe won't do it. I will be returning this mascara today.\n…read more"
      },
      "lshadia":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"17 Feb 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"i hate the applicator, but the formula is honestly amazing."
      },
      "jcl29":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"13 Oct 2016",
         "title":"Wanted so bad to like it...",
         "description":"I'm an avid user of the BTS mascara so I was ecstatic when the waterproof version came out. The applicator was different, and the formula was (obviously) different. It seemed thick and gloopy (for a lack of better descriptors) and gave me clumpy eye lashes. It didn't give me nearly the same volume effect as the regular version, with and without a primer. I wanted to love it so bad, but I exchanged it for the regular one instead. So disappointed. 2 stars for the fact that it's at least waterproof.\n…read more"
      },
      "ladysaphir":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"22 Apr 2016",
         "title":"Sadly disappointing",
         "description":"The first time I used the mascara, I actually liked it. I didn't understand why the reviews were so negative; it didn't clump, brushed well, and although the feel was different from better than sex original, it felt like a good mascara (though not exceptional). But the second time I used it, I saw what everyone meant. Big chunk of product on the brush, sticking lashes together, messy, clumpy... I thankfully had a side lash brush that I used to try to even out, but it was a significant different experience from the first use. The third experience was similar to the second use. And there won't be a forth or more... I wanted to love this mascara. The outside appearance is just so perfect, and the original formula is just so nice that the expectation was high. And the disappointment was even greater. Too Faced needs to revise the formula. I still want to love this product, but they'll need to do, as the title say, better than sex; and this is far from even getting close.\n…read more"
      },
      "sssshelbyyyy":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"3 Nov 2016",
         "title":"Great Mascara",
         "description":"I really like this mascara, however I don't think it's super waterproof. My holy grail waterproof mascara is the Covergirl Lash Blast in the orange tube, now THAT mascara is waterproof and doesn't budge. However, I love the volume and length that this mascara gives me.. A lot of reviews say that it's a clumpy mascara and that is very true.. I've found that the best way to apply this mascara is to run the wand on the top of the opening to scrape the excess product off the wand before actually applying it and then it will go on perfect and won't be clumpy! & Yes, it can take a little extra effort to take off at the end of the day, but keep in mind it's waterproof, so it's going to take a little extra time. If you want it to be easy to take off at the end of the day, I recommend the original Better than Sex mascara, that is a great mascara too!\n…read more"
      },
      "xxPinkCactixx":{ 
         "extra_info":"<b>Skin Tone</b> Light",
         "stars":"3 stars",
         "date":"27 Nov 2016",
         "title":"Travel Size &gt; Full Size",
         "description":"I got the travel size first, and it worked AMAZINGLY! The 3 stars are for that only. I have very short, thin lashes with hooded eyes and it worked very well. It stayed curled, and applied mostly without any clumps (I used a clean mascara wand to brush out some of the thicker parts.) HOWEVER, after buying the full size, I was utterly disappointed. the shape of the wand was the same, but after I pulled out the wand, there was way too much product on there. Even after a few uses, there still was a huge, gooey mess on the base of the wand, except for the tip. I tried to put the wand back into the tube to get some off, but the clump was too big for the tube, and product got smeared all over the opening. I mean, I could get rid of excess, but that'd be a huge waste of this mascara. Good shape, cute packaging, nice formula, but there is just SOOO much product that comes out! I will be definitely returning this.\n…read more"
      },
      "hailse123":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Aug 2016",
         "title":"Legit my holy grail mascara!!! I have really weak and small lashes that don't hold a curl but with this mascara they look fuller and longer and keep a curl all day!!!",
         "description":""
      },
      "Jesob":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"15 Apr 2016",
         "title":"Returning",
         "description":"How embarrassing to realize after an event, that my brand new mascara,flaked below my eyes, giving me a raccoon look."
      },
      "megrx":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"5 May 2016",
         "title":"Transfers everywhere",
         "description":"The only waterproof quality this has is the difficulty I had removing it from my skin. It smudged horribly after I made the mistake of touching my face!!! I was left with black marks on my hand and beneath my eye.... This was several hours after applying so it was dry!!! NOT WATERPROOF"
      },
      "Stellatiel":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"28 Nov 2016",
         "title":"I've found my new waterproof mascara",
         "description":"I've been a drugstore make up user for years and have just recently switched to Sephora. I picked out this mascara after watching some reviews on youtube and absolutely loved it. The travel size is awesome because its affordable and you don't have to worry about it drying out as fast. It stays on all day and holds a curl. My lashes are light brown and straight as a board so its impressive to find something that's waterproof and actually will hold a curl all day at work. Sometimes it needs a couple of applications to really smooth out the clumps if you get a few but be patient. A little bit goes a long way. Very happy with this product and sad to see so many negative reviews.\n…read more"
      },
      "samantha2":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"14 Jul 2016",
         "title":"Not so great",
         "description":"Thought I found the perfect mascara but this was no better then all the others I have tried. Wound up with mascara above and below my eyes even after waiting for it to dry. How embarrassing when at work when I checked my makeup and found this mascara above and below my eyes making me look like a raccoon. Don't waste your money like I did. Not worth the embarrassment."
      },
      "TheMaineRoads":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"19 Apr 2016",
         "title":"disappointing",
         "description":"The mascara itself has a very different formula than its original. It doesn't give the same voluminous effect. It's very cakey and takes FOREVER to dry. Once it's on and dry, it's not going anywhere. It is waterproof, but once you get wet the lashes start sticking together. It takes a blow torch to get it off though, my eyes hurt and eyelashes looked terrible when I finally got it all off. I returned this product"
      },
      "Ashomee":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Feb 2017",
         "title":"Eh...",
         "description":"I totally bought into the hype with this stuff and I was so excited to try it, but I'm really disappointed! I'm not sure if I've got a bad tube or what, but I've used this three times and the wand is literally caked in mascara and I'm going to have to try and clean it before I can even use it again. It went on fine the first time I used it, but the next two times it progressively got clumpier, and I cannot stand clumpy mascara. However, I gave it two stars for the sheer staying power. This bad boy right here lasted through a 12 hour workday and (don't drag me for not taking it off) when I woke the next morning it was still right where it had been the night before! No smearing, no flakes, NOTHING. It also lasted through an emotional breakdown in the bathroom at work, and again, my concealer was gone and my eyeshadow was a loss, but my mascara was still going strong. It also takes an act of Congress and a small miracle to get it off in the evenings, even with eye makeup remover. Overall, 17 out of 5 for longevity, but 2 out of 5 for the strange formula. I'm not gonna repurchase, but hey, if you like that thicker, clumpy look, go for it.\n…read more"
      },
      "BoaQu":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"16 Apr 2016",
         "title":"how come this is waterproof",
         "description":"It smudges all over my under eye area. I see small black flakes on my nose and face. I don't why this is claim to be waterproof."
      },
      "marintaylor":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"3 stars",
         "date":"5 Feb 2017",
         "title":"A tough mascara, but worth it",
         "description":"It was very hard to ignore all the amazing reviews and recommendations for this mascara so I finally decided to try it. So far I am not disappointed in the volume, length, and definition that it gives, but I find it very clumpy, flaky, and VERY hard to remove. I wonder if the non-waterproof version of this is easier to work with, so I will probably try that one when I finish up with this tube."
      },
      "Meahgan":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"18 Jun 2019",
         "title":"REALLY don't understand the bad reviews",
         "description":"I am shocked to read all of the bad reviews for this mascara. I applied this evenly and carefully, and my lashes not only do not look clumpy, but it dried very quickly, and my lashes have never looked better. Also, this is one of only TWO mascaras carried at Sephora with a positive EWG rating, so I don't have to worry about the impact this could have on my health. This is my new holy grail!"
      },
      "zdp23":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Apr 2016",
         "title":"NO NO NO",
         "description":"DO NOT BUY DO NOT USE. Someone did my makeup with this today and I almost told her not to because I've heard it makes your lashes fall out. WELL LADIES, IT IS TRUE. I have great lashes, long, curled and black naturally. And this mascara just pulled out a bunch of my lashes. I used my usual makeup remover and realized a bunch of my lashes fell off. I am so upset. I've never had this happen before and I know now the others were right!\n…read more"
      },
      "ewoklynn":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"28 Apr 2016",
         "title":"not too bad",
         "description":"I do like the this mascara as it does hold my curl! So far I haven't had any issues with smudging or flaking. I couldn't give full 5 stars as it is very gloppy when you pull the wand out of the tube and it feels like you are wasting product! But still not too bad!"
      },
      "LiJenn":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Jun 2016",
         "title":"Great Mascara",
         "description":"I love this mascara. It's summer and I sweat merely standing outside on the hottest of days. We had a few of these days already; however, my eyes still looked fantastic. My lashes were full and long all day. I experienced no clumping or flaking in the month-plus I've used this. I'm new to mascara, so I'm still trying new things. But, this will remain in my rotation. Great product!"
      },
      "theamazinjonesy":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Jul 2017",
         "title":"Wouldn't purchase again...",
         "description":"I tried it and noticed that my eyes were burning and itching about an hour later. I hoped it wasn't the mascara. I gave it another shot and my eyes have been itching for days. No thanks!"
      },
      "Jvninx":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"30 Jun 2016",
         "title":"Horrible. Don't waste your money on this.",
         "description":"It is very clumpy and messy to apply. I don't like the brush at all. It transfers to my eyelid or when i try to apply it on my bottom lashes. It was hard to clean it on my face. Don't waste your money on this."
      },
      "courtneyj16":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"15 Apr 2016",
         "title":"really bad",
         "description":"It is super clumpy! I have wiped off huge chunks off the brush. And it is not waterproof at all. I really wanted to like this but i just can't. Its that bad. The only good thing is it look like the regular BTS."
      },
      "rollercow":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Dec 2016",
         "title":"Great for ppl with allergies",
         "description":"As a person with allergy eyes, and the constant watering especially in the corners, my mascara would run and it is an annoying ordeal being a mua and my love for makeup so when too faced had the launch of the chocolate chip palette they had a deal buy any mascara get an item half off, well I bought this, I hadn't tried it heard mostly bad things but it's actually pretty awesome, contrary to what others say about wait time for drying, not me mine dried fine, it curls my lashes more than the regular bts, it's a glossary formula if that makes sense?? It feels comfortable and no mascara run at all, I wish I had bought sooner, I couldn't tell you how many different types of mascara I own, I'm set for a good year or so, but this is way better than ppl are giving credit for, no flaking, no balled up tips on my lashes. Nothing bad happened as reported by others. All good here and if you are a person who suffers from any allergy eyes, or watery eyes this is the mascara for you. I had no trouble removing either, so this gets my 5 star approval for being a great quality product. I dunno if they tweaked the formula After all the bad reviews or I just got a good batch but I love this so much!!\n…read more"
      },
      "loalove":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"9 Apr 2016",
         "title":"Don't waste your money",
         "description":"Let me start off by saying BTS is my favorite Mascara so when they released the waterproof I ordered it right away. I tried to make it work but this formula is awful! It's so clumpy and it takes so long to dry that it gets everywhere. I'll just go back to what I was doing by using the orginal BTS Mascara and Anastasia waterproof clear mascara over it."
      },
      "sarakjp":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"28 Jan 2017",
         "title":"A toned down version of the original...",
         "description":"I LOVE Better Than Sex the original formula. It has been my go-to for dramatic looks for years. I don't even care that it flakes. When the waterproof version came out I was so excited. While it is still volumizing and reminiscent of the original, it just isn't as dramatic. It still ran and flaked, but was just stickier and more difficult to ultimately remove."
      },
      "cyndee307":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"31 Mar 2017",
         "title":"Not even water resistant",
         "description":"I love the original one so I tried their waterproof one. It smudges very easily. It isn't waterproof - not even water resistant. Do not recommend this one"
      },
      "Anna0410":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"20 Apr 2016",
         "title":"Disappointed!",
         "description":"I really wanted to love this mascara, I read a lot great reviews for the regular Better than Sex mascara, and I was SUPER EXCITED to try out the waterproof version of it! Sad to say it wasn't for me! I'm a waterproof mascara junky! I'm always looking for the next best waterproof, long wearing, smudge proof and very important... FAST DRYING mascara (so it sets my lashes after I curl them)!!! It took more than 6hrs for the mascara to start drying (a bit) I had to constantly clean the smudging around my eyes! It did however hold my curl up for about 4hrs. But not worth the constant cleaning of the mascara smudges! So I returned it back to Sephora and got my money back.\n…read more"
      },
      "erinmn":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"28 Apr 2016",
         "title":"wet &amp; clumpy",
         "description":"I need to use waterproof to hold my curl with my lash curler, this did do that. But I found the wand to be too big, and too much product comes out onto the wand so I'm constantly scraping it off, it's clumpy on my lashes and doesn't dry fast enough. I spend too much time blending eye shadows for my mascara to ruin everything! No thanks. Love all other Too Faced products though!"
      },
      "LeslieduM":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"6 May 2016",
         "title":"Yikes. Clumpy and runny city!",
         "description":"This mascara. I SO wanted it to work. Really. Unfortunately straight out of the tube it was clumpy as all get out. Like serious clumps. I used my lash brush to help get most of the larger pieces of it out, but overall I still had tarantula eyes. I wore it out of the house to go shopping even with the Tammy Faye look and found that it ran. Smudgy in 2 hours. I found that everytime I went to the restroom or saw myself in a mirror I had to swipe under my eyes. This just did not work for me. At all. Yup, it is going back and I'm going to see what else the ladies at Sephora recommend. This was an epic fail. I really wish that Too Faced could have matched the consistency of the original BTS mascara. Sadly they did not.\n…read more"
      },
      "Sealycross":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"2 Jul 2016",
         "title":"Could be good, but overall, disappointing",
         "description":"I really wanted to like this mascara; I love the original, and I was so excited when they came out with waterproof. Sadly, it was a pretty big disappointment. First off, the product takes the longest time to dry. The first time I wore it, I put it on and almost an hour later, I sneezed and looked like Twiggy from the product transfer. Secondly, it is very clumpy. The original formula is a little bit so, it's what makes it so luscious, but the waterproof one is a lot more. It's not the best for layering (because it doesn't dry) so if you want to apply more than one coat, you're going to have a bad time. And finally, I had a really big issue with flaking. I've had flakes on my cheeks, flakes in my eyes, I've even found flakes in my cleavage at the end of the night. I tried the product with primer and without primer, and it didn't really make a difference in the performance of the product. I will 100% not purchase this again. However, on the once in a blue moon night that I get it just right, and all of the stars are aligned, this mascara looks incredible, and nothing goes wrong. I just wish I could bottle that and use it every time. Oh well.\n…read more"
      },
      "livreyy":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"27 Apr 2016",
         "title":"Not like the original",
         "description":"The only good thing, about this mascara is that it's truly waterproof and the packaging is nice with the droplet details on the tube. But I prefer the original over this one. This one seems clumpier."
      },
      "mattejac":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"25 Mar 2019",
         "title":"Not as good as the original",
         "description":"DEFINITELY not as good as the original. The waterproof formula is thick, sticky, dries out super fast, and all around isn’t the same caliber. When I wear the original Better Than Sex it’s a guarantee someone will ask if I’m wearing falsies or lash extensions. I don’t even get close to that look with the waterproof."
      },
      "Anniebabiee":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"23 Apr 2016",
         "title":"It is okay",
         "description":"This is nothing like the original. I am really disappointed in this. The amount of clumping on the brush is ridiculous. You can barely apply it because there is so much product on the brush when you apply it leaves your eyelashes clumpy and gross. I guess its waterproof though. Stays on for a long time. But definitely not worth it. Go for a different water proof brand."
      },
      "sillylily13":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"28 Jun 2016",
         "title":"Best Mascara EVER!!!",
         "description":"This is the BEST MASCARA I HAVE EVER USED! I was already in love with the original Better Than Sex mascara, but this one blew it out of the park! Not only is it lengthening and volumizing, but also it keeps the curl on my lashes. I love it!"
      },
      "Shannonwolfy":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"1 Jul 2016",
         "title":"it's good but with cons",
         "description":"The pros are that it is waterproof and does add volume and length and the end result is awesome. My problem is that when applying it, it is very messy and clumpy, and it takes a while to dry. Again it's not bad and I would still re purchase it. If your not steady at applying mascara then I wouldn't try."
      },
      "emsroeder":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"12 Sep 2016",
         "title":"Disappointing",
         "description":"I tried the non waterproof version and really liked it and thought that the waterproof version could only be an improvement. Sadly, not so. The mascara is heavy and smudges super easily, so if you blink you'll find it streaked around your eyelids. The brush also always seems too heavily coated with product. I also find it splatters really easily. My morning routine isn't extensive because I'm usually in a rush, so spending extra time correcting my smudged mascara is inconvenient. The hunt continues for a superb waterproof mascara...\n…read more"
      },
      "mackslabe":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"20 Apr 2016",
         "title":"So disappointed!",
         "description":"I have been absolutely obsessed with Better Than Sex Mascara for 2 years now - I won't use any other kind! So when I found out there was a waterproof version, I was super stoked. Unfortunately, I did not find the waterproof formula to be anything like the original. It does not lengthen or volumize my lashes at all. Instead, it makes them very clumpy, spikey, and sticky - not exactly adjectives I would like to use to describe my lashes. The waterproof formula stays soft all day, and if you accidentally touch your lashes, black residue will come off and smear. I will continue to be a lifelong user of the original formula, but the waterproof one was a huge disappointment :(\n…read more"
      },
      "chubbymakeup":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Jul 2016",
         "title":"very disappointed",
         "description":"I bought it when it first came out, and i got home, i opened it up, excited to try it out, and the brush was literally bent and warped beyond possibility of use! The closest store replaced it without question but the woman behind the counter said a few people had experienced the same issue. Soo big problem there. My replacement product wasnt warped, but really? The product makes my eyelashes look like spider legs, not the gorgeous fans they usually look like. And it doesn't dry. It ends up all over my eyelide and brow. And while its not exactly waterproof, makeup remover, soap, and scrubbing will not get it off! Just really not impressed but hopefully they will improve the formula\n…read more"
      },
      "prettyLMills":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"2 stars",
         "date":"26 Apr 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Contact Lense Wearers BEWARE"
      },
      "rowboat14":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"15 May 2016",
         "title":"Awful.. nothing like the original",
         "description":"The first time opening up the mascara alone I knew this was going to be bad! the wand was all deformed because the mascara was so clumpy! It went on clumpy, it looks clumpy. Nothing like the original which I loved so much. I'm only giving this two stars because of how freaking water proof it is!"
      },
      "LadyKira":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"24 Apr 2016",
         "title":"I had so much hope",
         "description":"I LOVE the original formula and was so excited when they came out with the waterproof version! No more flakes and I can wear it to the pool! WRONG! This mascara made by lashes stiff and stick straight out, no curling action whatsoever. The formula was sticky and clumpy, and you lost so much mascara when putting the wand back into the tube. I'm so sad. Too faced, please fix this!!"
      },
      "MMoore66":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"28 Feb 2017",
         "title":"nope",
         "description":"Flakes, clumps and smudges. Need waterproof? This is not it. I bought it because of the \"good\" reviews."
      },
      "Rach180":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"1 May 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Sephora employee suggestion gone wrong"
      },
      "anenasheff":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"11 Apr 2016",
         "title":"Broke my lashes",
         "description":"I use waterproof mascara on a daily basis, and my lashes have remained healthy and have been growing. But as soon as I used this mascara my lashes broke. They were much shorter. This mascara smudged a little but that was not a major problem. My lashes also did not look like anything special compared to other mascara I use. For the price not worth it."
      },
      "humanequation":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"20 Aug 2016",
         "title":"The original formula is MUCH better",
         "description":"I love the original Better Than Sex mascara, so when I heard a waterproof version was coming out, I jumped on it! The formula for the waterproof version is... disappointing. It clumps a lot, and it takes a really long time to dry. You have to be careful about blinking too hard, and it feels heavy on your lashes. One time, half an hour after putting mascara on, I sneezed and mascara got all over my undereye area. I've also noticed that the lid doesn't tighten all the way after a while. My mascara is now dried out because I can't close the lid all the way. Gives me an excuse to go buy something different now, I guess.\n…read more"
      },
      "chaelalou":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"10 May 2016",
         "title":"I bought this impulsively because I've heard good things about the original one, so when I saw it's waterproof I thought well this must be amazing. I got home and read the reviews and was disappointed to see people weren't loving it. I gave it a chance anyway and used it. It took about an hour for it to dry. My lashes did look longer and curled really nicely. It separated my lashes, which some people might like, but it only looked like I had spider legs for lashes. I prefer them to be more clumpy and thick. These were clumpy the first time I applied but the more I add layers, the lashes separated. Again, some people are into that but I just didn't like how it looked on me. Honestly, drugstore mascaras work better and are half the price. I returned this immediately.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "blackitty":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"15 Dec 2016",
         "title":"Holds a curl, volumizing",
         "description":"I find that only waterproof formulas work for holding a curl on my straight Asian lashes. I did not have any expectations from this mascara, but I was not disappointed. It holds a curl really well, defines, it's volumizing, and lasts all day. I didn't notice it smudge or flake. However the formula itself and tube allows for major clumping. You can wipe the brush on a tissue to get the excess off, but that's wasteful. I wish that they'd make the tube so that it really squeezes the mascara out before you pull out the wand.\n…read more"
      },
      "BrunaS":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"20 Mar 2017",
         "title":"Disappointed",
         "description":"I'm a huge fan of the regular Better Than Sex mascara, so when I discovered the waterproof version I thought I was set on the perfect mascaras! Unfortunately, the waterproof version isn't what I expected. It is hard to put on, the lashes get bunched up in it's thick formula. And even harder to remove! It smudges all over the skin when you try to remove it and you basically have to scrub hard for it to come off completely. And even so, some of it stays on the lashes, turning them hard and dificult to work on. I do not recommend it like I recommend the regular Better Than Sex mascara.\n…read more"
      },
      "Krizty1987":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"20 Apr 2017",
         "title":"This mascara slays my life!",
         "description":"This is literally the best mascara I have ever used in my life. I love how it is vegan and cruelty free. I have blonde eyelashes and it makes them sooooo long they look like falsies. For everyone complaining about it being difficult to remove, try using coconut oil."
      },
      "Tosha72":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Jan 2017",
         "title":"Original better than sex is way better. This one is clumpy and it's hard to get the mascara off. I won't ever purchase this again. Going back to the original better than sex.",
         "description":""
      },
      "KatToronto":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Feb 2017",
         "title":"love it",
         "description":"I absolutely love this mascara. I would wear it everyday if it was easier to remove. I use the Sephora waterproof makeup remover but takes quite a bit of times and Bothers my contacts. Plus forget about trying to get it off your face towels. But worth it for those days you require waterproof. The non waterproof come off very easily. Gives you ridiculous long lashes. I have to agree with other reviews that my first one clumped up after two months, which was annoying.\n…read more"
      },
      "AshleighYvonne":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Jun 2017",
         "title":"I give it two stars because it definitely means waterproof.. but the formula is not nearly as buildable as the original non waterproof. It quickly got too clumpy and made my lashes look gross, like I had worn the same eye makeup for days. I'd stick to the pink tube.",
         "description":""
      },
      "StephanieV95":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"20 Oct 2016",
         "title":"I love this mascara, not sure how others can say otherwise i see so much added length to my eyelashes and it stays put, i get so many compliments. Yes ot does clump a little but if you know how to apply mascara properly its nothing to worry about",
         "description":""
      },
      "dscher":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"4 Jul 2016",
         "title":"the worst!!!",
         "description":"This goopy mess never dried...at all! it got all over my face and I had to scrub my entire face of makeup of to start over because there were black streaks everywhere! Horrible"
      },
      "psychedalek":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Jun 2017",
         "title":"Removing this also removed my eyelashes",
         "description":"I love the shape of the brush, and it applied really nicely. Looked totally lengthened, volumized, and fanned-out, like falsies (if a bit spidery without a second/third coat). Some people are saying it smudged or flaked on them, but I didn't have that issue. It looked great all day... until bedtime. When it came time for bed, this mascara was so difficult to remove that I ended up having to scrub my lashes with very hot water and a rough washcloth to get it off my face. Micellar water wouldn't remove it, eye-makeup remover wouldn't remove it, even foaming facial cleanser wouldn't fully remove it. I had to use hot water, cleanser, and a harsh washcloth to finally get it off. This also happened to remove about 1/4 of my eyelashes. I'm honestly terrified to try it a second time. Additionally, I didn't really find the difficulty of removal (due to the waterproof nature) to be warranted, considering that -- while it *was* definitely waterproof -- as soon as droplets of water touched my eyes my formerly beautiful, fanned-out eyelashes turned into three or four big clumps. They were like the eyelashes on a cartoon animal. I think TF needs to make this mascara a little bit less long-lasting.\n…read more"
      },
      "erinblake":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"7 Nov 2016",
         "title":"CLUMPING",
         "description":"I was a fan of the original Better Than Sex mascara, and was ecstatic when they came out with a waterproof version and bought it immediately. So far all it's done is clumped my eyelashes, flaked into my eyes, and is difficult to get off. It rips out my eyelashes when I try to take my makeup off. It stays very well, but you don't really want it to."
      },
      "asinate":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"10 May 2016",
         "title":"Clumpy",
         "description":"Clumped nine days after purchase. Lengthening not volumizing. Only proven pro was it's water proof capability. ONE WORD: DISAPPOINTED."
      },
      "Melissa1031":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"2 Sep 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"My absolute favorite mascara hands down! I get so many compliments and people asking me whether my lashes are real or fake because they are so long and gorgeous. I honestly can't see myself using anything else!"
      },
      "danielled21":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Apr 2016",
         "title":"just horrible",
         "description":"I really wanted to love this mascara since I already love the original too faced better than sex mascara. But as soon as I opened the packaging and the tube I knew it was bad. The formula was way too thick and clumpy on the wand. After cleaning off most of the mascara off the wand I gave it a shot and was just even more disappointed and looked like a raccoon after. The formula was wet and clumpy going on and literally flaked and smeared right off. I'm just highly disappointed after I was really hoping to love this.\n…read more"
      },
      "MissOli":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"30 Apr 2016",
         "title":"Wet, Gooey, Awful",
         "description":"This mascara doesn't dry quickly at all. Almost two hours after applying, it was still wet and gooey, and I only used one light coat. Mascara got all under my eyes, and on my lids from blinking. I'm terribly disappointed in this. It doesn't even curl, as most waterproof mascaras do. Going to return for a refund"
      },
      "sara303":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"20 Aug 2016",
         "title":"new favorite high end mascara",
         "description":"tbh i was super hesitant to try this mascara, but i absolutely loved the original and wanted something waterproof to last throughout the day. the reviews threw me off, but i caved and bought the mini size. and i really haven't experienced anything that the critical reviews have mentioned! it is a wonderful mascara! i will admit, it does not dry quickly by any means, so you need to be careful after you've just applied it (don't blink too hard, don't spray any facial mists just yet, etc.) but it gives me so much length and stays on my lashes all day!\n…read more"
      },
      "Ash8015":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Apr 2016",
         "title":"Disappointment",
         "description":"I was very excited for this product to come out I love the regular Better Than Sex mascara! BUT this one NEVER dried! My lashes just kept sticking to one another as the day went on since it never fully dried. I wore it for two days in a row and by the end of the second day my lashes were so clumped together it looked like I had 3 eyelashes! I am really considering returning it! I also had a very hard time trying to actually remove it at the end of the day. I tried make up remover and soap and nothing! I am going to stick with the original its the best! This one was a disappointment.\n…read more"
      },
      "anon1755":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Nov 2016",
         "title":"I loooovee this mascara so much! It lasts all day and makes my lashes look amazing! The only problem is that I have a hard time getting it off, but other than that it's great!",
         "description":""
      },
      "Vada10":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Jun 2016",
         "title":"amazing",
         "description":"Wow, this mascara is great. So so waterproof, like it does not come off unless you really want it to come off. Which is the only negative that it can be difficult to remove. But other than that it is amazing. I don't find that it clumps more than any other mascara, and the clumps can be easily fixed with an eyelash comb. I wasn't a huge fan of the original BTS mascara but really love the waterproof version. My biggest problem with mascaras is that they smudge on my skin below my eyes throughout the day but that isn't an issue with this mascara.\n…read more"
      },
      "igrx16":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"16 Apr 2016",
         "title":"awful",
         "description":"This is my first review and honestly this is so bad I had to do it. The brush holds so much product it's practically impossible to apply without getting spider lashes. They just clump and look awful. And boy does this thing flakes, from the moment you apply it until you take it off. It just flakes and flakes and you have raccoon eyes all day long. Please stay away from this mascara. This isn't even close to waterproof"
      },
      "KatieyMC":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"10 Apr 2016",
         "title":"I've been looking for a waterproof mascara with a deep black pigmentation that lasts all day and I thought I found it when I first tried this. I loved as soon as i put it on but it takes forever to dry, I don't have 30 min in the morning to wait for my mascara to dry to make sure it doesn't smudge. I tried putting a waterproofing top coat on too which speeds up the process a little but I don't know if I'll repurchase.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "Samswife2010":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"27 Apr 2016",
         "title":"SO DISAPPOINTED",
         "description":"Bought this because I LOVE the original Better Than Sex but this one made such a mess on my lids and under my eye and it never seemed to dry. Will be returning!"
      },
      "anokoking":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Aug 2017",
         "title":"Favorite mascara of all time!",
         "description":"I've tried out a lot of mascaras in the past year, from drug store to high end I've probably tried about 15 different mascaras by now. This mascara stands out on top for me. First off I'm Chinese and so I have very stubbornly straight, sparse lashes. I wasn't blessed with the gorgeous thick lashes so many of my western friends were so blessed with. Thus, I have very little problem with clumping as there isn't much to clump in the first place. Aside from the amazing volume and length this mascara gives me, what I really love about it is that it holds a curl all day. Only waterproof mascaras will hold a curl for me, and even then maybe only half of them will get the job done. This mascara is just the perfect combination of volume, length, and curl for me. My holy grail. I don't usually give reviews but I love this mascaras so much I just had to.\n…read more"
      },
      "RayPalm":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"20 Apr 2016",
         "title":"Messy",
         "description":"I had high hopes for this mascara. I think I tried the original years ago and didn't like it because it ran down my face. So I knew I wanted to try this when it came out. I love the packaging, it is super cute. The tube doesn't seem to have any suction to remove product so way too much comes out and you have to scrape it all off before applying. It is also a very wet formula so it gets all over the place. If the brush was smaller I think it would be a lot easier to keep application mess free. I like a little clumpiness in my mascara but this one is over the top. I gave it 2 stars because so far it is staying in place.\n…read more"
      },
      "Rachelrae05":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"13 Jul 2016",
         "title":"Okay Mascara",
         "description":"I received a sample size of this mascara in my ipsy bag. I liked it and bought a full size. I read some reviews before purchasing and saw where people reported a lot of product when you first open it. That is beyond true. When I opened it at first I had to scrape the sides to lessen the amount of product picked up. It's also very watery. I have used this mascara almost every day and I haven't noticed that it transferred. It is harder to get off than other waterproof mascara a that I have but it hasn't been too much of an issue. Overall, I think this is a good mascara.\n…read more"
      },
      "nikky":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"7 Jun 2016",
         "title":"Nah, sex IS better than this!",
         "description":"Clumpy, messy, hard to control application with the large brush, did not hold a curl."
      },
      "Jayla73":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Jun 2017",
         "title":"BEST mascara ever",
         "description":"I've finally found a mascara that actually looks natural and doesn't smudge all over, even after a 12hr shift. my needs seem to be a lot different than others it seems from the reviews here - of which I was completely shocked! this is what i wanted and got; beautifully smooth and lengthened lashes, long lasting and looked natural at work (I'm a nurse). LOVE the shape of the brush - think its the magic of natural looking lashes. So this is a fabulous day mascara that then can be added onto and curled for nighttime fun!\n…read more"
      },
      "TidalSiren":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"14 May 2016",
         "title":"Its okay",
         "description":"Clumps a little bit and the brush is huge. I went swimming and I swam underwater and it was still on. The only problem is that it is so hard to take it off. You can't remove it with makeup wipes, or even taking a shower. I wouldn't recommend for a everyday use unless you're swimming."
      },
      "aisxlyne":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"26 Apr 2016",
         "title":"This mascara will not budge! I'm working 10 hours shifts and it does not leave me looking like a raccoon. I'm watching greys anatomy and bawling my eyes out and it WILL STILL BE ON AND NOT EVEN SMUDGED. I love this formula better than the original!",
         "description":""
      },
      "horribe":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"8 Apr 2016",
         "title":"HUGE disappointment",
         "description":"The BTS original formula is my all-time favorite mascara, so I was really excited when I saw they came out with a waterproof version. Since Texas is humid, I am a huge fan of waterproof mascaras! When I tried the BTS waterproof mascara though, I was extremely disappointed. I could NOT build up the volume with this mascara. No matter how hard I tried, I just could not achieve the volume and length that the original formula has. Second, this mascara does not dry!!! It smudged all over, causing my eye shadow to become messed up. I waited a long time for it to dry too...a good 20-30 minutes while I did the rest of my face! Because it didn't dry all the way, it also got onto my contacts at one point, causing me to have to throw them away. I decided to continue to wear the mascara throughout the day, just to see what would happen, and I dealt with a clumpy, smudgy mess. Super disappointed and I'll be returning this product ASAP!\n…read more"
      },
      "meghanmac16":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"4 Oct 2016",
         "title":"Overall a pretty good mascara! I have long straight lashes, and it gave me a lot of volume! I was hoping it would help curl my lashes, but it holds a decent curl as long as I use an eye lash curler. Doesn't smudge easily. Coconut oil will easily remove it.",
         "description":""
      },
      "neezapeeza":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Oct 2016",
         "title":"Holy Grail!!!",
         "description":"Seems like this product is either a complete hit or miss for most people. For me it's my holy grail mascara. I usually warm it up in my hands before applying for even smoother application. I get compliments every time I use this mascara. If I want to go for a more dramatic look, I'll do 2 layers of this mascara and people actually ask me if I'm wearing falsies! I love this mascara, love the blush, loveeee the waterproof formula. I have no issues removing it either, I use either coconut oil or a waterproof eyemakeup remover. Best mascara out there.\n…read more"
      },
      "didisparkles":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"12 Mar 2017",
         "title":"Awesome",
         "description":"After having this mascara all day long and sleeping all night, it still looked amazing in the morning!"
      },
      "katyinok":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Apr 2016",
         "title":"FINALLY!!!!!",
         "description":"I cannot even put in to words how much I love this mascara. I have tried literally every high end mascara on the market (not an exaggeration) and have found maybe one or two that are half way decent, until now. I absolutely despise the original BTS mascara because it is thick and gloopy but this formula is 100% superior. I hope to the heavens that Too Faced keeps this around because it is perfection! It volumizes without getting clumpy and dries fast enough that it doesn't uncurl my super straight lashes. This wins the mascara gold for me!!!\n…read more"
      },
      "HCoufal":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"14 Dec 2016",
         "title":"nope",
         "description":"Highly disappointed. Makes lashes clumpy and not easy to apply as the wand gets clumpy as well. Oh, and sex is way better than this product."
      },
      "MsLauraSanders":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Jul 2016",
         "title":"Looooove",
         "description":"I was a fan of the regular Better Than Sex, but this one takes care of the flaking and clumping problems it had. I am addicted to this product!"
      },
      "kailamaegomez":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"17 Jul 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"MY FAVORITE MASCARA EVER"
      },
      "pz068":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Mar 2017",
         "title":"Amazing mascara on my stubborn lashes",
         "description":"If you are someone like me that has straight eyelashes, you know regular non-waterproof mascaras weigh eyelashes down. If you curl your eyelashes and look down while applying this mascara, the results are amazing. My curl stays, my lashes look longer, and fuller. I suggest this mascara for women who have straight eyelashes. Any natural oils such as coconut oil and baby oil are perfect waterproof makeup removers. Especially baby oil. So don't spend $17 on a small tube of melt off from too faced and instead get baby oil.\n…read more"
      },
      "kimbie95":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"17 Aug 2016",
         "title":"pretty good",
         "description":"It's a little on the clumpy side if you have a full sized tube (due to more space for oxygen to be trapped in) versus the mini beauty on the fly size. It was what I would have expected better than sex to be if it were water proof. I have crazy watery eyes and this stuff won't budge! Definitely appreciate the staying power!"
      },
      "Jayt04":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"18 Oct 2016",
         "title":"Favorite Mascara",
         "description":"Love it, it made me want to get the full size original formula too. It makes my eyelashes look sooo good that I was able to stop feeling the need to wear falsies all the time. My only issue is that it can flake out a bit on my under eye area. Other than that, I love it. Doesn't clump up, stays on all day until I'm ready to take it off, and it makes my eyelashes look gorgeous."
      },
      "kayguitar":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jun 2016",
         "title":"clumpy!!",
         "description":"This was the clumpiest mascara I've ever tried in my entire life..I had to return it. It was so clumpy that the brush on the wand itself was deformed .. I think the best mascara is the Benefit Roller Lash!!"
      },
      "Tinkerer":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"17 Apr 2016",
         "title":"Stick with the original",
         "description":"I normally don't like writing negative reviews but I'm hoping this will help people with future purchases. :) Despite being a huge fan of the original, this new \"waterproof\" formula definitely disappointed. I would wear it all day long but by the time I'd come home from work, the mascara would be all over my eyes - sadly, I looked like a raccoon! (As a side bar: I was also out in the rain - ran from my house to my car (less than 5 meters) and the mascara was running down my face.) I'm not sure if this was a formula issue with the batch that I purchased from but I won't be repurchasing. Hopefully someone else has some better luck. I did a video review of the mascara on my YouTube channel (you can fast forward to the end if you're interested).\n…read more"
      },
      "leahashley345":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"1 Jun 2016",
         "title":"love it!",
         "description":"I have seen lots of bad reviews on this mascara but I honestly love it. It gives my eyelashes great length and volume. I know people say it smudges but you just have to give 20 seconds to dry. It also is very waterproof, and stays on all day! Very happy with my purchase!"
      },
      "Jachele":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"21 Dec 2018",
         "title":"Do recommend to maintain curl",
         "description":"I love this product. Holds the curl position of my lashes all day. Friends have complimented the fullness of my lashes when I use this. Con is that it does clump but I feel the end result is worth the effort of spending the time to remove the clumps."
      },
      "daisyyyyyyyy":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"21 Apr 2016",
         "title":"horrible!",
         "description":"I am a diehard fan of the original BTS mascara but this was a huge fail. It was much more liquidy when applying, clumping it. I had this on all day and it never completely dries. Rubbed my eyes right before removing and they stuck together in a huge clunky mess. I didn't listen to the reviews and I tried it, biggest mistake ever. Returning this over the weekend. I would not recommend this to anyone."
      },
      "BeautyDreamer12":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Apr 2016",
         "title":"terrible",
         "description":"I love the original Better than sex but this one is a big no. My lashes worst nightmare ! Good thing i didn't purchase it.. Got it as a gift."
      },
      "ridingforlife":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 May 2016",
         "title":"I'm a fan of the Original and I love this one even more. I don't know if it's just mine but the applicator is a bit weird (shape seems a bit off?) but it's still usable. I find it slightly is a little more clumpy but if you're patient with it, it'll comb out. My favourite part is that this holds a curl!! The Original doesn't hold a curl for me (and this is my first waterproof mascara, never had an issue holding curl with other mascaras), but this does hold it all day. I can feel my lashes touch my brow bone when looking up haha.\n\nThis doesn't flake or smudge etc. on me, and I don't find the dry time any longer than other mascaras.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "tcoop8":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"15 Jan 2017",
         "title":"good product",
         "description":"I tried the regular Better Than Sex mascara and it gave me great volume, but it transferred and smudged on my eyelids/brow line which is my biggest issue with mascara. I try to avoid waterproof mascara because it's just a pain to get off. I got the small version just to try this product out and I don’t have any complaints. It looks almost the exact same as the regular mascara. The only thing is it's harder to get off, but I can deal with that.\n…read more"
      },
      "Chowmut":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Dec 2016",
         "title":"AWESOME FOR ASIAN LASHES",
         "description":"Ok so i have stick straight short lashes and thereby have to curl them and use a waterproof one to keep that curl. I've tried the covergirl one, which I thought was the holy grail and this one is 100x better. I don't understand the negative reviews. The formula goes on smooth, I don't get clumpy lashes, the curl holds and i get so much length. If i want more length, i just do a couple swipes with the 3d fibers. Awesome mascara, just wish they had more travel sized waterproof formulas. Also why is waterproof mascara so rare? Removal, put make up remover on two cotton pads, let it sit on your lashes for a minute, then wipe.\n…read more"
      },
      "Aleslie85":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 Apr 2016",
         "title":"Such a disappointment",
         "description":"I waited for ages to try this mascara (haven't tried the original as I ONLY use waterproof) I am so so so disappointed. Firstly, the \"hourglass\" is so clumped with product it looks there are no bristles and then the product itself is a MESS. It smudged all over my eyes and like many other reviewers have mentioned, it doesn't dry down! It is so sticky. Terrible! It's being returned today"
      },
      "morganep96":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Sep 2016",
         "title":"great volume!",
         "description":"Not sure why this mascara has such bad reviews. Every time I use it, I get asked if I'm wearing fake lashes because they look so long and thick ! It doesn't smudge if you allow it the proper drying time. All waterproof mascaras take a little longer to dry. Stays on all day and night !!"
      },
      "Macerise72":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"25 Feb 2017",
         "title":"Not as good as regular mascara",
         "description":"I normally love the Better than sex mascara but the waterproof one doesn't give the same result. You need to put a lot more on and it sticks my lashes together. I will not buy this again."
      },
      "maggieS100":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"31 Jul 2016",
         "title":"great!!!",
         "description":"I'm a swimmer and I wanted a good mascara that would stay on in the pool if I didn't have time to take off my makeup (which is usually the case). I've been using this for about a month and it still has yet to smear in the pool. It stays on during the day no matter what and I like the consistency. I'd recommend it, the only problem is it's a little hard to get of with my makeup wipes but to me it's worth it!"
      },
      "aalliecat":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"13 Aug 2016",
         "title":"Good volume and length but clumpy and wet",
         "description":"Plus side: this product makes my lashes look so huge they almost look fake. Down side: it takes forever to dry so unless you apply it and make sure your lashes don't touch any part of your skin, you're gonna mess up your eyeshadow. It also clumps really, easily but that could be the wand..."
      },
      "makeuppobsessed":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Apr 2016",
         "title":"do not waste your money!",
         "description":"This has got to be the worse mascara I have ever used! It's was awful. Do not waste your money. I have not tried the original mascara, because usually the only type of mascaras to keep my super straight short lashes curled, is the waterproof kind. But this was horrible. First of all, so clumpy!! I don't mind little clumps that make your eyelashes look thicker, but these clumps were huge and really bad looking. Second the mascara took hours until it dried. I thought it had dried and then went to make a wing liner and all my eyelashes all clumped together to the direction I was going with the eyeliner. Once that happened there was no way to fix it. Seriously, do not purchase. This mascara is a waste of time and money! So disappointed too faced!\n…read more"
      },
      "theblkrabbit":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"16 Aug 2016",
         "title":"Get a lash comb",
         "description":"I would definitely recommend this for those rainy or pool days only. The waterproof formula is a bit harder to handle and lashes will stick. But if you comb them out a little and fluff them it looks just as good as the non waterproof version."
      },
      "caleigh234":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"16 Apr 2016",
         "title":"Awful",
         "description":"I have heard amazing things about this mascara and decided to finally splurge and get it. It is EXTREMELY clumpy, flakes off throughout the day, and the brush collects way too much mascara, making it extremely hard to put on without getting mascara everywhere"
      },
      "Kailsa":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"13 Jun 2017",
         "title":"Not better",
         "description":"I had been saving this for my wedding. I love the Better Than Sex mascara - the pink one, so figured, like most waterproof mascara, this would be almost as good as the original and waterproof. This never dried. I put on my first coat, waited a while (long enough to curl my hair) and it hadn't dried. Luckily I did a test run of makeup, so had time to try this again another day, and ended up sticking with my Roller Lashes for my Big day!.\n…read more"
      },
      "MercyRamos":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"17 Jan 2017",
         "title":"better than the original",
         "description":"i have straight eyelashes, so i have to curl them every time i wear mascara or else they point straight down. when i used the original formula, the curl disappeared almost immediately. the waterproof version on the other hand keeps my curl and makes my lashes look great! a little clumpy sometimes, but i can look past that."
      },
      "noelitAll":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 May 2016",
         "title":"This mascara stayed on through 45 min of shower sex. It's the freakin bomb.com",
         "description":""
      },
      "LinsPins":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"26 May 2017",
         "title":"Annoyed",
         "description":"2 weeks after opening it is terrible and I'm ready to throw it in the trash. Extremely clumpy and gluey, there is no separation between the lashes- it sticks them all together, it also gets all over the top lid and smudges because it takes forever to dry. I could get way better at the drug store for $7. Mad I spent money on this and have used it enough times that I don't feel like I can return it."
      },
      "KMD47":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Jan 2017",
         "title":"Amazing!",
         "description":"It really is waterproof! Wore it on rainy and sweaty days and it has stayed put. Definitely worth the price."
      },
      "Matty808":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"29 Apr 2016",
         "title":"Wanted to Love It...",
         "description":"I LOVE the Better Than Sex Mascara and was excited when this line came out, but I have to admit that I am not impressed. First one I bought was super clumpy and the wand was damaged so I returned it. Second one that I got from a different Sephora was super clumpy and it does not go on smoothly. Big clumps of mascara everywhere. I am not sure if this product is over dried or if I kept getting faulty products, but I think I will stick with the not waterproof one until they fix this issue. I do not feel that it volumizes as well as the original.\n…read more"
      },
      "PaulaRae":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"26 Oct 2016",
         "title":"Disappointing",
         "description":"Definitely not waterproof. By the end of the day, I had transfer on my lids. The original formula never gave me these issues. Will not be repurchasing."
      },
      "RoxFox76":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"12 Dec 2016",
         "title":"Disappointed",
         "description":"I have heard so much about this mascara and was excited to try it, but am very disappointed. It is SUPER clumpy! Not worth the price."
      },
      "narsgirl101":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Nov 2016",
         "title":"this is the best mascara I've ever tried in my life! If you have naturally straight eyelashes then this is the mascara for you!! I holds a curl, it doesn't flake, and is  super pigment! overall great mascara",
         "description":""
      },
      "KLP519":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"26 Oct 2016",
         "title":"Better than most, but not amazing",
         "description":"I bought this for its waterproof abilities. I still found on occasion it does transfer to my upper lids, and below my lower lash line. Not always ...but will. I would also note.... as a person who wears contact lens , multiple coats of this product is ill advised. I found it flaked off into my eyes over the course of the day, making my eyes very uncomfortable. Although I didnt hate this item, the search continues for the BEST waterproof mascara.\n…read more"
      },
      "madisondukes":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"26 Jul 2016",
         "title":"very, VERY waterproof",
         "description":"This is def one of the most waterproof mascaras I've owned. I love love loved it, however....this stuff is literally like GLUE. I used waterproof eye makeup remover and I still had to nearly scrub to get it completely off! If you're looking for super waterproof for any occasion, I would recommend this! But be careful, it can be a little clumpy when applied, and can begin looking like toooo much. It's a great mascara, but I'll more than likely be sticking with the original Better Than Sex mascara\n…read more"
      },
      "BeautyAddict59":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 May 2016",
         "title":"Disappointing",
         "description":"I love the original version so I was super excited that now there is a waterproof version available. It was absolutely awful it didn't dry well, was super clumpy, and smudged terribly. I'm sticking to the original it wears wayyy better than the waterproof version."
      },
      "harleychicksme":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Apr 2016",
         "title":"Don't waste your money!",
         "description":"I bought this mascara twice because I thought that the first tube was defective. Now I know it's just the mascara. It is so thick and clumpy. It transfers like crazy. This formula is nothing like the original better than sex. It does nothing for my lashes. They look weighed down."
      },
      "anniam":{ 
         "extra_info":"<b>Skin Tone</b> Medium",
         "stars":"5 stars",
         "date":"13 Mar 2017",
         "title":"Sets eyelash curl",
         "description":"I always use waterproof mascara, because mascaras with water as the base ingredient always uncurls my lashes. This mascara works great to set the curl and yet is waterproof without over drying my lashes. The hourglass shape of the brush is unique, so it requires slight adjustment in application technique to get precision at the inner eye."
      },
      "youngmomma":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"24 May 2019",
         "title":"my favorite!!",
         "description":"My favorite mascara! My eyes run all of the time, it’s daily! This is the only mascara I have ever tried that is 100% waterproof for me. When you first get this it is wayyy too coated with product, I wipe off the excess product off the brush the first few uses and then it’s perfect. I get a great amount of curl and lift and if you wiggle the brush you get super defined lashes, you have to work with it a bit. It’s not a mascara for low maintenance days!\n…read more"
      },
      "tb78":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Jun 2016",
         "title":"cant believe the low rating!",
         "description":"I absolutely love this stuff! It looks so natural, doesn't budge until you use either your own eye makeup remover or use Too Faced mascara remover - which is also fabulous btw. I alternate between Charlotte Tilbury's Full Fat Lashes, Chanel Intense mascara and this Too Faced waterproof, which is my everyday mascara. It's really perfect for me I live in hot humid super sunny conditions and it never fails me. I don't get why it hasn't got at least 4 stars, at least try to get a sample. I adore a budgeproof dark natural lash.\n…read more"
      },
      "lettyb":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Apr 2016",
         "title":"Disappointing",
         "description":"This mascara smeared under my eyes after just 2 hours of wear. Very disappointed. I love every other Too Faced product I've tried, but this one was a fail."
      },
      "thefraulein":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"20 May 2016",
         "title":"Even better than the original!",
         "description":"I love the original Better Than Sex and the waterproof version has only improved on it! My ONLY complaint about the original is that usually by the end of a long day I get a little flaking under my eyes. None of that with the waterproof version! I think it holds the curl in my eyelashes better too. I haven't had any issues with it being clumpy or taking a long time to dry. I wipe the wand on the edge of the tube a little before I apply it just like I do with any mascara and it goes on easy and doesn't clump on my lashes. I do one coat, wait 30-60 sec while I do my brow or something and then give it one more brush for a little extra volume and color. This mascara has ALWAYS been 'a little goes a long way'. I think people who are having issues with it drying might just be putting too much on too quick. I love the new waterproof formula and I'm super excited to be switching over to this from the original!\n…read more"
      },
      "jillianmrichard":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Mar 2017",
         "title":"Meh..",
         "description":"When I first got it, it was amazing! But after a week or two, it went downhill. It's really flakey, it gives me spider lashes (which in my opinion, I dislike spider lashes) and it gets just really tacky and gross."
      },
      "LLHG":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Jun 2016",
         "title":"Omg amazing",
         "description":"Holy grail mascara! I have short, straight lashes and even after curling them other mascara's just weight them down. I tried the original better than sex mascara and it was cluppy, messy with a lot of fall out and it weighed my lashes down. But after using the better than sex water proof mascara my lashes stay curled for more than 12 hours."
      },
      "hierika":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"25 Apr 2016",
         "title":"I was excited to see that too faced was making a waterproof formula of the better than sex, therefor I was so excited. But boy was I disappointed! This mascara is beyond clumpy. And when I was applying it I had to be extra careful because it transferred to my eyelid extremely easy and this isn't a problem I usually have. The mascara formula takes FOREVER to dry so god forbid if you apply and then jump straight into a pool or start sweating because this will run and smudge like crazy. Definitely not worth your money. I'm hoping that his will get reformulated soon!<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "leahannahaha":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Apr 2016",
         "title":"Awful awful awful!",
         "description":"Stay away from this! So messy and clumpy! Made me look like a little kid playing with makeup. Such a disappointment. :("
      },
      "Rutydorado":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Feb 2017",
         "title":"Awesome",
         "description":"Best waterproof mascara ever!!!! All that I have tried are running under my eyes, with this one I do not have that problem. It is easy to take off with the Take the day off balm of clinique. Just love it!!!"
      },
      "charityperito":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Jan 2017",
         "title":"LOVE IT",
         "description":"I have spent countless of hours and money trying to find a mascara that does not smudge and can last the entire day! I have tried Dior, Charlotte Tilbury, etc... I do have to admit that taking off the mascara require a little bit of more work (depending on your makeup remover) but it is definitely worth it!!"
      },
      "LadyCardona":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Jan 2017",
         "title":"Favorite Mascara",
         "description":"So in love with this product. It spreads the lashes very nice & the waterproof works great. Not disappointed."
      },
      "Juleseeblock":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"20 Aug 2017",
         "title":"AMAZING",
         "description":"This mascara works wonder on my eyelashes, but it is not 100% waterproof as it does smudge a bit if it gets wet but it's reasonable and 100% worth the money!!"
      },
      "MarinaRosalin":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"29 Apr 2016",
         "title":"Whelming and just that",
         "description":"While this mascara can be beautiful when used alone, and not layered with any other mascaras or primers (no curler needed), if you layer it, get prepared for a messy, clumpy result and mascara melting off your face and mixing in with your foundation/concealer. I find that this formula does look beautiful when I apply no more than two coats, but somehow it never fails to get all over my shadow, eyelids, and under-eye when I put on 3 coats. For a \"waterproof, sweat proof, life proof\" mascara, my orange tube of regular lash blast, sure works a lot better. For what it's worth though, I've found that very few higher end waterproof mascaras work for my half-asian eyes, and I'm always left with the dreaded racoon print on my bottom lash line. The more I think about it, the more I am worried that I wasted $20 on this tube of mascara.\n…read more"
      },
      "mollyvs":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"5 Jul 2016",
         "title":"Not waterproof at all",
         "description":"The original BTS mascara is 100% worth every penny, however this waterproof version left me so disappointed. Firstly, after application, this mascara takes FOREVER to dry, much longer than any other waterproof mascara let alone a non-waterproof mascara. Secondly, after wearing this for a few hours, I came to find it running all along my lower lash line, giving me black eyes that can't just wipe away because it's waterproof. Finally, when washing my face, after using a makeup remover wipe and then washing my face with two different make up melting face washes, the mascara still left a permanent dark tint to my lower lash line. Very disappointed in this mascara, especially because I love BTS. Hope for a better formula!\n…read more"
      },
      "okokbre":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"19 Dec 2016",
         "title":"i use this everyday",
         "description":"it gives a lot of volume but becomes clumpy very easily."
      },
      "ekstpaul":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"16 Nov 2016",
         "title":"fabulous",
         "description":"loved this, very lengthening and waterproof!"
      },
      "claud2812005":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"15 Jun 2017",
         "title":"Love this!!",
         "description":"My new favorite mascara. I will forever stick to this one. I have hardly no eyelashes and this mascara makes my lashes look full."
      },
      "Zoey2341":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Sep 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Love the longevity and the appearance of the mascara. Will be repurchasing."
      },
      "kaylaasweeney":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"21 Apr 2017",
         "title":"Not Worth It",
         "description":"I've always used drugstore mascaras and this was the first one I bought that wasn't so I was very excited to try it out. But after the first use, I was over it. It is extremely clumpy and makes a mess. The brush shape is very wide and personally I'm not a fan but I know a lot of people like that so that's your call. But the worst part, it is nearly impossible to remove with makeup wipes, eye remover, even coconut oil. I cannot get the stuff off. I guess that's good for when you're wearing it, but when you want it off it's a big problem. I'll literally have leftover mascara on my eyes for a day or two after I try to remove it and I never can. I think they did this on purpose so you have to buy the Too Faced Mascara Melt Off (which I did) because I was desperate. All in all, save your money and buy a different mascara I don't recommend.\n…read more"
      },
      "wvugrad":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"10 May 2016",
         "title":"Disappointed",
         "description":"This mascara did make my eyelashes look longer and fuller. However, the brush is an awkward shape and difficult to use. The mascara itself is messy and smears easily--even after it's dry and even though it's supposed to be waterproof. I don't understand why it smears so easily when it's on, but it is VERY difficult to remove, even with eye makeup remover (oil-free AND oil-based). I will not be purchasing this again.\n…read more"
      },
      "baebie":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Mar 2017",
         "title":"AMAZING",
         "description":"I don't know why this isn't 5 stars.. I'm so picky with my mascara I've only loved 3 mascaras in my entire makeup wearing days and this is one of them!! I love the way it makes my lashes look. They look long and full. Obsessed!! I recommend this to everyone I know!"
      },
      "jjk19":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Aug 2016",
         "title":"YES!!",
         "description":"I liked the original one but it didn't make my lashes stay curled throughout the day. When I saw this I totally jumped on board. I love it for my lashes because it gives me volume, length AND makes my lashes stay curled. Not sure why there are so many negative reviews but I give this two thumbs up!!"
      },
      "Sorsha23":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"1 Feb 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Absolutely LOVE!"
      },
      "sydneyhopp":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"21 Apr 2016",
         "title":"fibers aren't my thing",
         "description":"I have very long, thin lashes and this just clumped them together like nothing else. And it is definitely waterproof and nearly impossible to get off without ripping out lashes"
      },
      "HannieHarajuku":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"16 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Goopy"
      },
      "mintyt":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"27 Aug 2016",
         "title":"Two of my co-workers pranked me by pinning me down and spraying a spray bottle full of water two inches from face right in my eyes. The mascara stayed on and didn't get super clumpy like I notice so many other waterproof mascaras do when they get wet.",
         "description":""
      },
      "mysticmua":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"30 May 2017",
         "title":"It was okay...",
         "description":"The mascara itself wasn't bad - it did give my lashes volume and it wasn't clumpy or anything, so for the mascara itself, yes I would say 5 stars. However, it seemed to almost dry out or run out not too long after my purchase? It was like I barely got to use much of the product."
      },
      "makeuploverxo78":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"11 Apr 2016",
         "title":"MASCARA MELT OFF",
         "description":"Don't be fooled by the reviews it is really really good it just won't come off your lashes. Mascara itslef is worth five stars. Bought it before the melt off came out, so I've been mad about it all week but it comes off now after I finally bought it. DO NOT BUY WITHOUT MASCARA MELT OFF , you're really spending 40 on it, but it's still good mascara!"
      },
      "sierraatee":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"9 Apr 2016",
         "title":"Messy",
         "description":"I was super excited to try this waterproof version of the bts mascara as I can only waterproof mascara works for me but this product just didn't live up to expectations. It made my lashes look great, long and full, however it smears everywhere! After blinking I had mascara everywhere! It takes too long to dry so the mascara will transfer to the lid and below eyes. I was so excited about this product but I will ultimately be returning.\n…read more"
      },
      "morticiasface":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"21 Sep 2016",
         "title":"Too Awful...",
         "description":"I purchased the waterproof product by mistake, but dice I loved the non-waterproof Too Faced mascara, so I figured this would be a safe bet. It's very clumpy and is impossible to wash off- even with a good quality eye make up remover. I found I shed lashes with this products simply because of the effort it took to take off. I will be exchanging this product for the non-waterproof stuff."
      },
      "bluemoon23":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Oct 2016",
         "title":"True to its name!",
         "description":"This is some fabulous mascara. I wore it on my wedding day, and it did not budge (I cried a lot, and it was 100 degrees that day). I've got naturally long curly lashes, and this is a really wonderful product that helps enhance them even more."
      },
      "missyhart":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Dec 2016",
         "title":"fabulous",
         "description":"Great texture and consistency, not clumpy at all and holds lashes firmly and overtime perfectly, never buying a different mascara after this. Not a huge fan of the hour glass shape wand but can work with it and it doesn't effect my opinion of the overall product."
      },
      "MissKittyRVT":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"23 May 2017",
         "title":"Sensational!!",
         "description":"This mascara is absolutely fabulous! Truly waterproof and long lasting. All love from me!"
      },
      "MerTsaba":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"10 Dec 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"BEST THING EVER"
      },
      "salyssa66":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"3 Jan 2017",
         "title":"Literally better than sex",
         "description":"This mascara is honestly amazing. Its dark, lasts for at LEAST 12 hours, and is very pigmented. The only thing I don't like about this mascara is that even though it's waterproof, it's really hard to take off. Even with makeup remover I struggle and I have pulled out some lashes on accident. I'm staying faithful to this mascara only and I fell in love with it the moment I put it on."
      },
      "munamars":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"6 Jun 2017",
         "title":"yuck",
         "description":"This mascara was terrible, I hated it! It goes on nice and looks good until you get it wet! It was waterproof, in that it did not run down my face, but once it was wet my lashes all clumped together and felt terrible. I'm glad I only bought the travel size to try. Very disappointed as I love the Better Than Sex regular mascara."
      },
      "Cat8818":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"27 Apr 2016",
         "title":"NotGood",
         "description":"This is nothing like the original formula. So disappointing because I've been waiting for this to come out in waterproof for a while. It comes out way too thick and clumps badly every time. It is definitely waterproof though. I wouldn't buy it again."
      },
      "babyjxo":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"11 May 2016",
         "title":"yikes",
         "description":"If this mascara is \"better than sex\" than I am so sorry for you ladies getting less than you deserve. This mascara is nothing but a clumpy mess and the formula hasn't changed apart from now being waterproof. It still feels and looks the same except clumpier and thicker. Packaging is adorable but that's about it. Oh and you better own some good makeup remover cause this is a nightmare to take off.\n…read more"
      },
      "Crescendoll337":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"3 Jan 2017",
         "title":"Nope.",
         "description":"At first, I was very excited that Too Faced had produced a waterproof version of their original mascara. The regular, non-waterproof product is excellent. This, however, was a flop. When applying, my lashes proceeded to clump up and bond to one another, creating a chunky, inconsistent look. The waterproof version is terrible for those of us that like to layer mascara, as I could not get the bristles through the bulky mess to apply a second coat. Wishing to take the mascara off, I was met with great resistance from the product. The entire removal process included two makeup wipes and a pinch of coconut oil. This mascara is incredibly stubborn and will glue itself to your lashes to the point where attempting to wash it off will result in a heavy dose of frustration; some of my longer lashes even fell out as a result of the removal process. Perhaps a primer would help with some of the stinginess, but overall, I retired this product after a total of two uses. I recommend sticking with the original Too Faced mascara and saving yourself some money and eyelashes in the process.\n…read more"
      },
      "MissW3":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"13 Apr 2016",
         "title":"finally",
         "description":"I purchased this yesterday & I like it. Not as good as the og but still very good. Not as voluminous as og ... I also purchases the melt off for when it's time to remove my makeup ..."
      },
      "brandy2812814":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"20 Jan 2017",
         "title":"not smudge proof",
         "description":"Smudges very easily, not water/tear proof at all! I returned it, wish they could really come out with a smudge proof version."
      },
      "Odincat":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Dec 2016",
         "title":"worst",
         "description":"This is the worst mascara I've ever owned. It's clumpy and the brush is super annoying, it's to delicate to be a mascara brush."
      },
      "EmilyCrowell":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"14 Jul 2016",
         "title":"Great Mascara - like the original",
         "description":"This is a great waterproof mascara. I was worried from all the bad reviews. The original Better Than Sex Mascara is my favourite mascara and the waterproof version is very very similar. My eyes water a lot because of allergies so normal mascara will run down my face. I've been using the Better Than Sex Waterproof Mascara for a month now and it has fixed my problems - it doesn't run down my face, I don't get racoon eyes, it's great!\n…read more"
      },
      "BLunaa":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"14 Apr 2016",
         "title":"just not the mascara for me",
         "description":"I have really long curly lashes and it made a mess on my kids because it wouldn't dry. I'm so sad but that's just what happened to me. My friend on the other hand loves the formula."
      },
      "dollybird":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"20 Apr 2016",
         "title":"one time use?!",
         "description":"I've used the original and remembered liking it so I was excited to try this waterproof version. First time applied I was happy. Every single application since has been awful. Super disappointed. The size of the clumps on the brush itself coming straight out the tube was just ridiculous. I thought I for sure had a defective formula or even the wand... I see some other reviews here stating the same thing - but their repurchase turned out the same. So I will save my money (this time) and try a different one. Here we go again the search for a beautiful mascara!\n…read more"
      },
      "Slailer":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Apr 2016",
         "title":"Now this, is better than sex!",
         "description":"I see so many bad reviews & I'm cracking up cause this works like a freakin charm!!! The same volume & length that the original provides, just amazingly water proof. Dries fairly quick (I don't like mascara that dries fast, for application purposes obv.) It lasts about 12 hours for me using a good lash primer. Doesn't flake off. Over all an awesome product. Thank you Too Faced, feels like I've been waiting forever :)\n…read more"
      },
      "Chelisse":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"4 stars",
         "date":"20 Nov 2018",
         "title":"Actually gets the tips of my eyelashes!",
         "description":"It kind of amazes me the difference in people’s results on this. I got this the other day and I’m pretty darned thrilled with it. I had Tarte Gifted before this, and that was great but it flaked a little too much for my liking. This has been staying put more, and I haven’t had the clumping issues that plenty of people have with this, however, I can see how that could easily happen. But first, I’m careful about getting as little mascara on the brush as possible. I pull it out pretty slowly and that seems to help. Second, I always use a dry mascara brush after every light application, and I do a few light applications for each eye. I do not wait until I’m done applying and then use an eyelash comb. That’s a recipe for disaster with every mascara I’ve ever tried. Anyway, this mascara is holding better than my Tarte Gifted. It’s not too wet a formula, and it seems to be quite waterproof, plus it actually gets all of my super long but very fine eyelashes, even the very tips which other mascaras almost always fail to do, so I’m happy. :)\n…read more"
      },
      "becac1":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"21 Nov 2016",
         "title":"I go towards waterproof mascaras because regular formulas straighten out my lashes after I curl them (they are stick straight on their own).  I've been enjoying this one.  I think it's comparable to the Diorshow (and cheaper!).  Love the packaging. My only negative is that it is harder than normal to get off with eye makeup remover.",
         "description":""
      },
      "Ari48":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"22 Jan 2017",
         "title":"Disappointed",
         "description":"I am a big fan of the Better than Sex Mascara and thought I would try the waterproof. Well I will be going back to the regular. This waterproof mascara is not as good as the regular one. No volume."
      },
      "meebee23":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Nov 2016",
         "title":"The Best I Have Ever Tried",
         "description":"This mascara is everything I have ever wanted in a mascara. I have very straight, very difficult to curl lashes and need a sturdy waterproof mascara if my lashes even have a chance of staying curled all day. I love the original Better Than Sex for it's amazing volumizing effect but it is just too wet and heavy for my stubborn lashes. When I heard they were making a waterproof version I was ecstatic but became wary at all the negative reviews, so I just bought a travel size to try it out. I love it. It is the only waterproof mascara I have ever used that will actually hold a curl without me having to use a curler again after the mascara is on. It's incredible and the best part is I get the amazing qualities of BTS but with curl. I have not had ANY flaking problems with this. The original flaked a lot more for me but this doesn't budge at all. I don't know why that's the case for me but it's a problem for so many others. But I have never had a single flake fall into my face or into my, especially compared to the original which was a disaster in that department. If you have straight stubborn lashes this is definitely worth giving a try.\n…read more"
      },
      "mooniebaboonie":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Nov 2016",
         "title":"amazing!",
         "description":"This formula is so waterproof without being super heavy! I have naturally straight lashes, but this formula doesn't weigh down my lashes when I curl them, and I found that it plumped up and lengthened my lashes instantly! Definitely recommend!"
      },
      "amaing":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Aug 2016",
         "title":"omg love this mascara you just have to get the right makeup remover but the mascara is soooo amazing for my lashes",
         "description":""
      },
      "Peboli":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"22 Jul 2016",
         "title":"perfect if you're a raccoon",
         "description":"Smudgy, gummy, clumpy, lumpy. Can't stay on lashes but near impossible to remove! Wish I'd read these reviews b4 I bought it. Took it back."
      },
      "Sabrina1028":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Jan 2017",
         "title":"I'm a swimming instructor and this is the only mascara I have ever used that actually stays on and leaves my lashes curled. It is a bit hard to remove, but the take the day off by Clinique does the trick.",
         "description":""
      },
      "jzoh777":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Apr 2016",
         "title":"jaz714",
         "description":"The product itself if too thick for the type of brush. Not to mention that it has smudged all over the place before half the day, and I don't even have oily skin! I will not buy this again!! And I gave it a 2 wk trial period."
      },
      "Bainer18":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Sep 2016",
         "title":"I LOVE this mascara. It works so well for me, but I do have naturally long lashes. I find they don't clump together, they are extended and stay that way.",
         "description":""
      },
      "MrsSharpie":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"21 Apr 2016",
         "title":"I wanted to love it",
         "description":"I wanted to love this mascara, since I love the regular version, but it was impossible. The applicator and tube is just messy, there are clumps of mascara left on the brush every single time I dip it in the tube. The formula is super clumpy and flakes easily. So sad, because the original is wonderful :("
      },
      "horseberg":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"9 May 2016",
         "title":"Tranfers.  I looked like a racoon!",
         "description":"I have hooded eyes so have to be careful about mascara transferring to my brow bone area. I had to wipe mascara transfer off my upper eyelid four times after putting this on. Horrible!!! It was clumpy as well. I can't throw this away fast enough!"
      },
      "DetectiveBubble":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"30 Jul 2017",
         "title":"Love it!",
         "description":"I love this mascara. I saw the original in a buzzfeed video and decided to try it for myself. It does smudge a bit after 12 hours, but for the results I get, I can live with that. I get compliments all the time! Definitely need a good eye makeup makeup remover to get this stuff off, though."
      },
      "Teresaoj":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Nov 2016",
         "title":"completely different from the original.",
         "description":"I've had the original mascara a few times but it tends to smudge, so I decided to give this a try. It is really difficult to apply as it is extremely thick and clumpy. Also, it's really hard to take off even with eye make up remover. Will not repurchase."
      },
      "enw2":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Apr 2016",
         "title":"Took way too long to dry. Transferred all over the top and bottom of my eye.",
         "description":""
      },
      "MauiDot":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"27 Jun 2016",
         "title":"Great waterproof mascara",
         "description":"I decided to try this mascara on a whim because of the name and because I always wear waterproof mascara and do not have many choices. While it is true that it is a great mascara which volumizes much better than my old stand-by mascara, it takes quite a long time to dry. I end up with mascara underneath my eyes and below my brows, and the repairs slow me down in the morning. I'm not sure if it's the humidity here in Maui or just the product itself. It lasts all day and doesn't flake. I'm not sure I like the hourglass-shaped brush. I like this product, but sorry, it is not better than sex!\n…read more"
      },
      "JIRE":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"30 Dec 2016",
         "title":"When I first tried it my eyelashes clumped together and I didn't use it for months. Then I got a mascara primer and I decided to give it another try after applying the primer. I LOVED IT. Best results. I use it every time I really want my eyelashes to look super good",
         "description":""
      },
      "AndyKayRaeker":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"18 Apr 2016",
         "title":"beyond disappointed",
         "description":"I use the original better than sex religiously and have purchased it time and time again. It truly is the only mascara I'll use. I was so excited for the waterproof version but was beyond disappointed! I wasn't able to use it, I opened it once and the wand was completely covered in gobs of mascara and after discovering that the stopper in mine was faulty, the brush itself was not at all the shape shown on the box or even close to the original. I would give it more or less stars but I have no experience with the actual formula as I had no way to actually apply the product. Hoping I just got a bad one but not sure that I'll try repurchasing until I can check it in store! Bummer!\n…read more"
      },
      "lovey31":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Apr 2016",
         "title":"horrible!!!",
         "description":"This has to be by far the worse mascara I've ever used!it never dries,transfers all over your face as soon as you put it on and blink forget it,and it flakes like crazy. Imagine wet flakes falling all over your face and smudging making your face look dirty as heck,ughhh they need to refund everyone's money who bought this and take it off the market and try this again cause it's a complete waste of money,they were far too concerned with cute packaging to give a hoot about the product. Shame on them .\n…read more"
      },
      "mkate1987":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"15 Apr 2016",
         "title":"Terrible - just stick to the original",
         "description":"The original BTS mascara is my ultimate favorite - my lashes look incredible, full, volumized - almost like fake lashes. I was SO excited when they came out with a waterproof version that I immediately ordered. It is NOTHING like the original - made almost no difference to my lashes and then it was a complete b!@#$ to get it off! Hard pass - do yourself a favor and stick to the original."
      },
      "mzblonde":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"15 Jul 2016",
         "title":"bit over the top",
         "description":"I do really like this mascara but it is hard to get off and clumps easily. Perhaps the longer I have it, and the less mascara, the easier it will be to apply without clumps. At this point undecided if I will get it again. It is really waterproof though."
      },
      "shelbyljohnson":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"2 Jun 2016",
         "title":"Amazing!!!",
         "description":"Love it. Makes lashes long and voluminous. Have had many compliments on my lashes and many people asking if they were real. The only problem is it takes a little while to dry so be careful not to rub your eyes right away."
      },
      "CoCoValentino":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"14 Nov 2016",
         "title":"Stick with the original!",
         "description":"I've always loved the original better than sex mascara so I decided to try the waterproof in hopes it would work just as well and maybe last longer. First, I hate applying this mascara!! I feel as if you have to wait two minutes just to blink or else you'll have black all under your eyes since this mascara takes forever to dry/set. Next, once this mascara is FINALLY dry it easily smudges off if you even gently rub your eye and it often feels clumpy on my eyelashes. The original drys completely and I've never had this issue. Lastly this version tends to flake after about an hour of wearing it and again I never had this problem with the original. I love the original better than sex and would recommend that version but I don't know what too faced did wrong with this one but I highly don't recommend this water proof version! The only pro is it has the same nice volume as the original which is why I have it two stars rather than one.\n…read more"
      },
      "Amanda8878":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"18 Aug 2016",
         "title":"The Best Mascara I've Ever Used",
         "description":"Luckily, I cannot honestly say that it's name is absolutely true, but it comes really close."
      },
      "tellezxfirst":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Apr 2016",
         "title":"sticking to the original",
         "description":"I wanted to love this product so much but unfortunately I ended up disliking it a lot. Sticking to the original"
      },
      "lillysaeng":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"9 Apr 2016",
         "title":"New Holy Grail",
         "description":"I normally don't write reviews... EVER, but I thought I'd post my input on this mascara, because of how amazed I am. Because my lashes only cooperate with waterproof mascara, I have never tried the original BTS. Once I found out they came out with a waterproof formula, I couldn't wait to get my hands on it. I can honestly say that it does everything it claims to do. My lashes are naturally short and thin, but when I applied the mascara, it did just what I was hoping for. It definitely separated my lashes, gave it volume and it did not clump whatsoever. It also stayed in place ALL DAY and did not smudge on me nor flake. The only reason why I rated this 4/5 stars was because of the formula. It did take a long time to dry, and it really was difficult to take off at the end of the day... Even with a waterproof based makeup remover, which could either be a good and/or bad thing. The mascara is waterproof, so I don't have a problem with that. Overall, I love this mascara. I just wish the formula was better. I'm not sure why it has a lot of bad reviews, but everything really does work different for everyone.\n…read more"
      },
      "carlymurray52":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"17 Apr 2016",
         "title":"Waterproof...NOT!!",
         "description":"Looking at the packaging I had high hopes for this product, Too faced Better then sex original mascara (although can appear clumpy) is one of my favorites. This however was a complete disaster. I put it on and it was a little clumpy but not over baring and after about 10-20 minutes outside it was on the tops of my lids and below my eyes. I thought maybe it was just me, but after trying it multiple times and reading the reviews, it clearly wasn't so DO NOT PURCHASE THIS PRODUCT\n…read more"
      },
      "ShyannB":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"22 Apr 2016",
         "title":"Disappointed and Saddd",
         "description":"Ugh I am so sad to be so disappointed with this mascara. I was SO excited to get it, but it doesn't hold up as well as they say; It smudges under my eye all the time. And it makes my eyelashes look super small and clumpy."
      },
      "Clumps":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"15 Apr 2016",
         "title":"Disappointed",
         "description":"I wanted to love this mascara so badly but it was just too clumpy! It also smudges.. Not impressed"
      },
      "bethanylaurren":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"11 Sep 2016",
         "title":"it's just ok",
         "description":"Not a great, life saving mascara. It takes forever to dry, clumps if not applied very carefully, incredibly hard to remove, and overall just not with the attention it gets. I've purchased better drugstore mascaras than this one, and will unlikely repurchase this product. Really disappointed sadly."
      },
      "Shannon75":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Jul 2016",
         "title":"WOW!!!",
         "description":"This product absolutely blew me away! The first time I used it I wasn't expecting much, but WOW! It coats every single lash and makes them thicker, darker, and longer. The volume is more than I have ever seen in any high end mascara. I haven't tried the nonwaterproof version of this mascara but I definitely intend to. And they aren't kidding when they say it's waterproof! It lasted me an intense cross fit workout and a shower and still looked great. I even let the water run on my face. (I didn't rub my eyes) And they still looked flawless! My only complaint is that they don't give you the waterproof mascara melt off in a sample because I had to try VERY hard to get the product off my lashes. Besides that, I love the mascara's packaging. This little droplets of water on the tube are so cute. 5/5 stars for me. I'll definitely by repurchasing this!\n…read more"
      },
      "LoLo777":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"19 Apr 2016",
         "title":"Wanted to Love This",
         "description":"I was so happy when I heard too faced was coming out with a waterproof version of their better than sex mascara. i had tried the original and loved how my lashes looked but hated how much it flaked on me. this one did not flake which was great but it didnt make my lashes look as amazing as I remembered the original making them look. the packaging is gorgeous but for the $ I dont think its worth it for me.\n…read more"
      },
      "MissAngelina17":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"24 Aug 2016",
         "title":"I liked it, &amp; I don't like waterproof mascara!",
         "description":"I bought the smaller size. I've never been a fan of waterproof mascara. I wore it while on vacation at a lake and was very impressed. I didn't have any problems with it clumping(again, I bought the small one for $12, maybe the full size wand is different) and it didn't smudge at all. It lasted all day & wasn't as hard as most other waterproof mascaras to take off,( although it was still more difficult than non-waterproof mascara to take off.) This will be my go to when I need a waterproof mascara\n…read more"
      },
      "diva19":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"20 Apr 2016",
         "title":"Nothing Like The Original",
         "description":"I was excited to try this mascara because I'm obsessed with the original mascara. The waterproof version was a huge disappointment. The wand and mascara itself was clumpy. The mascara doesn't come out as thick or lengthen like the original. The waterproof version flakes like crazy. After my shift at work I was looking like a raccoon. Not sure if this solution is really waterproof. Also. The bottle itself is tacky; it has ridges to mimic actual rain drops. I get it, you want to show that it's waterproof but the drops of water on the bottle isn't aesthetically pleasing and doesn't feel good in my hands. Im sticking to the original formula.\n…read more"
      },
      "Bautistawifey":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Jul 2016",
         "title":"Best mascara I've ever had the day I bought this is the day I got rid of all my other mascara. Makes my lashes look full and I love waterproof.",
         "description":""
      },
      "Viannie":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"27 Mar 2019",
         "title":"This is honestly the worse mascara I’ve ever had. It runs no matter what.",
         "description":""
      },
      "sgirletz":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"5 Oct 2016",
         "title":"Clumpy &amp; Difficult to Remove",
         "description":"I was looking for a waterproof but I won't buy this again. It feels awful when it's on and not natural at all plus it's super hard to remove even with waterproof makeup remover."
      },
      "alikkat":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"13 Feb 2019",
         "title":"The definition of Waterproof Mascara",
         "description":"I loved the original BTS but it smudged on my under eyes so I was really excited to see there was a Waterproof version! I will say - THIS IS WATERPROOF. So, so, so incredibly waterproof. A lot of people seem upset by that in the reviews, but isn't that what you want out of a waterproof mascara? You definitely need a good eye makeup remover to get this off bc it does not want to move. The sephora brand waterproof makeup remover works perfectly for me and takes it off instantly. Soap and water alone will not remove this mascara! It can be a little clumpy but I just make sure to remove any excess formula from the brush before applying it. I also have a clean mascara wand that I will use to separate my lashes if necessary. Weirdly enough, this mascara combined with the e.l.f. $3 waterproof mascara = a match made in heaven. I will typically use BTS first, then use the e.l.f. brand as sort of a seal to it. It doesn't budge at all. This mascara works perfectly with falsies also. This is the only mascara I've used for about a year now and I definitely won't look back. The only reason I gave it 4 stars instead of 5 is because the wand can get clumpy. If Too Faced used the same wand in BTS that benefit uses in their \"yes they're real\" mascara I would rate this product a 5/5 absolutely.\n…read more"
      },
      "LuvMinnie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"12 Apr 2016",
         "title":"Very Disappointing!!!",
         "description":"super excited to try this mascara but waste of money.. such a hot mess and look like a raccoon after using this mascara.."
      },
      "paytonmorse":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"15 Apr 2016",
         "title":"DO NOT BUY",
         "description":"I consider the original BTS mascara to be holy grail.. but THIS IS HORRIBLE! it takes 20 minutes to dry and transfers all over my face. barely waterproof.. honestly have never used a worse mascara."
      },
      "KateRRoche":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"4 stars",
         "date":"19 Feb 2019",
         "title":"Kinda clumpy but it works!",
         "description":"Today I went in to get my wisdom teeth out. I wanted to be as relaxed as possible but still didn't want to look dead so I gave this a try knowing my weak self would be bawling. Long story short I got my wisdom teeth removed, cried after, and the mascara is still on and looks incredible! It's kinda clumpy but in the end it still looked good. I did recommend this to all the nurses after being on some HEAVY anesthesia. Would recommend to anyone looking for a good waterproof mascara that can survive even the most dramatic divas.\n…read more"
      },
      "marytingg":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"17 Apr 2016",
         "title":"Holds a curl but smudges",
         "description":"I have medium length asian lashes. They stick straight down and lose a curl throughout the day when wearing mascara. I always go for waterproof because I have stubborn eyelashes, watery eyes & oily eyelids! I live in Florida which is a very humid environment. My mascara ALWAYS smudges on me no matter what brand I use. My preference is drugstore mascara because it's cheap and usually comes in waterproof. I was so excited when Too Faced came out with a waterproof version of the Better than Sex mascara. I've been wanting to try the original, but I didn't because most highend mascaras don't work for me. This mascara holds an AMAZING curl on my eyelashes without feeling crunchy. However, it feels like the mascara never completely dries... It feels tacky and smudges on me. Although, I do have extremely oily eyelids and watery eyes so that may have caused the mascara to break down. I will continue using the rest of the tube because the packaging is so beautiful. This mascara could probably work for someone else, but I will most likely not repurchase.\n…read more"
      },
      "toots13":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"9 Oct 2016",
         "title":"Cool but...",
         "description":"This mascara is freaking awesome with volume if used with an eye lash curler but it does not come off easily with any make-up remover. Had to use the Trader's Joe Coconut Oil to remove it at bedtime..."
      },
      "ValenciaLiz":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"14 Apr 2016",
         "title":"Good Formula Bad Application",
         "description":"Love the formula holds my curl and makes lashes look great But the wand bring out too much product with it.. it makes it look clumpy I had to take a clean regular wand brush to apply it.. 5 stars to the formula but 1 star to the applicator.."
      },
      "itscindyy":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"28 Mar 2019",
         "title":"Shoulda read reviews",
         "description":"Bought this mascara going off the hype of the original better than sex mascara. Figured I’d buy the waterproof version since regular mascara tends to smudge on me, possibly because of my oily skin. Sad truth is this waterproof formula is smudgy and clumpy and I still end up looking like a raccoon! I didn’t sign up for this! :’[ now that I’m reading the reviews, I probably could’ve went with the original formula and been better off. Buyers take your chances. Just keep the box and your receipt lol\n…read more"
      },
      "jodyy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Jan 2017",
         "title":"best mascara ever",
         "description":"volumizing, lengthening, makes ur lashes curl all day, just the best out there!! This will be the only mascara i purchase from now on"
      },
      "brattycalli":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Apr 2017",
         "title":"Not worth it!",
         "description":"I gave into buying this mascara because of the hype. I've tried the non-waterproof version and loved it so I assumed the waterproof version wouldn't be much of a difference. Holy smokes this was the most difficult mascara I have ever tried! It was clumpy, difficult to layer, and a NIGHTMARE to remove. I usually use waterproof micellar water and it STILL wouldn't come off completely and I would still wake up with raccoon eyes. After a week of trying to make this mascara work, I gave up and returned it to Sephora. 0/10 would not recommend. You can find a way better waterproof mascara at Sephora or even the drugstore.\n…read more"
      },
      "Katies149":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Jun 2016",
         "title":"awesome but hard to work with",
         "description":"So this mascara is very finicky, but if you are patient and have time to play around with it, it's amazing. It takes a really long time to dry and has a tendency to clump if applied too heavy (I like to brush it out with a lash brush in between applications). However, the end result is amazing. I am so picky about mascaras and most disappoint. But this one is very black, holds the curl all day long, and doesn't flake off. It is a pain to remove, you definitely need an oil based makeup remover (I use the Boscia makeup break-up oil and it removes it with no problem). I would definitely recommend it if you're willing to be a little patient with it...the payoff is worth it.\n…read more"
      },
      "bexnlove":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"2 stars",
         "date":"18 Jun 2018",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Il pass, stick to the original"
      },
      "megz91":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Dec 2016",
         "title":"I love this Mascara !! I usually buy drugstore Mascara, and I was blown away by this stuff, it doesn't clump and it is indeed waterproof. I will definitely buy this again.",
         "description":""
      },
      "princessfatty":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Sep 2016",
         "title":"if you're sad and cry a lot this is for you",
         "description":"This holds a curl beautifully and lengthens wonderfully. Lightly sweeping thin layers of the mascara on is the best for me to avoid clumps when initially applying it. Everything makes me cry so I'm always getting this stuff wet and judging from how it looks right now (after a 2 hour nap and a half hour of a hard core crying sesh) it handles itself well- still holds at least 65% of the curl and at least 50% of the applied length and 99% of the black colour is still there. It only becomes a bit clumpy when I cry but it's cool- reapplying one layer of this stuff helps get it back to its original state. This stuff can smudge a lot under your eye ONLY if it's oily under there so just apply some translucent powder if that's ever a problem for you.\n…read more"
      },
      "primrose22":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Jan 2017",
         "title":"yes!!!!",
         "description":"I am so 100% in love with this mascara. It's hard for me to imagine how sad my lashes must have looked before I started using better than sex waterproof... seriously. I really like the brush and the formula!!! I'll never buy a different mascara!"
      },
      "BunnyAussie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"29 Jul 2017",
         "title":"Great until my lashes broke off",
         "description":"I bought this mascara at the recommendation of a store employee. At first I was over the moon with how well it worked. I normally won't buy waterproof mascara because I hate trying to get it off, but I was testing it for my upcoming wedding. It was so good that I was thinking of going without false eyelashes. Fast forward a few weeks after I started using it and about 3-4 days before my wedding. I had been noticing what seemed like an uncommon amount of random eyelashes but didn't think anything about it. I looked in the mirror that morning and noticed that my eyelashes had almost all broken off about half way down. Nothing in my skin care or make up routine had varied except for use of this mascara. Do not use! My formerly long, beautiful eyelashes were stumpy messes. If that result is \"better than sex,\" then I question the ad execs notions of sex.\n…read more"
      },
      "katehudson":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"9 Apr 2016",
         "title":"bad",
         "description":"I only wear water proof mascara, because my eyelids get oily though out the day and it can cause my makeup to run. This mascara smudges so much! Also when you apply it gets everywhere."
      },
      "contouringqueen":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"28 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Love this mascara ❤️ would definitely recommend."
      },
      "eeellvvyyy":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"28 Apr 2016",
         "title":"I'm so disappointed, this product is not what it claims. It's definitely not waterproof, it does make your lashes longer but for what it's worth it should be waterproof. Def just sticking to the original.",
         "description":""
      },
      "PARTYMIMI":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"20 Apr 2016",
         "title":"NOT THE SAME",
         "description":"I loved the Too Faced Better Than Sex Mascara. So when they came out with a waterproof version I wanted to try ASAP. Well I was a little disappointed. The formula isn't the same. It seems wetter than the original and takes longer for it to dry. Since it is wetter and takes longer to dry it does clomp your lashes if your aren't being careful. After a few goes I can get it to behave and give me the lashes I want."
      },
      "Carlymua":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"31 Mar 2017",
         "title":"smudged, clumpy, hated it",
         "description":"I shut my eyes roughly often, it's a habit and i use waterproof mascara so it doesn't smudge, but this mascara gets all under my eyes and leaves a huge mark. I try to only put on one coat, but it leaves huge clumps on my eye lashes, so I need to smooth it out. I hate it"
      },
      "coriarete18":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"16 Apr 2017",
         "title":"Didn't work for me",
         "description":"Too Faced's regular Better Than Sex mascara is phenomenal. This formula, however, is terrible. Lashes clump, formula flakes, and it doesn't have the WOW factor of the lengthening and overall appearance of the nonwaterproof formula. Skip this and go for the regular version"
      },
      "Dasiy213":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Jun 2016",
         "title":"love",
         "description":"Nvr had a clumping problem or drying problem I love it an it does not smug"
      },
      "haileymcl":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"1 Apr 2017",
         "title":"not very good",
         "description":"This mascara is really clumpy and really hard to work with. The normal Better then sex is much better. Send your money on a better product. I love too faced but this was a big miss for me."
      },
      "Beauty619":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Apr 2016",
         "title":"sad to say HORRIBLE!",
         "description":"I am a die-hard two-face fan and I absolutely adore the Too Faced Better Than Sex original formula, however I must say that this formula is horrible! I put it on and first of all it was really wet and took forever to dry, second of all it was all over my eyes on the top and the bottom I just couldn't believe that this formula did this and took this long to dry and it really made my lashes look really clumpy....im sorry too faced but this wasn't for me at all\n…read more"
      },
      "sarah8916":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Dec 2016",
         "title":"love it",
         "description":"I love the fact my lashes stay curled and just a little goes a long way"
      },
      "Shou0023":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"2 stars",
         "date":"5 Aug 2019",
         "title":"DISAPPOINTED - don’t buy",
         "description":"I bought this mascara cause I heard really good things about the original formula and they told me at the store it was a best seller, however since I wear contacts, I usually prefer going with a waterproof version, since I wear eye drops through out the day. This mascara is a BIG FAIL... it’s true what other reviews say, it’s clumpy, it leaves your eye lashes spidery and they stick to each other so it’s very hard to get a nice look. It also dries at the bottom of the tube. After trying it for a few weeks and realizing it’s that bad, now I have to always use a regular drug store mascara after putting on this one to unstuck my eye lashes and make them look longer and nicer. I gave it 2 stars because it is waterproof and that part has worked perfectly for me but it’s also suuuuper hard to take it off. I always use waterproof make-up remover and have no issues but this mascara is extremely hard to remove, so be careful as my eyelashes have even fell trying to wipe it off. I WOULD NOT RECOMMEND IT. Definitely not worth the $\n…read more"
      },
      "orlando30":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"4 May 2016",
         "title":"keep shopping",
         "description":"Not good. Stick with the pink original tube. Very clumpy and takes FOREVER to dry. Extremely difficult to remove."
      },
      "hannibananii":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"6 Jun 2016",
         "title":"EXTREME WATERPROOF",
         "description":"First, let me say I'm not sure why this has 3 stars. The better than sex waterproof mascara is pretty good in my opinion. You just have to be careful when applying it because it can get kind of messy. However, once you let it dry it will not come off. I swear to god this stuff is impossible to remove. You gotta use a make up oil to remove it or something. I just use some coconut oil and a q-tip to remove at the end of the day. Other than that this mascara rocks!\n…read more"
      },
      "mmarmarr":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Nov 2016",
         "title":"Just bad",
         "description":"I bought this expecting a good mascara but nope. It's super clumpy and way too thick. Can't apply it without leaving your eyelashes looking like black sludge. Would not recommend."
      },
      "anndeem":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"12 Apr 2016",
         "title":"DISAPOINTING",
         "description":"I wanted to love this product so much because the original is amazing and its waterproof! Except I hate this product. There is NO I mean NO reason to waste your money on this product. It was not volumizing whatsoever. It went on a hot mess. I was wiping off my makeup around my eyes to fix the mess it made. It took FOREVER to dry. The product clumps. I repeat MESSY! But I will say this product is good for when you wear falsies that are super big because you wont have to have your lashes on point. Please trust me to not waste your money on this product.\n…read more"
      },
      "pkaivo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 May 2017",
         "title":"Waterproof, shower proof, tub proof...",
         "description":"I am the smallest clear eyelashes on a person. If I am not wearing mascara you can't even tell I have eyelashes. I have watery eyes and this mascara stays in place. Also it makes it look like I have long lush lashes."
      },
      "LynneRH":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"22 Sep 2016",
         "title":"Wasted my money",
         "description":"I bought this for my daughter and she threw it out within a week. It didn't dry fast enough and would smear all over her face, then once dried she found it too difficult to remove. Stick with the non waterproof version!"
      },
      "mytaquino":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"30 Apr 2016",
         "title":"Messy, Wet, but Black",
         "description":"I don't get this mascara!! Really wanted to love it so I've been giving it a lot of tries but it is really just no good! It takes forever to dry and you will have a lot of clean up to do no matter what. The breaking point for me with this mascara was that one day I put this on, I cleaned it up, finished my lips and brows, got dressed, got my things together, made tea, left my house, made it to the first stoplight, at which point I realized the mascara was still wet and I had a few more black specs under my eyes to clean up. My only positive for this mascara is that it does make your lashes look very black and once it dries it really is waterproof. But since I've found myself avoiding it in order to not work as hard at fixing the rest of my make-up I will be returning it.\n…read more"
      },
      "stefduch":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"23 Jan 2017",
         "title":"What a mess",
         "description":"It took me 3 times to completly remove it. It's the complete opposite of the original Better Than Sex, which it was my favourite mascara! I return it with no shame!"
      },
      "RiRi9389":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"15 Nov 2017",
         "title":"<img src=\"https://www.sephora.com\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Standard Size Black - 0.27 oz/ 8 mL",
         "description":"Clumpy"
      },
      "Vane55":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Apr 2016",
         "title":"I don't understand all the bad reviews because I have been using this mascara for weeks now and I love it! I use it with the mascara melt off and they work so well together.",
         "description":""
      },
      "udtfabh":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"17 Jun 2017",
         "title":"no thank you",
         "description":"It flakes very intensely also it is not waterproof at all. Like at all. I sprayed my face with a setting spray and it smudged so bad! It also physically hurt my eyes by the amount it flakes. Save you're money there are so many better ones."
      },
      "anonymous001":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jul 2016",
         "title":"TERRIBLE!",
         "description":"At first when I applied it, it gave the length it said it would but the drying process took FOREVER! I want my money back honestly! Not worth it at all, will not be purchasing again!"
      },
      "lanadog":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"29 Apr 2016",
         "title":"smudges A LOT",
         "description":"It smudges within like 10 minutes"
      },
      "Molly2520":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"2 Sep 2016",
         "title":"Amazing!!!",
         "description":"I love this mascara so much! the product is amazing and the packaging is adorable. ( I'm a sucker for packaging). I usually just stick to drugstore on mascaras because of price to longevity ( life span) ratio. now most prices are now very similar from drugstore to high end and high end I find nicer. this mascara was this best first high-end mascara I've tried. I don't find this mascara clumpy at all I think its all on how you apply it and your experience with using a different kind of shaped wand. both times I've bought this mascara I've loved it and I hope you guys will too!!!\n…read more"
      },
      "abe16":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"22 Apr 2016",
         "title":"Disappointing",
         "description":"If I could give this no stars I would. I was so disappointed in this mascara. I love the original BTS mascara so much so when I found out they were coming out with the waterproof I almost cried. I had like three reminders in my phone to buy it the minute it came out. BIG MISTAKE. I should have waited to read the reviews and maybe it would have saved me some money. It is too wet and takes too long to dry. It doesn't give me any volume or length. My lashes clump together. It is really just a mess. It smears everywhere and its extremely hard to get off of your skin after it smears. I am not impressed at all. It will be going in the garbage where it belongs.\n…read more"
      },
      "Finilain":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Aug 2017",
         "title":"Nearly perfect",
         "description":"To start off, I have really watery and sensitive eyes, so I can only wear waterproof mascara. This is the reason why I had kind of given up on high end mascaras because for some reason, drugstore mascaras seem to be the only ones that know what waterproof means. Still, I was curious about the Better Than Sex Mascara when they made a waterproof version and on vacation I bought the travelsized version to test it. The first thing I noticed was that this mascara makes my lashes look the most beautiful they have ever looked. It also is the only mascara I have ever tried that I need only one coat of. But even after two coats, it doesn't clump and I have curved, defined, volumous, even longer, actually black lashes. I fell instantly in love! The second thing that I noticed that I had slight raccoon eyes after I sprayed myself with setting/sunblock-spray. So I was terribly disappointed and thought that this wasn't really waterproof. After having worn this mascara for 2 weeks now, I can say that it is actually pretty waterproof. It survived very hot days and a sad movie with lots of crying on my part. Here are the things that I have learned though: a) this mascara takes relatively long to dry, and while drying it is not waterproof/transferproof yet. So no settingspray while the mascara isn't dry yet. b)setting powder under the eyes! Because the mascara is waterproof, but not oilproof, so if you have oily skin or use something oily like sunscreen, the mascara is going to come off on the oily places. c) for some reason, this mascara is much easier to remove than the drugstore mascaras I am used to, so less rubbing is really nice for my sensitive eyes!\n…read more"
      },
      "nikki1021":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Dec 2016",
         "title":"Love",
         "description":"The reviews are pretty accurate, it's a very dramatic mascara, the curl is great and it is waterproof. It lasts all day and it is difficult to get off. I prefer the non-waterproof version but I'm happy I have this for weddings or other places where I might come in contact with water lol. It does what it's supposed to so I don't see a problem, I think it's great!"
      },
      "missnataliej":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Jul 2016",
         "title":"pretty bummed",
         "description":"I was recommended this mascara since I need a good waterproof one. This is NOT waterproof whatsoever and it leaves your eyelashes feeling greasy. I'm pretty bummed to say the least. I wanted one that I could wear to work and not worry about it smearing, it didn't hold up for a half hour at the gym (the ultimate waterproof test)"
      },
      "Luimi":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Jun 2016",
         "title":"You must use this product correctly",
         "description":"This product can not be used in its own and was not designed to do so. You must wear this as a waterproof top coat for your mascara. If you wear it incorrectly it won't dry because there isn't a product for it to adhere to. When partnered with the Better Than Sex mascara it really seals the mascara and makes it incredibly waterproof."
      },
      "lilu1982":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"1 Apr 2016",
         "title":"First impression:\n#1 it's great at holding the curl. And I have Very straight lashes\n#2 very wet/waxy. So it smudges at the beginning. And after a few hours if you run your finger through your lashes you will get black smudges.\nAbout the removing it part, i still won't know until tonight.",
         "description":""
      },
      "makeupcrazzy":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"10 Aug 2016",
         "title":"I bought the travel size and then got on here to read reviews and saw all the bad ones and thought \"oh great, waste of $$\"... Well I tried this today and I actually really like it! I always use water proof because my lashes are so long and they always have transfer with regular mascara. I have to say this stuff is pretty good, I used a blow dryer on my lashes to make sure they were fully dry but I honestly didn't notice it being super wet in the first place. Maybe the travel size is less wet or maybe I got one that was dried out, who knows! But I really like this and will buy the full size when I run out :)<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "fkelley":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Mar 2017",
         "title":"absolute best waterproof mascara",
         "description":"I bought this mascara when my father entered hospice, in preparation for the nonstop tears I knew were on the horizon. Not only does this mascara not budge AT ALL even when crying hysterically, but it looks good! All waterproof mascaras I have tried in the past either weren't really waterproof or were but made your eyelashes look horrible. This one give great volume and length on top of excellent staying power, even when out through a full on tear test.\n…read more"
      },
      "Claud0509":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"12 Apr 2016",
         "title":"I wanted to love it!",
         "description":"I had such high expectations for this mascara because I love the original formula! Unfortunately it took WAY too long to dry!!! And it got all over my eyelids and I ruined my eye make up on 3 different occasions. I kept thinking the next time I would try it it would get better, and it didn't. Will be returning this."
      },
      "mkarp":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"9 May 2016",
         "title":"Not waterproof",
         "description":"Very disappointed. First of all not very waterproof and smudges after an hour on. The brush collects too much mascara and clump. This was recommended by a sephora sales rep. Not good at all. So sad."
      },
      "L8DDEE":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2016",
         "title":"never again",
         "description":"This has been the worst mascara I've tried. It's very thick and very clumpy!!!!"
      },
      "HKSmakeup":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 May 2017",
         "title":"BEST MASCARA",
         "description":"This mascara is super amazing like the normal formula but I found that the regular formula actually flaked off a lot throughout my day. I got this one and it gives the same exact look to my lashes but it doesn't flake and stays on no matter what !! Love love love !!"
      },
      "bpfmoney":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Apr 2016",
         "title":"Bummer",
         "description":"I LOVE the regular version of this except that it flakes pretty quickly. So, I was super excited to learn of the waterproof version. But the formula is TOTALLY different. It makes eyelashes sticky and clumpy and rubs off with water still. I returned it immediately."
      },
      "carolinav90":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Apr 2016",
         "title":"I truly love the original mascara so I picked up this waterproof mascara before my vacation &amp; I am super disappointed that it takes forever to dry ! &amp; like it transferred to my eyelids so quickly because it doesn't dry quickly.",
         "description":""
      },
      "amie70119":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"13 Dec 2016",
         "title":"I love this mascara and the melt off cleanser. It lasts for hours and literally wipes away once you apply the melt off. Definitely will be purchasing more",
         "description":""
      },
      "UGA77":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"14 Dec 2016",
         "title":"Wet mascara",
         "description":"Very disappointed with this product, I thought since they came out with a waterproof one I would give it a try. Yeah it doesn't dry, and gets all over your lids. Will be returning it and sticking with Tarte lash paint mascara which is awesome!"
      },
      "SM00":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"17 Aug 2016",
         "title":"An utter disappointment",
         "description":"I've used the pink better than sex mascara & I liked it, but it flaked off at the end of the day, so I thought this would be better. It didn't do ANYTHING. I felt like I wasn't wearing any mascara. I returned it the next day, I wouldn't recommend it to anyone."
      },
      "exarkkun":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"23 May 2017",
         "title":"Hate it",
         "description":"I just bought this and will be returning it shortly. This did not stand up to humidity, rain, or tears at all. The wand is terrible, and on my lower lashes just applied the product straight to the skin in the corners, totally missing my lashes. The packaging is on the nose, I will say that, but the products needs an overhaul."
      },
      "ammetzge":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Apr 2016",
         "title":"no-go",
         "description":"Love the original, was hoping that the waterproof would be even better. I have oily skin and eyelids, and rely on waterproof mascaras to make it through my 13-hour shifts as a nurse. Unfortunately, this product smudges terribly compared to the original. Will be returning."
      },
      "mariaaa09":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 May 2016",
         "title":"terrible",
         "description":"I tried this mascara excited because of how much love the first one except it smudges a little. Anyways it would not dry at all. I waited all day and it would till transfer. It made my lashes clumpy and stick together. I had to return it. I stick to original formula for top lashes."
      },
      "Sierra519":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 May 2016",
         "title":"love!",
         "description":"I loved the original BTS, but it smuged too much on me. The waterproof does take longer to dry but it stays in place all day!"
      },
      "AnnaBarker":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Apr 2016",
         "title":"Disappointed",
         "description":"I was so excited to try this mascara because I love the original and the packaging is too cute, but this one is terrible. It takes forever to dry, at least an hour. It flakes into my eyes as soon as I put it on and continues to do that all day. Lastly, the results do not compare to the original formula. My lashes look and feel terrible from the moment I put it on. I'm very let down by this product."
      },
      "Christinap610":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"1 May 2017",
         "title":"I don't think I've ever been so disappointed in a mascara, they call it better than sex but I don't see how. This product was not only messy but useless. I have always have had trouble with my lashes but this was something new.",
         "description":""
      },
      "Megan914":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"8 May 2019",
         "title":"horrible",
         "description":"Awful!! This picture of me is on my honeymoon and I did NOT even get my head wet at all!!! AWFUL mascara, especially for being “waterproof”"
      },
      "Erikarea16":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"9 Apr 2016",
         "title":"I was really excited for this mascara, but when I finally got it and tried it out I was very disappointed. It's very messy and gets all around your eyes and takes a long time to actually dry, also very hard to take off at the end of the day.",
         "description":""
      },
      "sjounson":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 Apr 2016",
         "title":"terrible",
         "description":"I am NOT excited, it is too clumpy and too messy!!!!!"
      },
      "MollyF3":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Jun 2016",
         "title":"Go With The Original",
         "description":"I bought this thinking it would be great but it's not. It comes out too clumpy, and doesn't give nearly as much volume as the original. It makes my lashes super clumpy, and it takes forever to dry. I wore it once, I blinked after putting it on my upper and lower lashes (like I always do) and it transferred all over my face and caused me to have to take off foundation and redo it. I've never had this problem with the original. The wand isn't even the same. Just get the original. The best thing about this is the packaging.\n…read more"
      }
   }
}