{ 
   "product_name":"Diorshow Waterproof Mascara",
   "product_type":"Mascara",
   "brand":"Dior",
   "url":"https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901",
   "reviews":{ 
      "6279":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"30 Nov 2009",
         "title":"The ONLY Mascara",
         "description":"I'm 50 and have been using this mascara for 3 years or so. I've tried many others and will never try another again. Absolutely fabulous product."
      },
      "tracebiz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"6 Aug 2011",
         "title":"The only mascara I will ever use.",
         "description":"Besides Tarte's Lights, Camera, Splashes! in black.\n\nHere's some background information: I'm Asian, I have straight (but, pretty long) lashes, I use the Shu Uemura curler (who doesn't???), and have pretty oily skin.\n\nI freaking love this mascara. Like I said before, it's one of two that I will only use. I've tried so many other mascaras and nothing compares to this and Tarte's. If I want my lashes to look almost baby doll like, I use Tarte's. If I want my lashes to look like feathers, I'll use this. This stays on my lashes for the most part. If I didn't have such oily skin, this would stay on until I took it off. Also, even with my very oily skin, not much comes off. I also dab some powder along my bottom lash line to keep my eyeliner in place, so that helps a lot too. A little trick I learned to do by myself. This literally does everything it's advertised to do. No joke. At least, on me it does. I've cried with this stuff on and none came off. It does, however, come off easily with eye makeup remover (I use Lancome's Bifacil...amazing!!!) which I appreciate.\n\nOverall, one of my top favorites. I buy it all the time...sometimes two at a time. I'm obsessed.…read more"
      },
      "mimi13":{ 
         "extra_info":"<b>Skin Tone</b> Medium",
         "stars":"5 stars",
         "date":"31 May 2013",
         "title":"Smudging problems",
         "description":"Hey ladies!! I'm reading about those that are disappointed because you don't think it lives up to it's waterproof claim due to smudging. Being waterproof (or not) isn't the issue... It's any oils/creams/concealer that you might have under your eyes. Think about it; it's the oil in waterproof makeup remover that dissolves the mascara, not water. I had the same problem, so I just brush a very light topcoat of Blinc's mascara over my bottom lashes, and voila!! No more smudging!!! Hope this helps!! :)…read more"
      },
      "Alicegator":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"17 Apr 2010",
         "title":"Finally--a mascara for straight Asian lashes!",
         "description":"I have been wearing makeup for many years and never have I found a mascara that I liked enough to use.\n\nThe challenge is that I am Asian and my lashes are short, straight and sparse. Not a lot of Asian women I know like to use mascara because it usually is not very effective. I have accepted the fact that I will have to depend on my Shu Uemura curler for the rest of my life, but I've thrown out tons of mascara tubes which purported to be lengthening, thickening, etc.\n\nThen I was introduced to this amazing mascara at the Sephora store by one of the Dior makeup consultants. She put a single coat on each of my eyes and I was seriously stunned. My lashes looked lush and full and even slightly curled without an eyelash curler! The pigment is super black and rich on me and the brush is huge and fluffy. The impact was tripled once I curled my lashes and then applied it!\n\nIt is also almost 100% waterproof. There is a tiny bit of smudging after several hours of wear, but I never need to reapply. It stays on all day, I have tend to have \"moist\" eyes, which was always a problem for me. Color me impressed.\n\nI only have 2 drawbacks. The first is that because the brush is so big, i have problems catching my puny lower lid lashes. This is definitely not the mascara brush for short lower lashes. I was able to solve that by taking a smaller mascara brush and putting a little of the DiorShow product on it and gently catching the remaining lower lashes.\n\nThe other is that it is really difficult to take off. I use a gentle cream to loosen it at the end of the day and then tissue off. But when I wash my face, I still get residue. I just picked up the MUFE remover though and it has eliminated most of these issues as well.\n\nAll in all, this is the mascara that changed the way I thought about mascara. Highly recommended for Asian lashes!!!…read more"
      },
      "mj17":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"12 Jul 2012",
         "title":"Best mascara",
         "description":"Being \"mature\" with dry eye condition and living in hot & humid FL, the waterproof is the only mascara that does not run all over my face. Combined with Dior primer, it makes my almost non-existent lashes look fab."
      },
      "Loriface":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"15 Jan 2009",
         "title":"Not bad, not bad at all!!!",
         "description":"I purchased this product for the same reason a lot of you did or are about to, because of the rave reviews. I believe this mascara to be well worth the price. No clumping, smooth application and it wont smudge. A lot of negative reviews state that it's hard to remove, even with waterproof mascara remover. That scared me a bit but no avail because it's comes off just fine. And by the way, Sephora's Waterproof Mascara Remover works great with this product.…read more"
      },
      "TheShilpanator":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"28 Nov 2009",
         "title":"Azure Blue",
         "description":"Super-pigmented, non-clumping and smudge-proof. If you like this sort of dramatic look, this one is amazing. The color will really make brown eyes pop while the mascara lengthens and volumizes lashes. Recommended!"
      },
      "stacy1987":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Jan 2009",
         "title":"embarrassing to admit, but one time i cried for about 30 min (salty tears), and this did not budge at all. usually when girls cry they get that nasty ugly raccoon eye thing going for everyone to see, but not me. i was pretty impressed and relieved it stayed put. i like to use this because i know that no matter what happens (crying, swimming, etc.) there are no smudges under my eyes. i just remembered that i did swim with this on and it didnt smear. this mascara is just awesome. it gives serious volume to the lashes and somewhat length (can be better). i bought the dior waterproof blackout mascara (lengthens more), which is also good, but diorshow is better. sometimes little specks of the mascara do get under the eyes, but you just need to dust it off. i think this is because the mascara is almost out or when the mascara isnt applied evenly and the tips flake off. hope this is helpful. =)<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "cstar023":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"29 Dec 2012",
         "title":"Favorite Mascara",
         "description":"I bought the waterproof version because I like my mascaras to stay put, and this one didn't let me down.\nThis is my hands-down favorite mascara. The first thing I noticed when applying this mascara is it really volumizes, and you can layer it several times without it clumping. My lashes came out super defined, and it's pretty good at lengthening too. The brush is big and at first I thought it would get in the way, but it helped the mascara go on full and thick.\nFor reference, I've tried Benefit BADgal, Clinique High Impact and Lash Doubling, Lancome Hypnose and Definicils, and all the popular volumizing drugstore mascaras out there. I will always come back to Diorshow, it's a classic and it works. Worth the splurge, in my opinion.…read more"
      },
      "elliemp":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"26 Jul 2012",
         "title":"Glamorous Eye Lashes",
         "description":"I have skimpy short blonde eyelashes. This mascara lengthens, thickens, and curls. My eyelashes have never looked so thick and glamorous. It does take a couple minutes for the pfoduct to dry after applied and you can easily get some mascara on your upper eyelid until it does dry. It stays all day even in hot himid weather. I gave it 4 stars instead of 5, because it is very gooey coming out of the tube, and you have to scrape the excess off the brush before applying the mascara. If you don't do this, you would have clumps and a gooey mess.…read more"
      },
      "pmarm":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"2 stars",
         "date":"23 Jul 2015",
         "title":"Not worth the money",
         "description":"I have never written a review on here, but after buying this mascara, I had to. I was on a mission to find a brown and VERY waterproof mascara when an employee showed me to this mascara. She told me how it is one of Sephora's best sellers and that it was waterproof, brown, had a non-clumping formula, and it was build able. Excited, I bought it! The second I got home I put it on, it looked fantastic. I then went to wash my face to see if it passed the test for waterproof- it failed miserably. I thought maybe it would just be my everyday mascara… it began to smudge after the first hour or wearing it. Very disappointed.…read more"
      },
      "Rose24x":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"7 Jun 2016",
         "title":"horrible",
         "description":"don't , just don't. it's horrible. the wax just melted out of my bottle. my eyelashes look likes it needs revival after using this. it's sad to see a high brand name do a bad job."
      },
      "tess101":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Apr 2016",
         "title":"overrated",
         "description":"I found this product to be a huge disappoint. After reading endlessly positive reviews, I expected to be blown away. Perhaps I just bought a bad tube but I wouldn't bet on it. The formula was nothing special. The brush was bulky and hard to apply on the inner and outer corner lashes, and it dried out real quickly. I would never recommend this product. This is actually the first product I've ever given one star to. From a brand this renowned, I couldn't believe the low quality.…read more"
      },
      "samiam":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"28 Sep 2008",
         "title":"Soooooo Ive been using this product for a loooong time, even before the hype and i reallly recommend it for short lashes. It really does wonders after applying a few coats because it goes on very smoothly. Perfect if your a natural cryer and/or swimmer but make sure to take off the mascara before going to bed with a good water-proof eyemakeup remover or else results could be breakage or clumpyness with a new coat the next day. Oh and as for racoon eyes..they can be avoided if you apply it correctly (arch your eybrows so that it wont get on your eyelids, if it does well no bigger lick your finger and rub it off but if your the eew-my-own saliva-is-disgusting type then carry a Qtip and wet it) and let the mascara dry before doing dramitic eye jestures or sneezing haha =]. Complements and my satisfaction make this product soooo worth the money!<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "piggybaby":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"21 Oct 2016",
         "title":"smudges bad",
         "description":"after reading all the good review, especially the ones from Asians, I had a hope on this mascara.\r\nBeing an Asian with no eye lid crease(if you are an Asian, you know what I mean.), smudging is always a problem for me.\r\nI was just out of my fabulous Korean waterproof mascara, so I ordered this one, hoping it will work for my eyes. \r\nBut 2hours after I applied the mascara, my eyes became panda. Not just underneath of my eyes, it smudged above the eye line too.\r\nI am sending this back.…read more"
      },
      "younice":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 May 2014",
         "title":"My go to mascara. Pricey but worth it. I've tried a ton of mascaras for my lashes and this is the only one that works for me. I have the kind of asian eyelashes that are straight and grow straight down. This keeps my curl and doesn't weigh down my lashes!",
         "description":""
      },
      "danacab27":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 May 2015",
         "title":"smudging",
         "description":"I used to love this but something happened to the formula over the last couple of years...it goes on nicely but after a few hours it smudges on the under eye :(\n\nnote: I only put mascara on my top lids\n\nI switched brands and no longer have the problem so it was definitely the mascara\n:("
      },
      "yura":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Jun 2012",
         "title":"Great product",
         "description":"this thing gives lots of volume to my short lashes. it lengthens too. But the brush is to big, so it could make lashes clumpy and its hard to control the brush. If you like your lashes to be seperated, this wand wont work. It does not smudge and make my eyes itchy. Overall, it works great! I love this mascara."
      },
      "Six2Soho":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Sep 2009",
         "title":"Amazing for Asian Lashes",
         "description":"This is by far my favorite mascara. Given that I have Asian eyelashes that are sparse and hard to curl (using Latisse for this), DiorShow makes my eyelashes bold and lengthy."
      },
      "jxxc":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"11 Jun 2009",
         "title":"Not for my Asian eyelashes",
         "description":"I've wanted to try the regular DiorShow mascara for a while, but haven't because I can only use waterproof mascaras on my short, straight, downwards-pointing Asian lashes - regular mascara seems to weigh my lashes down and negate any work from my eyelash curler. Anyway, I was so pleased when this waterproof verion came out - unfortunately, results were mediocre. It did not lengthen or thicken my lashes any more than many other mascaras that I've tried (my current fave is Lancome - Hypnose waterproof). It does stay on well though, I'll give it that.…read more"
      },
      "madioooch":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"9 Dec 2009",
         "title":"Lush Lashes Every Single Day!!",
         "description":"Hands down, the very best in mascara!! So rich, you actually have to dab some off as you apply! Makes your lashes look like they've grown 3 times in length! LOVE this product- totally worth every penny."
      },
      "OhMyMariel93":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"17 Oct 2016",
         "title":"Not Impressed",
         "description":"I've used this formula for years, but as of last week I lost interest. I am not sure whether they changed the formula or I had a bad batch but my product began to dry up on the bristles within two weeks. I had to return this product for a full refund."
      },
      "makeup1sfun":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"15 Sep 2012",
         "title":"Love, but dries out",
         "description":"Adore this mascara, but I find that it dries out in the bottle much more quickly than other mascaras I've used, which means it gets clumpy and and doesn't look as good.\n\nHowever, I love the mascara enough that I'm still debating whether to stick with it despite having to replace it more often.\n\nWhy I love it: intensifies lashes with 1 coat but still looks appropriate for work. Can build intensity with more coats. Stays put all day - doesn't result in \"racoon eyes\".…read more"
      },
      "genacali":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"16 Sep 2008",
         "title":"WOW-POW-ZAZOW!",
         "description":"Before I started using Dior's mascara I had used just about everything----and I mean E-V-E-R-Y-T-H-I-N-G... I had also spent a small fortune looking for a product that would lengthen my lashes, as well as make them fuller without causing them to clump. Never have I encounter a mascara that does it all until the DIOR waterproof line. I have tried them all and none can hold a match to the powers of DIOR. WOW-POW-KAZOW!…read more"
      },
      "seaspark":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"8 Aug 2009",
         "title":"beautiful at first, then raccoon eyes",
         "description":"This stuff really does add length, volume, and definition, but it also smudges after a few hours. I got it when we were having a heat wave and assumed the wax was melting in the high temperatures, but it did it again yesterday when it was cool and cloudy. Raccoon eyes are not my thing."
      },
      "Kkeeiikkoo":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"3 May 2009",
         "title":"SMUDGEY SMUDGEY",
         "description":"I usually get the non-waterproof kind - which I LOVE - but it smudged a little so I thought I'd give this a try. Some how despite being waterproof it smudged ALL OVER - ALL DAY, I had to constantly check up my make up status so I didn't walk around looking like a raccoon.\n\nAnd on top of that - the application is no where near as good. It still lengthens, but volume = negative points. Made me look like I had 8 really long spidery lashes sticking out.\n\nAweful stuff, I will be returing it ASAP, and going back to the non-waterproof kind.…read more"
      },
      "dfrench":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"24 Nov 2013",
         "title":"Nothing Great",
         "description":"I tried this Mascara because of the great reviews. And I was a bit disappointed. In my search of a great mascara, I rate this one average. I goes on really well, no clumps, great brush separates the lashes. But by noon, I have black smudge on my bottom lashes. Quite disappointing as this is a waterproof mascara, and they should be better wearing then that. My search will continue, to find a great mascara, I will not give up. :)…read more"
      },
      "shellyd":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"15 Sep 2013",
         "title":"Leaves Racoon Eyes",
         "description":"I've been a makeup user for twenty years. I never rub my eyes during the day. This product leaves me checking my under eye area EVERY time I use the restroom. By days end, I always have very visible semicircles under my eyes. Not made for deep set eyes. Very disappointing. I'd return it if I hadn't lost the receipt."
      },
      "Ativanity":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Feb 2014",
         "title":"if I could only use one makeup product...",
         "description":"this would be the one. I love mascara, and I've tried a lot of different ones, but this is my holy grail. It's very black and only really needs one coat, but builds well if I want more dramatic lashes. I also find that if I powder the skin around my eyes thoroughly, it lasts a long time without smudging or flaking. There's no scent and it's actually waterproof- I've cried with this stuff on and my eye makeup was still perfect after I dried my eyes. It's pricey but there's plenty of product to last for months (longer than you should really keep using the same tube of mascara, really). I'd highly recommend it to anyone looking for a dramatic mascara that lasts.…read more"
      },
      "KateKat13":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"18 Oct 2013",
         "title":"I quite like this mascara I just don't love it. I love that its waterproof but it does tend to smudge under your eyes after a few hours. Also, it degrades quickly and you have to replace it quicker than I would prefer.",
         "description":""
      },
      "mychoi":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"8 Jun 2013",
         "title":"Smudgy",
         "description":"First off, I'm asian with monolid asian eyes. on top of having monolids, I have very oily lids and regular mascara is too smudgy for me. Also, I tear up and water easily, so I figured it was time for a change. This mascara is definitely very lengthening. It was the best lengthening waterproof mascara I have tried. However, within an hr of application, it would smudge! All over my upper lids and lower lids ...\nI don't blame the product. I blame my eyes because there are so many others who have fallen in love with this mascara and it works very well for them.…read more"
      },
      "celiza9":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Mar 2014",
         "title":"learn to love it",
         "description":"perfection is realistically nonexistent, ephemeral at best. and you thought $25 would get you there...\nthat said, if you find a better mascara, call me because YOU WON'T.\n\ndiorshow spreads and defines my individual lashes like nothing else. its layering capabilities are la crème de la crème. as it sets throughout the day, the formula only turns more natural and beautiful--like a french woman, this mascara ages with grace.\n\nit is less \"waterproof\" than drugstore brands, which took some getting used to. I now enjoy that removing mascara at night doesn't feel like tearing up asphalt.\n\nmaybe when we live in a synthetic dystopia scientists will have engineered a better mascara. till then, we've all hit the cosmetic glass ceiling. join the club.…read more"
      },
      "4everalady":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Jul 2011",
         "title":"Water/Ocean/Sweat Proof!!",
         "description":"I wore this in Jamaica in and out of the pool, the ocean, etc and no raccoon eyes. It came off easily with eye makeup remover. The only issue some might have is that the brush is very thick and doesn't do much to lenghten, besides that, I loved it!"
      },
      "ShellyC77":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"26 Mar 2017",
         "title":"Great but then disappointing",
         "description":"Made my lashes look amazing, was testing out new mascara for my wedding and I'm glad I have been trying first. While I had bomb lashes for hours, I also had melted rings under my eyes. Waterproof this is not :("
      },
      "MakeupGirl19":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Jun 2013",
         "title":"Very satisfied!",
         "description":"This mascara delivers everything it says it will! The true test that many will appreciate was when I got ready for my day (bronzer, blush, eyeliner, mascara). The twist was that my boyfriend decided we were heading to the beach with the dogs. Absolutely annoyed that I wasted time putting makeup on for the beach, we went, and hours later my lashes were perfectly curled and my mascara hadn't moved at all! For someone who has very soft, long lashes that need a great curler/waterproof mascara combo to stay curled for long, this was a treat! I also had zero issues removing as I think some had, so that's no problem! Absolutely amazing!!…read more"
      },
      "SherDC":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 Aug 2009",
         "title":"AMAZING!",
         "description":"I usually find that drugstore mascara (I usually use Maybelline Great Lash) only really starts to get good (ie, thick & \"goopy\" with some staying power) after a month or so of use -- before then it's too wet and uncurls your lashes. THIS stuff is amazing, though! First use, it was thick and really made my lashes pop. They were long, dark black and held their curl all day. And it really is waterproof, it's great. I was going to save it for special occassions (I only bought it -- it's more expensive than I would have liked -- because I'm getting married next month) but now I have to use it every day! The tube is pretty big so I'm hoping it will last a long time as well. Hands down, this is the best mascara I've ever purchased. Mascara is my one \"must have\" beauty item, so I've tried a lot of them. This stuff rocks!…read more"
      },
      "mimichan78":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Jan 2012",
         "title":"Amazing curl!",
         "description":"I just used this mascara for the first time this morning and I am SO happy with it! Being half Japanese and having inherited the poker straight lashes, I've always just settled with not-so-curly lashes. I always use an eye lash curler, but with my previous mascaras, after the second coat a lot of the curl would be gone. With the DiorShow Mascara, my curl stayed even after the second coat! I am hooked!!!"
      },
      "suzizack":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"5 Mar 2009",
         "title":"Best Mascara I have ever used",
         "description":"Dior Show waterproof mascara is the best I have ever used. I generally Never pay big bucks for mascara. But I tried this one a few yrs ago on the reccomendation I read on a forum.\nI have very sensitive eyes , rosacea. 99% of mascaras flake on me.. even the waterproof ones. But this one stays on perfectly.\nIt gives me very beautiful lashes too. I have long lashes but now at 61 1/2 they are thinner, and less curled.\nThis mascara thickens them just enough to not go overboard for my age ( one coat is all I use) and it helps to curl my lashes without a curler.\nI can remove the mascara with the cleanser sold on sephora or jojoba oil.\n\nThis is worth the price simply because I have No eye irritation .…read more"
      },
      "youidiotkid":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"20 Feb 2015",
         "title":"What happened?",
         "description":"This used to be my holy grail mascara. It was super waterproof, didn't clump, made my lashes look voluminous. I recently repurchased, and it's all wrong now. My lower lashes smudge without fail, I have to be extra careful to prevent clumping, and my lashes look nowhere near as nice when using this. The brush doesn't look as plush as it used to be, either, which might be the reason for the clumping. Maybe it's just me, but I've been using this mascara exclusively for 3 years with no problem until now.…read more"
      },
      "babybiird":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"30 Jul 2012",
         "title":"It's ok",
         "description":"I wanted a waterproof mascara in brown, this was the only one I saw. It's ok. It doesn't hold up in a pool, but it did survive a day at the beach."
      },
      "BeepBlend":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Apr 2014",
         "title":"Holy Grail",
         "description":"Cannot stop myself from going back to this little gem.\nI am always curious to try new mascaras, but regret it as soon as I see that no other mascara can compare!\nIt saddens me that the formula does dry out two months after opening, but I do use it every day and apply multiple coats. You can revive the mascara by just dipping the tube in hot water for a minute. After that, you can stretch any mascara's life by at least a couple of weeks."
      },
      "JustWendiJ":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"4 stars",
         "date":"23 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838896+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Brown",
         "description":"Wonderful everyday mascara."
      },
      "sweeteyes55":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"7 May 2012",
         "title":"In love with this mascara.",
         "description":"I bought the black waterproof mascara and I've used it for 6 months. I have Asian lashes that are medium in thickness and they grow straight down. Since my eyelashes don't curl with any mascara with out an eyelash curler, I wasn't expecting much from this one to perform that well. I don't care much for lengthening to be honest. I'm more so the kind of gal who is in love with big, thick, curly, voluminous lashes.\n\nWaterproof Mascara in Black: The fragrance is a bit strong but my eyes aren't sensitive so I got use to the smell. The smell is pleasant just maybe too much for a mascara. The brush itself was amazing. The big dense brush definitely picked up all my lashes and in two coats I had beautiful natural eyelashes. Thickening was pretty good and the ability to hold a curl was FLIPPING amazing. Never in my life I've ever used a mascara that was able to curl my lashes without an eyelash curler. That alone sold me the product. Even though the price is kind of steep, I will definitely splurge on this product when I get the chance.\n\nFinal Remarks: When I don't feel like buying a department store mascara, a drugstore mascara that I always stand by is L'oreals mascara in Voluminous carbon black in waterproof. DiorShow mascara is basically that but 10X better. My only con for this product is that its hard to coat the bottom lashes without it touching the skin, other than that it's love.…read more"
      },
      "Hope4Peace":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 May 2010",
         "title":"WATER ARMOR",
         "description":"I'm a swimmer...2-3 hours per day. DiorShow Waterproof Mascara is like ARMOR for lashes. No smudges, no smears, no problems......\njust beautiful lashes!"
      },
      "AnalyseP":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"16 Jun 2014",
         "title":"Not impressed",
         "description":"I've heard so much about this mascara so I treated myself for my birthday. I was do disappointed. My lashes do not stay curled and with this mascara no change. I will stick to my drugstore mascara. Not really worth the money."
      },
      "smurffchick":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Sep 2008",
         "title":"AMAZING",
         "description":"This product is so AMAZING! For me it has been so hard to find mascara because my tips are blonde and this mascara covers wonderfully, I never have to use an eyelash curler because it curls amazingly. I get amazing coverage from root to tip and I never have to use a lash comb. If you do accidently make a mistake you can just use a q-tip with some water to correct it as long as it is still wet. If it has dried just use Philosophy brand PURITY one-step facial clanser on a damp q-tip. This is the best waterproof mascara out there, I mean if it can get me through break ups and my sister's wedding, it wins it my book. It is pricy, but well worth it. You just can't beat a brand like DIOR!…read more"
      },
      "pamelajean214":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 May 2015",
         "title":"Great product",
         "description":"Nice fluffy brush. Gives great volume. Very black. Very waterproof. great product!"
      },
      "jennifergs":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Dec 2008",
         "title":"I have tried every brand and type of mascara on the market and have hated them all. The only reason I purchased Diorshow was because it was the first product I came to in the store. I will NEVER use another type of mascara again. In 5 years, this has been the only mascara that I've used. Diorshow waterproof mascara stays on all day, it doesn't flake, it doesn't clump. It looks completely natural...only better. It's simply the best mascara on the market.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "secretshopper":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"21 Apr 2010",
         "title":"Very disappointing",
         "description":"Unless you have time to wait for this to dry - several minutes - be prepared for it to cling to your eyelids, you'll need an eye makeup remover to get it off, and several more minutes for the reapplied mascara to dry again. Not for those in a hurry!"
      },
      "abl0":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"19 Aug 2015",
         "title":"Change in formula??",
         "description":"This mascara has always been the ONLY mascara I use. I love it because I have stick-straight lashes and this was the only mascara that I found would hold any curl I make with a lash curler. I recently bought a new one and right after I curled my lashes, applied my new tube Dior Show Waterproof mascara my curls went straight again. All that hard work for nothing :( Is anyone else experiencing this with new tubes?? I'm so sad, now I have to find a new mascara that won't straighten out my lashes after I curl them. Suggestions?…read more"
      },
      "naturescure":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 May 2014",
         "title":"Hands down best mascara",
         "description":"Totally worth the money! No other mascara builds as well as this one. It lengthens and thickens better than any others and I have tried most. Def for that eye popping lush mascara look"
      },
      "Vonbitch":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"20 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Expensive and dry"
      },
      "heidi7":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"31 May 2012",
         "title":"The Ultimate!",
         "description":"I doubt I will ever use another mascara again. I have been going through a mascara crisis lately, trying all sorts of formulas and brushes and always being dissatisfied. Then I discovered Diorshow Waterproof. Perfect! Lush brush, volume without clumps, defined length, exceptional curl, and lasts through a workout. What more could you want in a mascara?"
      },
      "gee808":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"10 Nov 2011",
         "title":"Smudges and dries really quick in tube",
         "description":"I have tried all of Dior's mascaras and this one in particular does give me volume, however I find that it doesn't dry completely therefore it feels sticky and in turn is more prone to smudging. And disappointingly like all of Dior's mascaras, they tend to dry out on me in the tube really really really quick. Overall, I can find a mascara that does the same as Diorshow for a comparable or much less price and be able to actually use all the product. Unless they change the formula or figure out how to keep them from drying out, I probably will not purchase them again.…read more"
      },
      "JennyStu":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"10 Mar 2009",
         "title":"Eh..",
         "description":"Not truly waterproof.. I used it only once on my vacation and noticed it was smearing with no water or sweat! What a disappointment!"
      },
      "cpflygirl":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"20 Nov 2011",
         "title":"Best EVER",
         "description":"I've been using DiorShow for at least 10 years and ALWAYS get compliments on my lashes. As I've gotten older though the curl doesn't stay as long so I now use one coat of the DiorShow Waterproof to set my curl, then supplement with the regular DiorShow. Every once in a while some brand will come out with a competing mascara - there is no competition - I can't imagine ever finding a better mascara. It doesn't flake, doesn't smudge, is truly waterproof, and makes my lashes super long and super lush!! I even love the brush; it's not some ridiculously fancy 'scientifically engineered' frou frou brush that means I have to pay extra. It's just a simple teddybear design with a nice taper that makes it easy to get at the tiny lashes in the corners of my eyes. When people ask about my lashes I am always pleased to reply 'No, they're not fakes, they're not extensions, and I don't use Latisse. I use DiorShow!' I've even tried Dior's other mascaras and keep coming back to this one. It's the best EVER! Definitely my desert island necessity.…read more"
      },
      "eve3":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Dec 2008",
         "title":"perfect mascara",
         "description":"trust me ladies this is what you've been looing for. i have gone swimming with this macara and it DOES NOT run. so for any of you surfer girls out there who still want to look fierce while riding a wave, this is the product for you."
      },
      "KC1959":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"19 Aug 2015",
         "title":"Flaking?",
         "description":"Love the brush... Lashes look stunning...\nBut...\nWhy is it flaking? It's waterproof? It's Dior?\nAfter 2 hours, I had dots under my eyes! Applied 2 coats. Will try 1 and see if it still flakes..."
      },
      "lesleyrh":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 May 2012",
         "title":"Amazing.",
         "description":"I used to believe that drugstore mascara could be every bit as good as higher end brands. I was so wrong. This is, without contest, the best waterproof mascara I've ever used."
      },
      "crlopez2013":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"10 Feb 2016",
         "title":"New formula-NO THANKS",
         "description":"I have been a die hard Diorshow fan for about 6 or 7 years. It has been the ONLY mascara I've used and loved. I purchased a new one in December, as I do every few months, and noticed that the packaging was a little different. Didn't think much of it, but I noticed with every use that I couldn't quite get the same look to my lashes as I had before. Just now learned that they changed the formula, which is supposed to keep it from drying out. However, it does the OPPOSITE. It dried out after a couple uses. The formula is not as a dark black, its not as thick. I don't know why they would change something that was already perfect but I will not be buying this product again unless they change the formula back. What used to be a cult classic is now a DUD.…read more"
      },
      "suezzy":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"2 stars",
         "date":"9 Sep 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Not impressed, the search continues"
      },
      "slim5555":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"25 Jun 2014",
         "title":"Always Great",
         "description":"After decades this is still my favorite mascara on the market, it lasts a long time, does not flake off and gives the lashes a full luxurious look, never clumpy or kewpie doll like these new spidery looking mascaras which seem to be all the rage."
      },
      "jenniep":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jul 2009",
         "title":"Great Stuff!",
         "description":"And it should be great at this price! After my fav brand, Bourjois Pump Up the Volume became seemingly discontinued, I began the search for something to take its place. In the end, it was between this and Bare Escentuals Weather Everything, which is a lot cheaper. But then I noticed that the DiorShow comes in a much larger size than the Weather Everything, and a little cross-multiplication revealed that they are pretty much the same price per ounce. So I went with DiorShow.\n\nI've been wearing this for a few weeks now and I am ready to give my review. I wore this mascara everyday on a recent trip to Barbados. I went on a hike, I went to the beach, I went in the pool, and I even went snorkeling in it (yes, I am just that vain). This mascara did not budge 90% of the time I was wearing it - through water, rain, sweat, etc.\n\nAs others have said, the brush is kind of big, but I don't find it difficult to maneuver. I actually really like the brush - it delivers the mascara very effectively and makes my lashes look thicker and longer.\n\nDefinitely give it a try - it's actually not that much more expensive than its competitors!…read more"
      },
      "ltlblondegirl":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"30 Mar 2015",
         "title":"WHAT DID THEY DO???",
         "description":"This used to be my absolute favorite mascara. They must have changed formulas or something because its now become the WORST mascara I have unfortunately spent money on!! Raccoon eyes within a few hours - positively horrible and definitely NOT waterproof. Spend your $25 elsewhere - I wish I did!"
      },
      "holiday09":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 May 2014",
         "title":"waterproof and volumizing",
         "description":"I don't have a problem with my lashes.. I naturally have lashes. But once in a while I want a mascara that gives me a little \"umph\" to my lashes. This mascara does the job! It is also waterproof.. how do I know? I wash my face during the day(2-3 times, to test the claims) and the mascara doesn't go anywhere.. it stays put on my lashes!"
      },
      "chichaikame":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Sep 2008",
         "title":"The best in waterproof",
         "description":"I love my regular Diorshow, so I thought that I would give the waterproof version a shot for those occasions that some extra staying power was needed. This did the trick! I wore it on Canada day during a huge water fight in which I was sokng wet and literally rubbing the water out of my eyes: my mascara didn't move! I had no flakes, no raccoon eyes and no smudges at all. I was so impressed. I've since worn it to two swimming pools and the West Edmonton Mall Waterpark with the same fantastic results. Plus, it has the same great lash defining properties as the original Diorshow that I fell in love withl.…read more"
      },
      "saelynn":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"28 Jan 2011",
         "title":"So blown away!",
         "description":"I am a mascara guru, and I can't believe I waited so long to try this glorious product! I absolutely love the thick brush, the texture, and the long-wearability. Coming from an emotional pregant woman, the waterproof works well. :) This is now my new, favorite go-to mascara!"
      },
      "lalena1014":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Feb 2014",
         "title":"Go to mascara",
         "description":"I love this mascara and use it every day. I have long lashes that don't curl naturally and this mascara keeps them curled all day. Other mascaras make my lashes \"fall\""
      },
      "emmaviola":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 May 2014",
         "title":"New Holy Grail",
         "description":"This mascara is absolutely amazing, from day 1 I was hooked! It gives my lashes the perfect amount of volume without clumping or having them look spidery, just perfect fanned out voluminous lashes!"
      },
      "almasolo":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Feb 2017",
         "title":"did they change the formula???",
         "description":"This was my holy grail for many years. I have long and thick lashes but they are super straight. This was the only mascara that would hold the curl. I've bought 2 tubes of the mascara in a couple of months and have noticed the formula has changed. As soon as the mascara touches my lashes they just go back down. I lose any curl I had. I thought maybe the first tube was sent by mistake but I just got a second tube and it does the same thing. I for sure thing the formula has changed. Very disappointed.…read more"
      },
      "behielm":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"14 Nov 2012",
         "title":"Pass by this one",
         "description":"My lashes are naturally long so I always look for mascara that adds volume. I was also looking for a waterproof mascara for my wedding and after reading and hearing such amazing reviews on this mascara, I decided to splurge on it. I gave it a good full week, but after that, I couldn’t stand to use it anymore. What a waste of money! It did not live up to what it said it would. It did not lengthen, thicken or curve my lashes. I do NOT recommend this.…read more"
      },
      "robielynne":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"30 Mar 2010",
         "title":"Best Waterproof Ever",
         "description":"I think I like this water proof formula even better than the regular Dior Show mascara. The waterproof goes on smooth not clumpy at all and makes my lashes thick and long with one or two coats. I love the regular Dior Show and use it religiously, but the waterproof ROCKS. No smears, no flakes, no clumps and easy to remove with my regular facial cleanser. If I had to only buy one mascara ever, I would pick the waterproof version over the regular formula.…read more"
      },
      "kirra":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"17 Aug 2012",
         "title":"Disappointed",
         "description":"I LOVE Dior products and use the foundation everyday. However, this mascara did not behave like a waterproof mascara for me. I tried it for a week and it left marks under my eyes. I didn't cake it on and also didnt feel like it made my lashes standout. I really wanted to love it, but just couldn't pay the cost and not see the benefits of waterproof. Maybe it was a bad batch? :("
      },
      "ariannab":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Jun 2014",
         "title":"go-to mascara",
         "description":"This is by far the best mascara I have ever used. My eyelashes are normal length but straight, and this fans them out and provides volume and without clumps!"
      },
      "lovesttropez":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"13 Oct 2012",
         "title":"Disappointing",
         "description":"Tried this mascara a little while back and was very disappointed overall. I did find that it was very black and did give the visibility of longer lashes. That said, there was too much clumping (something you wouldn't expect to find at this price range), making application less than appealing. Honestly, the product would mostly transfer onto my lashes in clumps, and would leave them sticking together. Horrible. Also, this particular mascara felt very dry on my eyes and irritated them a lot (itching, tears). Gave it a good few weeks hoping my eyes would adjust to it, but never did. Sadly, the disappointment continued when the mascara dried out too quickly in the bottle, leaving me with little to any product to use. Wouldn't recommend this based on my experience.…read more"
      },
      "eden70":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Feb 2017",
         "title":"The wand was very bulky and awkward to use. I ended up with product all over my lids. \nThe product needed several coats to build up any volume. \nIt wasn't waterproof. I put it on. Waited an hour and took a shower. Major raccoon eyes. This is going back to the store.",
         "description":""
      },
      "nmk4723":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"4 Nov 2013",
         "title":"Unfortunately, this mascara still smudged when I wore it despite it being waterproof. I have this problem with a lot of mascaras, so if you aren't prone to mascara smudging under your eyes, this may be the one for you. It did make my lashes look quite full.",
         "description":""
      },
      "makeupaddict196":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"3 Mar 2014",
         "title":"HG mascara!!!",
         "description":"This is my fifth Diorshow mascara but my first waterproof, and I'm so sad my last four weren't waterproof. I have a terrible time making my eyelashes stay curled, hence my preference to the waterproof formula, and i had just purchased a different waterproof mascara and hated it, but this really renewed my faith in mascara. It made my lashes look fuller and fluffy and my curl hasn't moved all day, not to mention it held up through some pretty messy crying.\nWell done Dior!…read more"
      },
      "pepmom":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"15 Jul 2015",
         "title":"Smudge City!!",
         "description":"In my never ending quest for a truly waterproof mascara, I purchased this based on all the rave reviews, only to be shocked when I got home after my first wearing to find the dreaded raccoon eyes I've been trying to avoid. I couldn't disagree more with the good reviews for this product. It is light going on, not very build able and most certainly NOT waterproof. Waste of money."
      },
      "ainee":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"21 Apr 2016",
         "title":"not impressed",
         "description":"It didn't give me the length and volume as I had with other brand. I used it couple times, and I had dark black mark under my eyes and on my eyelid. This was happen when I was in AC's room or even when I am sweating or on the heat. I am very disappointed."
      },
      "lepard":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"12 Sep 2009",
         "title":"super fab mascara",
         "description":"this waterproof mascara does not dry your lashes out. It is very moist and makes lahes voluminous. Does not flake throughout the day. Just a great mascara"
      },
      "lillehammer":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"3 Aug 2011",
         "title":"AMAZING!!! I've been using this mascara for years, tried different waterproof mascaras but none of them compare to this one! I recommend it to everyone!!",
         "description":""
      },
      "Dmartin80":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"15 Feb 2017",
         "title":"love it",
         "description":"I love the formula but the brush is too big!! It gets all over my lids"
      },
      "livelynotion":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Jun 2009",
         "title":"A-mazing.",
         "description":"I've tried my share of mascaras, but none of ever had the perks of an already great mascara (curling, lengthening, volumizing) combined in a waterproof version. DiorShow was my favorite, but after trying this, I think I've been persuaded to change. This mascara seriously lasts through anything--I've been at the beach, and it has lasted from morning until way past midnight. I haven't had any problems with clumping, which is usually my main concern, since I have thin lashes. I would recommend this to anyone.…read more"
      },
      "telephonegoddess":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"19 Jul 2009",
         "title":"BEST MASCARA EVER",
         "description":"LOVE this mascara. I've tried everything anf this work the best for me."
      },
      "empogo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Dec 2013",
         "title":"Perfect for eyes that get itchy",
         "description":"I've been using this mascara since... 2004? Something like that, I can't even remember. Not only does it create gorgeous, long lashes (I always curl them first), but it stays put through horrendously humid weather in South Florida and the Caribbean, where I work long days outdoors as a wedding photographer. This is the only mascara I've found that's not only sweat proof, it also *doesn't make my eyes itch*. I'm a contact lens wearer, but even when I don't have my lenses in most waterproof mascaras make my eyes itch intolerably.\n\nI've tried all the different samples Sephora has given me over the last decade, and none of them live up to this classic gem.…read more"
      },
      "mychelle":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Sep 2011",
         "title":"CANNOT live without this",
         "description":"I have been using this mascara for over 4 years (yes it's about time for a review) and I honestly can't see a reason to ever switch to a new mascara. This does it all, lengthens, coats every single little eyelash, no smudge, volume. And even using this on its last leg (say like 6+ months after purchase) it STILL works great. For being asian I have pretty long eyelashes and this just works like a charm/dream! However if you are asian I recommend only using the waterproof version. I have tried the regular one and the curl just does not hold so I have just stuck with the waterproof and it does the trick. Holds curl until you're ready to take it off.…read more"
      },
      "enajnomrod":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"24 Jul 2012",
         "title":"worst mascara ever",
         "description":"This product is useless. I wanted a non-clumping waterproof mascara. This product clumps right out of the package, and if you have the slightest bit of grease (make-up, eye cream, skin oil) you get instant raccoon eyes. But true enough, it won't wash off!!"
      },
      "SGood":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"2 Apr 2014",
         "title":"Good",
         "description":"Love the mascara, Hate the brush. The brush is too big and thick. However, once I started using a brush from another brand, I really liked this mascara. No flaking, no raccoon eyes. My eyes water a lot and I work outside, this mascara stands up to that yet can be removed easily."
      },
      "dreamyone":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"13 Apr 2010",
         "title":"JET BLACK - A  GREAT BLACK WATERPROOF MASCARA",
         "description":"I have very thick long lashes, and have had a problem finding a mascara that lasts more than three weeks, even with only one coat. I keep trying mascaras, hoping to find one that lasts longer, plus has a waterproof version just as good. I came back to this mascara (both waterproof and non-waterproof), because I haven't been able to find another one that lasts longer. Having to replace a tube of mascara every few weeks can be rather expensive, which is why I keep trying. I might find something that seems really good, but then the tube might not make it even three weeks, and I just don't want to pay that much money on a regular basis. I have friends who can go two months on a tube of mascara.\n\nHaving used this in the past, I knew it does an awesome job defining my lashes. The brush is good - it gets most of my lashes with one coat, and I go back and get the rest with a spherical brush. This brush is well designed to reach even small lashes. It gives me a well defined excellent effect. The staying power of this mascara is really good, and I wear it when I know I'll cry - weddings, graduations, water sports, sad movies... This mascara is great and creates some serious lash definition. The only reason I stopped wearing this was that the non-waterproof version didn't last long enough, and I ended up trying other things. A lot of other things...\n\nWell, I'm back to this mascara for day wear when I need a waterproof mascara. (I like the Iconic at night when I want my lashes to fan out).\n\nThis is an excellent mascara. It lasts a very long time once applied, doesn't smear or smooth, and it doesn't run when I cry. I'm really pleased with it for my long lashes. I have friends who have very short sparse lashes who use this, along with the non-waterproof version, and it does awesome things for them, so I know this works for me, with my long lashes, and for them, with their short ones. It's really good and it's dependable. I highly recommend this mascara when you need one that's waterproof.\n\nPS Waterproof mascaras are supposedly healthier, anyway, compared to their non-waterproof versions. because product doesn't rub off on skin or get into eyes.…read more"
      },
      "meganr12":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"6 Apr 2013",
         "title":"Love!",
         "description":"I've been using this mascara for about 8 years now. I absolutely love it! It does not smudge at all. Someone asked me the other day if I was wearing false eyelashes! I have blonde hair and very light eyelashes, and a few coats of this works wonders. Will not come off unless you want it to!"
      },
      "sephoraaddict99":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"2 Aug 2011",
         "title":"Stays on very well...",
         "description":"This is my standby mascara. I've been using it for over three years and highly recommend it. When applied first in a downstroke and then up, your lashes look very full and long without a lot of clumping. Because it is waterproof, you need makeup remover, or some heavy scrubbing, to remove it entirely."
      },
      "Gabbylicious":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Jun 2009",
         "title":"WOW!",
         "description":"I had heard that this mascara was THE mascara from multiple magazines and so when it was time to get a new mascara I decided to try it.\n\nIt really is spectacular; it lengthens, volumizes, curls and separates significantly. It doesn't clump and it stays put - you will definitely need a waterproof makeup remover because regular makeup remover will not work. I cannot apply mascara without getting it all over my eyelids, but this formula rubs right off my skin without leaving black streaks, no makeup remover required.\n\nBe aware that it will look a little shiny when wet but it mattes as it dries so your lashes actually look pretty natural, aside from being dramatically longer and thicker.\n\nPS - If you really want your mascara - any mascara - to go on super easily and smoothly, warm it up while you are doing your hair and the rest of your makeup by putting it in your bra next to your skin, or slip it between the waistband of your pants and your skin. Warming the mascara this way makes it glide on much more easily.…read more"
      },
      "naomig":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"12 Mar 2009",
         "title":"Fabulous! Maybe smudgy, but FABULOUS.",
         "description":"I've tried a lot of mascaras but, even as a poor graduate student, refuse to give up diorshow waterproof. A word of caution though, when I wear sunscreen (frequently, of course) or a lot of moisturizer under my eyes, it will smudge. I've noticed this more with my most recent tube. Maybe the newer stuff is more smudgy?"
      },
      "catneon":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"23 Apr 2012",
         "title":"Good quality everyday workday mascara",
         "description":"I have normal lashes and this gave me nice thicker fuller lashes with no clumping that looked naturally thicker and beautiful all day I really love the brush. It didn't give me the curved lashes and I have gotten more length from other mascaras.\nI never buy mascara that isn't waterproof and for anyone wondering the Sephora waterproof eye makeup remover is the bomb to take this off!!!"
      },
      "MMoore66":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"17 Feb 2017",
         "title":"what happened to the old formula?",
         "description":"I've been trying other mascaras but none gave me the diorshow waterproof/never fails results.. well apparently that's in the past. Racoon eyes, dry formula and zero volume.\nWhat happened?!"
      },
      "laurenrenee333":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Oct 2013",
         "title":"Best mascara I've ever tried",
         "description":"This mascara lengthens, thickens, and holds curl like no other mascara I've tried. I usually curl my lashes, then apply mascara. Other products instantly lose the curl I've just obtained with the eyelash curler. Not this one. This mascara holds the curl and gives me knock-out eyes.\n\nI was worried that it would be harsher on my eyelashes because it's waterproof, and a lot of people say to only use waterproof mascara for weddings or swimming for that reason. However, as long as you use a good eye makeup remover (Neutrogena or baby oil) that isn't rough on your eyes, you'll be fine. I have not yet been able to find a non-waterproof mascara that provides all the benefits that this one does.…read more"
      },
      "arianac82":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Aug 2016",
         "title":"Amazing",
         "description":"This is the only mascara that has ever worked for me and believe me I have tried lots. My eyelashes are super thick and no other mascara has kept them curled like this one has. Totally worth the money!"
      },
      "sophiamichelle":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"6 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"HOLY GRAIL MASCARA"
      },
      "RuthieKat":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"31 Oct 2013",
         "title":"Great if you love thick lashes.",
         "description":"I used Benefit's \"Bad Gal\" mascara for years but decided to try something new because it seems like their formula is not as thick or they don't give as much as they used to. I tried Benefit's \"They're Real\" waterproof mascara (Sephora's best selling mascara), I didn't like it. It was too sticky and after a few coats all my eyelashes were starting to stick together and it gave me that crooked spider leg look which didn't look or feel good.\n\nI came across this \"Diorshow\" mascara by Dior and what caught my eye at first was the thick brush, I must have a good thick brush like this because I like to layer on mascara until I get the perfect thickness. I had to get waterproof because that's all the had. I usually don't use waterproof because I find it stickier and it doesn't layer as well but if that's my only option I'll get it.\n\nI really love this mascara because it applies nicely, has a good thick formula, lasts a long time, has no weird or strong smell, and is a dark black. If you get a little on your face or hands while applying, it comes off easily. I use make-up remover wipes to get it off my eyelashes at the end of the day and it comes off quick and easy. Next time I going to try the non-waterproof but I'll defiantly be buying this again. It's replaced my other mascaras and it's my new favorite!…read more"
      },
      "Kristenapril":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Feb 2015",
         "title":"I have been using this product in the normal formula for a few years now. I absolutley love this mascara! It glides on very smooth and with a few coats thickens and lengthens very well. I decided to get the waterproof just incase of a heavy rain storm :-) Love it!",
         "description":""
      },
      "scrippsk":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"20 Aug 2016",
         "title":"Waterproof through workout and shower!",
         "description":"This mascara isn't clumpy, it adds length and volume, and it stays put without giving me raccoon eyes or making lashes stick together through a 40 min. sweaty workout and a shower (I kept soap away from my eyes and avoided rubbing them much but otherwise washed my face normally). Amazing! I can apply in the morning and don't need to worry about raccoon eyes or reapplying until night, even if I go to the gym mid-day. I haven't tried but am confident I could swim in this. Not too difficult to remove at night with some oil-based makeup remover. (For that reason, if you have oily skin/eyelids, I could see the waterproof qualities being diminished.)…read more"
      },
      "Fondlepatterns":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"13 Aug 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838771+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Blue",
         "description":"I've found THE MASCARA !"
      },
      "ShaniceLau":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"10 Apr 2016",
         "title":"Bad Macara",
         "description":"I have dead straight eyeleashes, im always looking for mascara that is waterproof so it can hold the curve. This mascara can hold the curve pretty well. BUT it smudges EVERYWHERE. And the brush head is real big makes it hard to apply."
      },
      "Mistydale":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"24 Jun 2010",
         "title":"Best Mascara ever",
         "description":"Dior Show\nThis should be the ONLY mascara on the market! It is the best no clumping, I love it"
      },
      "dhoffman77":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Aug 2010",
         "title":"Great Length",
         "description":"This mascara has gives great length and the staying power is incredible! I used to use Blackout, and it is just too wet and messy. This is my new fave!"
      },
      "Andrea53":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"20 May 2012",
         "title":"Love",
         "description":"This is my go-to mascara. Amazing for every day, or do an extra coat for night time."
      },
      "SNS23":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"20 Mar 2016",
         "title":"Disappointed",
         "description":"Very disappointed in this product.  Claims to be a waterproof mascara and is a complete joke.  I have had drug store products stay on better than this but this mascara was recommended to me when I went to a sephora store looking for a waterproof product."
      },
      "lovebug90":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"22 Dec 2016",
         "title":"sadly not a fan",
         "description":"sadly this mascara didn't live up to its name for me. I bought it because my friend recommended it to me and I have really oily eyelids so I thought it would work but it didn't. Not waterproof or smudge proof at all. I really wish it would have been it made my eyelashes look great but after about an hour it smudged all under my eye as well as in the corner."
      },
      "chrstna":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"17 Aug 2012",
         "title":"BEST EVER MASCARA",
         "description":"I don't even know why other companies even bother to make mascara. This is the best mascara hands down. I would give it 20 stars out of 5. I tried to replace it when I wasn't able to get to a Sephora and there is nothing as good. I look like I have professional false eyelashes on and eventhough it is waterproof, I can easliy remove it."
      },
      "KSarah":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Sep 2008",
         "title":"Best Waterproof Mascara!!",
         "description":"I have tried a million different mascara, from drugstore to high-end brands. This is by far the best I've tried. It has a big impact and stays put. Also I like the fact that it's not flaky and my lashes are still flexible."
      },
      "tootsie03":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Jul 2009",
         "title":"Love it!",
         "description":"Dior Show Waterproof Mascara is awesome. At first, I was a little nervous becuase the brush was SO big. But once I got used to it, I fell in love. The effects are great and it is definitely waterproof! Worth the money...especially for those \"special\" days."
      },
      "collegegirl188":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"13 Mar 2012",
         "title":"Volume",
         "description":"I LOVE THIS MASCARA! It truly is waterproof. No flaking throughout the day. It volumizes my lashes. No need for an eyelash curler; lashes stay up all day. Just use a good makeup remover and it will come off easily; I use Philosophy Purity wash."
      },
      "lorisa77":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"14 Jun 2009",
         "title":"Wow lashes, but not so waterproof...",
         "description":"I get the biggest, longest lashes with DiorShow. But it smudges down my face by lunch time. Big lashes cute - racoon eyes not so cute."
      },
      "ilovemn":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"6 Dec 2009",
         "title":"Amazing!",
         "description":"I am of scandinavian descent, so I have very light eyelashes which happen to be short and thin. I have tried so many mascaras and they have either lengthened or volumized but never both. This mascara does both and also doesnt clump or leave my lashes crunchy. I havent experienced the flake problem other reviewers have commented on. I will buy this mascara again!"
      },
      "twil":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"7 Jul 2010",
         "title":"too heavy for curled lashes",
         "description":"i needed a great waterproof mascara for a wedding and was told this mascara was best. weeks before the wedding i decided to try it. I curled my eyelashes as usual and by the time I had finished putting on the mascara, my curled lashes started to sag. needless to say i returned the product"
      },
      "tgold22":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Aug 2012",
         "title":"Love waterproof Diorshow more than the regular!",
         "description":"I have tried almost ever type of mascara available at sephora, other beauty stores/counters, and drugstores. I love the original Diorshow mascara but was noticing that even with my dry skin it was smudging a lot so I decided to give the waterproof a try, boy am I glad I did!!! There has only been one other mascara that I loved in waterproof more than the non, but it still doesn't compare to this! I've got almost all of my friends (ranging from 24-50+) hooked on these mascaras, this just happens to be my personal favorite. I naturally have full, long lashes but they are light in color- this makes it look like I'm wearing false lashes, and not in a bad over the top way. I can't tell you how many compliments I receive wearing it! If you don't like the regular, give the waterproof a try, and vice versa :)\nGood luck!…read more"
      },
      "maya719":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Jul 2010",
         "title":"Amazing",
         "description":"I am in love with this mascara. I have really oily skin just underneath my eyes (rest of it is combination, so much so that I stopped putting on eyeliner on the bottom) and have been searching for years trying to find a mascara that stays put. I've searched both waterproof and not, but this mascara (I'm staying with waterproof just to be on the safe side) tops it all. It doesn't clump, it's lengthening, thickening, curving and doesn't give me horrible raccoon eyes! Now if only I can find an eyeliner that does the same...…read more"
      },
      "Lizzratt":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"11 Sep 2008",
         "title":"WOW",
         "description":"This is my new favorite mascara, though I'll use the regular for days I don't need waterproof.\nGot this one for the Wedding day so I don't cry my makeup off. I used it to test it out and WOW! It found lashes I didn't know I had.\nSeparated them beautifully and filled them out, lengthened them too.\nThis is, by far, the best mascara I've ever used."
      },
      "wearwithall":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"2 Jul 2015",
         "title":"Raccoon eyes, but lovely lashes",
         "description":"I want to love this so much because it makes my eyelashes look so nice. It just doesn't stay put throughout the day though. I was expecting waterproof mascara not to budge, like the other waterproof versions of Diorshow, but something about this particular formula gets all over the place. I end up looking like a raccoon before I've even had lunch."
      },
      "cbezanson10":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"18 Mar 2015",
         "title":"Worst mascara I have ever purchased!!!",
         "description":"This mascara is just awful! I splurged and researched extensively to find a great mascara and thought this one sounded great. It's clumpy and leaves raccoon eyes in a matter of 2 hours after application."
      },
      "lmmarti":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"12 Sep 2012",
         "title":"not worth the money",
         "description":"I love dior extese mascara, but this one was NOT waterproof, I kept getting raccoon eyes and had to constantly check to make sure I wasn't running or smearing. I plan to return this."
      },
      "evilbee":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"22 Mar 2016",
         "title":"Beautiful but smudges under eyes",
         "description":"This made for some beautiful full lashes, but I found it smudged quite severely under my eyes by mid-day. Very disappointing and renders this mascara useless."
      },
      "glamrunnergirl":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Nov 2013",
         "title":"The best!",
         "description":"I've returned to this mascara after years of trying others out. It really is the best. I love the big fat brush. One coat is enough, but it can be layered for more impact.\nI wear it everyday! It's the only mascara that makes my skimpy lashes look so.....WOW!"
      },
      "PaigeWester":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Mar 2013",
         "title":"I am in love with this mascara!! I love how big the brush is and the formula is great. I was also really surprised at how much product you get for your money. The tube is a lot larger than I expected, which was a nice surprise for how much this is. Money well spent! I can't wait to buy the Iconic next and layer the two together!",
         "description":""
      },
      "BBMOON":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Jun 2009",
         "title":"DiorShow Waterproof Mascara",
         "description":"It brushes each of my eyelashes and you can also feel soft when you do mascara. It's not good for who want volume but If you want daily and like natural soft make up, I'll suggest this product for you..! I recommend to try the products before you buying them.. :) !!"
      },
      "GimmeCandy":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Sep 2008",
         "title":"Awesome",
         "description":"This has become my holy grail of mascara. I have used it & then tried other brands but keep coming back to this - nothing beats it. My lashes look longer & fuller. It stays put & doesn't come off until I wash it off. A must have in a beauty routine!"
      },
      "oldinnewmexico":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"21 Jan 2013",
         "title":"This product does not live up to non smearing. When I wear this by 10am I will have the typical raccoon eyes from it wearing off. Do not buy this product if you have issues with oil under your eyes. Promise you will not be happy.",
         "description":""
      },
      "mhua86":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"11 Aug 2011",
         "title":"Favorite Mascara",
         "description":"I've been using this mascara for several years. It lengthens my eye lashes and the amazing thing is that my lashes don't clump together and they stay soft after application. Most other mascara that I've tried make my lashes stiff and clump together. It doesn't come off even in Bikram Yoga with all the sweat. It's great!"
      },
      "katx":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"7 Sep 2011",
         "title":"Love it",
         "description":"Let me start my saying I have stick-straight, short asian eyelashes. I use a Shu Uemura eyelash curler and this stuff, and I love how my lashes look when I use them. They look full and long and dark, but not false. Very buildable though - if you apply multiple thin layers, you can build it to your liking. I used to use a primer and mascara to make my lashes look longer. I don't need a primer anymore now that I use this. I prefer the waterproof to the regular DiorShow largely because the waterproof helps my eyelashes hold a curl. My eyelashes always fall flat and start sticking straight out with regular mascara. This dries out gradually as does any mascara (maybe a little more so, in part because it's waterproof?) but I use my tubes for six months or so. This last tube I used to the point it was so dry that the brush is matting, and I can still apply it and have great looking lashes, it just takes a bit longer and creates some fallout. Another thing I've noticed with this mascara - It leaves my eyelashes soft and flexible, even after I've taken my makeup off. I found a drugstore mascara that performs comparably overall, but left my eyelashes feeling sticky and stiff during use and brittle and dry after washing it away.…read more"
      },
      "Glitz31":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"2 stars",
         "date":"27 Jul 2015",
         "title":"Diorshow Fails Expectations",
         "description":"I was disappointed with this product. It clumped on the first application and fails to add volume. It smudges especially when applied to the bottom lashes so I use a different waterproof mascara. I will not purchase this product again."
      },
      "lbetan":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 May 2016",
         "title":"Favorite Mascara",
         "description":"I've tried many a name brand mascara, and this is still my favorite! Holds a curl so nicely, and lasts all day with minimal fallout!  Stands the test of gulf-coast weather, too!"
      },
      "KLoves":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"2 Sep 2012",
         "title":"Huge fan of the DiorShow, disappointed this",
         "description":"I am a huge fan of the original DiorShow mascara, but I wanted to try out the waterproof version for times when potential tears, sweat, or other events would lead me needing a waterproof mascara. Unfortunately, I found this waterproof mascara to fall short. It did not go on the same way that the DiorShow did and smudged easily after a few tears. The affect on the lashes didn't seem to be as good as the original either. :(…read more"
      },
      "choney":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"20 Aug 2012",
         "title":"The best",
         "description":"It takes a few coats but I have tried cheap to high end and this is the mascara I ALWAYS go back to!! Curls, lengthens, volumizes, stays put."
      },
      "hugsandloves2u":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 May 2016",
         "title":"works well",
         "description":"It makes my lashes beautiful. It smells great too."
      },
      "westy":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"11 Dec 2008",
         "title":"best mascara",
         "description":"I am a mascara junkie. I've tried just about every brand that is out there through the years. this is the best mascara I have ever used. I love the waterproof, it doesn't come off until you take it off. I love that it goes on so thick at the base of my lashes that it looks like I have either eyeliner or very thick lashes (which I don't). Almost looks like false lashes. This mascara deserves 5 stars, but I gave it 4 because I find that I have to re-up after only about 5-6 weeks (& I don't even use it everyday) instead of the usual 3 months that should be the life span of any tube of mascara. for the price it should last longer.…read more"
      },
      "meganlvh":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"5 Oct 2014",
         "title":"not impressed",
         "description":"I was quite disappointed with this mascara. I really hoped it would be the last mascara I would have to buy. I have had better drug store mascaras. The waterproof formula isn't very waterproof. I always end up with mascara under my eyes only after a few hours of wearing. It isn't worth the price."
      },
      "stephanibanani":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"23 Jun 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838771+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Blue",
         "description":"amazing on straight lashes; actually holds curl"
      },
      "drQT":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"12 Mar 2016",
         "title":"New formula is NOT the same",
         "description":"I've used this mascara in the past, but as it's expensive, I took a break. Anyhow, this is not how I remember it at all. It's dry & I have to brush too many times to even make it seem like I have mascara on. Disappointed,"
      },
      "kaod":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"9 Mar 2012",
         "title":"very very good, lives up to the hype",
         "description":"I got this in blue and it is very blue. Would look good on a young woman. But my lashes have seemed shorter lately and was wondering what I was going to do about this problem. This really builds lashes w/o much problem and w/ virtually no clumps. It easily stays separate while you keep building. I don't want to try others now. I got a good mascara from the drug store and was happy w/ that, but it does smudge on the brow bone by the end of the day. This dior one does NOT do that. It is as perfect as it can be. I like trying new things but with this, I might stick w/ it because it is so worth it. Buy it now!…read more"
      },
      "UltraViolent":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"4 Jan 2009",
         "title":"Eh...",
         "description":"I like the original of this mascara. There was something different about the waterproof one for some reason. It smelled like chlorine to me and it clumped up so it's definitely not advisable to put on more than one coat."
      },
      "margotr":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 Jul 2016",
         "title":"The Best",
         "description":"I first tried this mascara 8 years ago. A rep at Sephora recommended it to me when I said I wanted lots of volume without clumping or flaking.  I used it for years and it worked SO WELL that I forgot how much better it is than other mascaras, and stopped buying Diorshow to save some $$.\r\nWell, after trying Tarte, Benefit, Clinique, Lancome, Maybellene, Almay, and Lorac, I can definitely say Diorshow is THE BEST I've found.  An added bonus I didn't realize Diorshow had until I strayed: it doesn't irritate my eyes (I don't wear contacts though).  \r\nIt's not going to give you a super curl, but if you want volume, defined lashes, and no flaking, this is your mascara.…read more"
      },
      "BellaMace":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"6 Jul 2015",
         "title":"Very disappointed",
         "description":"I was really hoping this would be the mascara I was looking for. I find it very difficult to find a BROWN (not black-brown, or brownest-black, or blackened-brown) waterproof mascara. This was a huge letdown. The product is dry and thick, it clumps and does nothing to volumize my long-but-sparse lashes. It leaves smudges under my eyes (and I only use it on the top lashes) within a couple of hours. I have to use a waterproof topcoat to keep in in place. The wand is enormous, way too big for my small eyes. The only reason I'm not returning it is because it's brown, and I don't want to hunt for another brown mascara.…read more"
      },
      "mdsum3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"11 Dec 2010",
         "title":"I'm very picky about mascara, and am always trying new products. This mascara works great--it thickens and lengthens without clumping, and the waterproof formula has been pretty great at safeguarding against raccoon eyes. Not sure if I would buy again because of the price; results are comparable to a L'Oreal mascara, which is less than half the cost of the Dior mascara.",
         "description":""
      },
      "Victoria1021":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"18 Jan 2015",
         "title":"I need to talk about this...",
         "description":"I think I really need to talk about this product...\nAfter reading tons of good reviews here, I decided to give a try. I was surprised, amazed by it at the first use and even recommended to many of my friends, cuz it holds the curl and desperate every eye lashes and did not clump. But generally I found that this one is too hard to remove. Normally the cleansing oil will do the good job and remove all the water-proof make up, but for this mascara I need one more step with eye makeup remover first. Secondly, it smudges badly as drug store brands, that really disappointed me. I will assume the people who think this one doesn't smudge have natural curly eye lashes, if so, you are good to go with most of the mascara...\nWill return, might go back to Tarte if nothing else amazing pops out.…read more"
      },
      "buzzy0600":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Feb 2012",
         "title":"BEST MASCARA BY FAR",
         "description":"I have been using this Dior mascara for about 4 years now. I've tried other brands, even buying the sample sets from Sephora thinking I would find something I liked better than this Dior. But... I haven't found anything better than this yet. It leaves my lashes long and full.\n\nI get so many compliments on my eyes, and I have to give credit to this mascara. It really is the best!"
      },
      "oddtree":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Aug 2015",
         "title":"Best mascara. Holds curl the best compared to the other dior mascaras. Makes my eyelashes super huge and feathery. I tried the new diorshow and it doesnt compare to this one!",
         "description":""
      },
      "SalemCat":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"26 Jan 2013",
         "title":"Drugstore brand is better!",
         "description":"I bought this based on great reviews on multiple websites. This product is extremely overrated.\n\nWhen I got it, I was very excited to try it.\nI noticed that this stuff had a strong floral scent. I put it on and had immediate doubts because it looked no different than my old mascara. The floral scent lingered all day and I could smell it over everything.\n\nI really wanted to love this. I tried. Nope. This is just as good as my old drugstore mascara. Actually. Not even. And I had my proof once I used my old drugstore brand on one eye and Diorshow on the other. I asked my boyfriend which one looked better and he actually chose the drugstore brand.\n\nThis product went BACK to Sephora as soon as I did my experiment. Never again.…read more"
      },
      "crc82278":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"13 May 2015",
         "title":"NOT waterproof",
         "description":"Terrible. I was super excited about this mascara. I bartend outside during the warmer months and need an amazing waterproof mascara. I heard such great things, I thought Dior wouldn't fail me. Not only do I have raccoon eyes after an hour of wearing this, it is on my eyelids and just all over the place. Trust me, I've given it ample chances in different types of weather. Not waterproof, and all around terrible. Besides that, it went on feather light and aside from being very black, gave me no thickness or length.…read more"
      },
      "alwaysbuyng":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"11 Apr 2015",
         "title":"Only Mascara in Blue. a rebuy",
         "description":"I like to try new products so even when I like something I am not always re Ibuying things unless it is great. This is one of those products. There are also so few mascaras in blue, so that is why I buy this product. I am not sure why it is not popular as it gives a little more interest to the eye. As far as the mascara, I find it does a very good job of lengthing the lashes. It lasts all day and I have found very little flaking. It does not thicken the lashes, very much but I have very thin lashes so it might do better with others.…read more"
      },
      "sarahk":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"21 Sep 2016",
         "title":"Not Worth the Price",
         "description":"Bought this on a whim because the other mascara I wanted was out of stock. I've always heard this was a \"holy grail\" product, but I found it to be mediocre at best. The brush is too large and is awkward to handle. I like the natural bristles, but it's hard to transfer product to your lashes. Even with several layers of application, I ended up with a very clean lash look. For the price, I wanted more of a full, fake lash effect. I will say that I did not have any clumping or flaking, but there are better drugstore mascaras for a third of the price.…read more"
      },
      "denise5871":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"22 Dec 2011",
         "title":"WOW! Popular for a reason!",
         "description":"Where has this mascara been all my life??? Lengthens and volumizes like no other; not sure I'll ever be able to use anything else, and I will add, I've tried all the top high end brands. Love this!"
      },
      "mainejulie":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"12 Dec 2011",
         "title":"Magical",
         "description":"When Clinque discontinued it's waterproof mascara I was devastated. I tried several other brands and they were all so wet they weighed my skimpy lashes down, clumped, smeared, uncurled my eyelash curler work, etc. None worked until I tried DiorShow. It's a dream come true mascara. I now have luscious, lasting lashes. At twice the price of most mascaras this product proves it is really worth it."
      },
      "gaditana":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"18 Jul 2011",
         "title":"Was the formula changed?",
         "description":"I've been using this mascara for about 3 years, have absolutely loved it, and even loved how I would wear it to the beach and the water and sweat didn't even make it smudge. However the past few months it hasn't been living up to its standards. I get home from work, look in the mirror, and there's mascara under my eyes! I bought a new tube thinking mine had gone off, but it's still happening. I don't know if they changed something or what but I think I'm going to try something else to see if I can find something that won't smudge.…read more"
      },
      "KatieKellert":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"11 Jan 2010",
         "title":"Disappointing",
         "description":"I love, love LOVE the regular Diorshow mascara, so I ordered this thinking it would be a far better choice for longer-lasting wear: BOY WAS I WRONG. Contrary to staying in place better in the face of tears, sweat, and moisture, this mascara promptly migrates from my lashes to underneath my eyes, leaving me looking like a raccoon every time I've used it. If you want a phenomenal mascara, stick with the regular DiorShow, skip this one.…read more"
      },
      "norala":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"23 Apr 2010",
         "title":"Still love this mascara. I use it for evening moreso than day - I prefer a little less eyelash drama during working hours, and it looks a little too nightclubby for the day. But it is absolutely fantastic mascara for nights on the town or romantic lashes for a dinner date. LOVE it!",
         "description":""
      },
      "sparkleee708":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"1 Mar 2013",
         "title":"Fantastic, bold and full lashes",
         "description":"Been using this mascara for years and it's wonderful for the lashes! You get dark, full and dramatic lashes with DiorShow. For me, I always use the waterproof formula since it stays on the best. It doesn't clump unless yours is old...so, make sure to change it after three months!"
      },
      "itgirl":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"24 Oct 2012",
         "title":"I used to love this",
         "description":"This was my everyday mascara. It made my lashes look amazing. But, the formula seems to have changed. It's thicker now and it after a few weeks it gets clumpy.\n\nI could work through it with an eyelash comb, but I'd rather not have to do that every morning."
      },
      "cleanhair":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"4 Feb 2009",
         "title":"Best Mascara for the $",
         "description":"This will always be my fav. I have very short eyelashes and when I use this mascara w/my eyelash curler my eyelashes look 4x longer."
      },
      "anniejm":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"9 May 2016",
         "title":"not waterproof",
         "description":"This was very disappointing. By the end of the day after working a desk job in an air conditioned office the mascara would be under my eyes. Which is ridiculous for such an expensive mascara."
      },
      "Vivintx":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"5 Jan 2009",
         "title":"Great Length",
         "description":"I love this the only thing that annoys me with the waterproof is that if my face is oily the mascara comes off where my lash hit my top of lid"
      },
      "kaitlinw":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"13 Sep 2008",
         "title":"Miracle Worker!!",
         "description":"I have tiny, practically invisible eyelashes, and this amazing mascara lengthens and thickens them to fantastic proportions! It barely clumps, even when I use my eyelash curler or reapply it throughout the day. It's also waterproof and smudge-proof, which is great because I use contact lenses. You need a good make-up removing solution to take it off though."
      },
      "gj09":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"20 Jun 2009",
         "title":"DiorShow Waterproof Mascara",
         "description":"Clumps lashes; caused fall out of my real lashes and eye irritation. I hate this product."
      },
      "geegeelorna":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"10 Jan 2011",
         "title":"Save your money",
         "description":"Not worth it. Dry doesn't do anything for my lashes. Can't even tell I have it on. Planning to return mine to see if defected. I can't believe this is the same product others reviewed."
      },
      "bbarnhar":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"22 Aug 2012",
         "title":"Ends up on my lower eyelids",
         "description":"I was looking for a truly waterproof mascara so that I wouldn't have to deal with removing black smudges from my lower lash line anymore; so I bought this mascara. Unfortunately it is the same as all the others I have tried and I get smudges anyway."
      },
      "ryfrncs":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Jul 2012",
         "title":"Once you go Dior, you never go back.",
         "description":"Although expensive, this mascara is definitely worth it. I have decently long natural eyelashes, and this definitely does the trick to take them to a whole other level. I've tried tons of other brands (mostly drugstore ones mind you), but so far nothing has come close to Dior. It goes on pretty easily and comes off easily too, which has been a problem for me with other brands in the past. It's waterproof and it wears all day, and it's buildable too. Two or three coats looks fantastic, but one light coat also keeps them long and volumized all day. They keep your lashes curled too, and there's no harsh, disgusting chemical smell which is a big plus.\n\nThis is a must-have if you're going to splurge, but I recommend when you're buying in store to open the product you're going to buy to make sure it isn't dry inside the bottle. If it is, ask for a new one. Otherwise it's fantastic.…read more"
      },
      "neighbor":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"2 stars",
         "date":"2 Aug 2011",
         "title":"Didn't work for me",
         "description":"I ordered the Dior Show waterproof mascara because the\nDior Show regular mascara worked so well. This product\ndid make my eyelashes look great, but by the end of the day\nit had run-it was not waterproof."
      },
      "trinny":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"27 Sep 2008",
         "title":"I think it comes down to what kind of lashes you have. My friends with short lashes absolutely swear by this mascara. But I have really long lashes and just swear at the mascara. It clumps regularly and leaves my lashes stiff. What bothers me even more than that, though, is that it dries out so quickly.",
         "description":""
      },
      "judikay":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"19 Feb 2011",
         "title":"Disappointed",
         "description":"I went to the Greenwood, IN store. The sales women there were very attentive, listened to me complain that no matter what mascara I wore, or what makeup tricks I tried, I ended up with smudges. This could be because I still have oily skin at 50yrs old! The ends of my lashes touch my skin, which is another factor, I'm sure.\nThe consensus was that of all the mascaras in the store, the Dior Show Waterproof was the least likely to smudge.\nBottom line, within 2 hours I had racoon eyes! I was so disappointed. The search continues.......…read more"
      },
      "whoopwhooplady":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"30 Jun 2012",
         "title":"love it",
         "description":"This has been my favorite mascara for years. I have really long lashes and need to use waterproof mascara and this mascara is always easy to remove unlike most waterproof mascaras which won't come off. This mascara stays put and builds to make lashes very thick without clumping."
      },
      "Emilie":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"5 Sep 2008",
         "title":"I love, love, love this stuff!!! You can layer it on for a super dark look or just throw a coat on for going to the grocery store. I curl my eyelashes before, and, after an entire day, they are big, gorgeous, and still curled!! I highly recommend!! Some other reviews said it wasn't very waterproof, but I wore it when I went to the beach and had no problems. ???",
         "description":""
      },
      "jessxpress":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Aug 2014",
         "title":"Greatest Mascara Ever!",
         "description":"This product not only lengthens, but it gives my lashes a full, thick appearance. I've been asked if I was wear fake eyelashes before: it's that good! I would totally recommend this product to anyone who wants fuller, thicker lashes that aren't totally separated from each other."
      },
      "wasabipudding":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Jan 2012",
         "title":"hands down best mascara - old faithful",
         "description":"I've tried every mascara on the market (maybe a stretch, but it feels like it) - from the cheapest to the most expensive, and this is hands down the winner. The best mascara, above all others.\n\nSome times I get an itch to (spend money and) try another kind of mascara and it is never as good as DiorShow, even other Dior mascaras. This is my favorite make up product EVER."
      },
      "LauraJacqueline":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"16 Jul 2014",
         "title":"Holy grail beauty product",
         "description":"This is my absolute favourite mascara of all time. I never use anything else!"
      },
      "teddybear46":{ 
         "extra_info":"<b>Skin Tone</b> Fair",
         "stars":"1 star",
         "date":"22 Mar 2016",
         "title":"Not nice..",
         "description":"I am so picky with mascaras, I have very long lashes & I never try waterproof because they usually are very difficult to remove at the end of the day, I tried the regular diorshow and decided to try the waterproof version thinking the expensive quality would make it nice. WRONG. I took a 40 minute drive to work and by the time I got there my mascara was running and made NEW dark circles over my concealer. it looked like I was crying for an hour. also didnt stay on well. I returned and bought the regular version which is 500 times better. Definitely recommend that one instead!!…read more"
      },
      "mes337":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 Nov 2013",
         "title":"Hooked for Life",
         "description":"This is my second tube of this mascara and I LOVE it! I have pretty pale coloring, but my hair has started getting more dirty-blonde as I get older and I've found that black mascara (as opposed to brown or dark brown) just makes my features pop a little more and looks cleaner. This mascara defines lashes while lenthening them without making lashes look too \"done\" - no spider lashes or clumps.\n\nI was also looking explicitly for a waterproof mascara when i tried this. For whatever reason, mascaras always tend to smear under my eyes (even many waterproof formulas) but this stays put all day and only requires a little makeup remover or soap in the shower to come off. I would 100% recommend this to anyone. I know it's a bit pricey but it is hands-down the best mascarsa!…read more"
      },
      "tokineko":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"5 Jul 2011",
         "title":"Decent",
         "description":"my lashes are very thin, but this mascara made it pretty long and thick. i went swimming with it but it wasn't waterproof like i hoped it would be, and instead i looked like a raccoon."
      },
      "mes95":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 Jul 2014",
         "title":"Best mascara I've ever used",
         "description":"I went out of my way to write this review because I love this mascara so much. My lashes are stick straight and I have large eyes that require curled lashes otherwise my makeup just looks unfinished. I bought this mascara on a whim in the store in place of my usual They're Real, and I am so glad I did. Diorshow Waterproof holds my curl in place and provides separation and length. I pair it with Urban Decay's 24/7 liner in Whiskey which I used to tight line my upper water line (try this, it will change your life) and curl with Sephora's classic curler, which after you break it in, will never tear our lashes. I swear this mascara has made my eyelashes GROW. Even when I'm not wearing it I notice a difference. The waterproof formula holds that curl in place and doesn't clump, unlike They're Real. I feel confident with less makeup on. I've stopped lining my top lid with liquid. Buy this."
      },
      "Winza":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"27 Mar 2015",
         "title":"Waterproof mascara that isn't",
         "description":"Love Dior products and hoped this mascara would not leak if my eyes watered or the day was long. My hopes were not realized. If it is waterproof, I didn't see that feature. Didn't work at all. Very disappointed."
      },
      "cathy41":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"12 Oct 2011",
         "title":"Great Mascara",
         "description":"I bought this mascara for my wedding and it works great! It stays on all day and helps my eyelashes stay curled for a long time. My only complaint is that the brush is really big and if I'm not careful, it gets mascara on my eyelids."
      },
      "buttercat":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Jul 2012",
         "title":"Best mascara EVER!",
         "description":"I am a loyal fan of this mascara, and this is the one beauty product I constantly buy over and over again. I'm Chinese, with short, skimpy, straight lashes. Once I've curled and put on Diorshow, people ask me if I was wearing false eyelashes, that's how dramatic the look.\n\nIt's important to get the waterproof mascara, I've noticed that the normal formula seems too \"wet\" and straightens my lashes right away, even after I've curled them. But the waterproof formula holds the curl like it's hairspray for my lashes! Plus it will last all day. You will need an oily make up remover, but I always use Lancome double action eye make up remover- it's the best. And also Shu Uemura cleansing oil."
      },
      "MissOdessa81":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"23 Apr 2014",
         "title":"I prefer the original",
         "description":"Although Diorshow Waterproof Mascare did its job of being waterproof, it indeed was difficult to remove and at times felt a bit cakey."
      },
      "temlet":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"21 Sep 2015",
         "title":"I have sort of a love/hate relationship with this mascara. On one hand, it makes my lashes look amazing. It lengthens and separates them like nothing I've ever seen. However, it is definitely NOT waterproof! I tend to take a nap when my toddler naps during the afternoon and when I wake up, I always have smudges under my eyes. I'm glad I didn't buy this in the middle of summer when the temperatures were much higher, because I'm afraid it would leave dark circles under my eyes just from sweating.",
         "description":""
      },
      "CaliZ":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"5 Mar 2013",
         "title":"I don't get the hype",
         "description":"This was definitely a splurge purchase for me and I don't think I will be buying it again. It's fine, but it does not really go above and beyond the drugstore versions that I usually use. Even though I have the waterproof version, I still find that it smudges a bit, but then it is impossible to get off."
      },
      "ally5688":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Jun 2012",
         "title":"I decided to stop wearing eyeshadow and liner every day after a few friends suggested I look better without it. I said he*** no at first because I'm a natural blonde and think I look 12 without makeup. But I decided to limit myself to mascara only if I was allowed to buy a nice one (had been using Maybelline Lash Stiletto for years and splurging on other makeup, mainly eyeshadows). I bought Blinc Blinc at first and hated it, then exchanged it for this. I am obsessed. I get so many compliments that my eyelashes look super long while I'm wearing this mascara. And, it's buildable and relatively smudgeproof compared to other waterproof mascaras. I've gone to sleep with it on and just added a bit more in the morning and it doesn't make my eyelashes stick together or feel crunchy. I've had it for almost a month now and haven't had trouble getting it out of the bottle like people are saying. Highly recommend.",
         "description":""
      },
      "Pulelehua55":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"24 Nov 2013",
         "title":"Mascara",
         "description":"Luv it luv it luv it"
      },
      "CGMom":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"19 Apr 2010",
         "title":"Best I've Tried",
         "description":"Love waterproof, but hate taking it off? This mascara delivers all the good but is easier to remove than others I've tried."
      },
      "reina2016":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"27 Apr 2016",
         "title":"Disappointed",
         "description":"I use to love this mascara, but the last one that I received just a couple of weeks ago was very dry no consistency, it's sad that I don't only pay for a fancy package,  I could not believe this about Dior. I just won't buy again."
      },
      "alymirsha3":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"11 Mar 2009",
         "title":"NOT OIL/SWEAT PROOF",
         "description":"I loved the way my lashes looked after applying, but I have an oily complexion and the mascara was smearing. So I would have to say no, if you have an oily complexion."
      },
      "msfortino":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"16 Feb 2013",
         "title":"Great!!",
         "description":"I was first introduced to the dior waterproof mascara 5 years ago when a store associate at Sephora recommended it when I was looking for mascara for my wedding. She probably was pushing the product, but it works really well. Great black color and it applies much better and more dramatically than others I've tried. I give it only 4 stars because I don't think it's as waterproof as it should be. You can get black streaks on your lips and if you wear it in the freezing new enland weather, you can look a little racoonish when your eyelashes melt after getting to work."
      },
      "Brookie769":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"21 Jun 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Doesn't budge. Took it on a girls trip and it lasted beautifully in the pool and the lazy river."
      },
      "loccitanegirl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"10 Jan 2009",
         "title":"great product, bad packaging",
         "description":"This is the second tube of mascara that I will ahve to bring back..both bottles broke at the bottom of the threads on the bottle side. However, the product is looks great!"
      },
      "VegasDiamond":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"28 Jun 2010",
         "title":"Still Smudges!",
         "description":"Makes your lashes look beautiful and holds a curl ALL DAY. But it smudged on me so I had to return it :-("
      },
      "CathyCosmetics":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"26 Feb 2015",
         "title":"Best there is",
         "description":"I have used Lancôme mascaras for years and they are great. But this one steals the show!! (excuse the pun). I have VERY straight, thin eyelashes so I use a good quality lash curler (yes, ladies a good eyelash curler DOES work better than the cheap drug store curler - invest in one) and then use the Diorshow waterproof. Waterproof is a must for me since anything else will take the curl out of my lashes. This has a great brush, the mascara is lush and never cakes. Stays on forever and makes my skinny, straight lashes look thick and lovely. LOVE IT!"
      },
      "Ratchapat":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"13 Oct 2014",
         "title":"Don't buy it",
         "description":"I am so disappointed with this mascara. It is not the waterproof at all. It turned my eyes as a panda in few hours. I really wanna return but I used it already. It's wast money."
      },
      "lovekumo":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"7 May 2014",
         "title":"Buy, use &amp; repeat",
         "description":"I always come back to this all time fav mascara. After wasting a ton of money trying every mascara, I feel this one just tops it. It separates, adds volume and length. I use this with the lash plumping serum and the result is amaaaaazing!"
      },
      "lilphisig83":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Jan 2009",
         "title":"Another Dior Hit!",
         "description":"I absolutely love this mascara--- I have used it for years, and honestly it is the best for the money: it lengthens, volumizes and stays put for hours, with no flakes or smudges. Quick to dry and easy to remove."
      },
      "makeuploverguru":{ 
         "extra_info":"<b>Skin Tone</b> Light",
         "stars":"5 stars",
         "date":"11 Jun 2015",
         "title":"Holy Grail, CAN NOT live without",
         "description":"I have been using this for years. Nothing to say but its pure AMAZING. Cant live without. Only mascara I can wear to the gym and not worry about it running down my face. I have tried many waterproof mascara and they are not as good as this. Adds great volume and length for me."
      },
      "kath84":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"1 Sep 2012",
         "title":"Great!",
         "description":"I am knocking this down a star only because I don't think it is as good as their other mascaras. It is most DEFINITELY waterproof (and sweat proof, I might add, and you WILL need remover that is designed to take OFF waterproof makeup...otherwise it will be on there for days...no joke). It definitely lengthens my eyelashes but does not separate or define them as well as their other mascaras. I definitely recommend it if you have a job where you're in water or sweat a lot (I wear it when I waitress)."
      },
      "RavenSeattle":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"1 Apr 2010",
         "title":"Great, seems to clump more than non-waterproof?",
         "description":"Love Diorshow! Favorite mascara ever. This waterproof version seems to clump a bit more than the regular -- not horribly, but I have to be careful. :)"
      },
      "CrystalLingLing":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"6 Jul 2014",
         "title":"Waterproof",
         "description":"The mascara is very pigmented and waterproof. It stays on all-day even in water! I love to use this when hanging out with friends at night. Also, the wand is big and fat! it curls all my lashes and separates them as well."
      },
      "clucy":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"2 Feb 2011",
         "title":"Great mascara!",
         "description":"I really like the Dior Show Waterproof Mascara. It stays on and doesn't clump or flake. I find the brush to be a little hard to use because it is so large. It is easier to make a mistake."
      },
      "mmers":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"30 Jul 2015",
         "title":"Not the best",
         "description":"When I first started using this mascara, I thought it made my eyes look fabulous! But, within a couple of hours it smudged underneath my eyes so horribly. I will never buy this mascara again."
      },
      "pinkamy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"11 Sep 2008",
         "title":"My favorite mascara ever. It gives you length and volume, and doesn't kill my curl!!! I have Asian eyelashes, short and straight, and a lot of mascaras will not hold a curl. But this stuff is awesome. And it lasts, though I do start getting smudges by the end of the night under my eye sometimes. Usually if I do a check halfway through the day, I don't have problems the rest of the day.",
         "description":""
      },
      "missmanda88":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"4 Nov 2010",
         "title":"I bought the waterproof because i've had issues with clumping, flaking and smudgy raccoon eyes in the past with almost every other mascara i have ever used. Waterproof seems to last the longest for most formulas but unfortunately not for this one.\n\nThe definition, color, buildable volume and length is wonderful and your lashes look great but I found that regardless of how little I put on, and whether it was top and bottom lashes, at the end of the day (sometimes just hours later) i would have black smudged under my eyes.\n\nI was hesitant for the price, but figured Dior would be a good investment, unfortunately I will definitely try and take this back.",
         "description":""
      },
      "rko3015":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"13 Jan 2016",
         "title":"Holds curl, great all day",
         "description":"I'm Asian, my lashes are not particularly short or thin but are dead straight - I need all the help I can get keeping the curl I achieve with a lash curler, and I'll never say no to more length and volume, obviously. This is the first non-Asian market mascara that will not relax the curl at all upon application. Lengthens/volumizes well without flaky fibers or clumping. I will say that it volumizes a smidge less than my fave Asian mascaras, but it actually wins over then in terms of staying feathery (2 applications, I do comb thru), and not getting that 'dusty' look mid-day. Pricey, yes, but worth it to someone with my lash situation. Wish the brush head was a bit narrower, hard to get at the roots of upper lashes, but it comes out of the bottle clean, and product distribution and application are very nice. I would imagine on someone with 'typical' Euro lashes, this product would make an amazing difference. Good purchase."
      },
      "pr1nc3ss":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Feb 2009",
         "title":"I only use waterproof mascara because majority of mascaras tend to smudge. This one is one of my favorite mascaras. I use the jet black one, and it is a very nice dark black. The mascara is not too watery and not too dry. And it is not heavy, where it would drag my lashes down. Once I apply this in the morning, I would not have to reapply at all throughout the day. I love it!",
         "description":""
      },
      "mele88":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"12 Apr 2013",
         "title":"Great mascara, but it smudges",
         "description":"This mascara made my eyelashes look really long more than any other mascara I have used, but I had smudges by the time I got to work that I had to have Q-tips with me to clean up the mess. I used the waterproof formula, so removing the excess mess was tough. While I loved the way my lashes look using the product, I will not buy again."
      },
      "as678":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"26 May 2015",
         "title":"Not waterproof; leaked to my under eye area",
         "description":"I absolutely love the brush on this mascara and it did an amazing job in making my short, thin lashes look thicker and amplified. Unfortunately, its not waterproof in my opinion. Towards the end of the day, it ran and I looked look like a raccoon. :( Really wanted to like this and work. Returned."
      },
      "Amber9317":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"3 stars",
         "date":"25 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Not quite waterproof. :("
      },
      "obesecat":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Sep 2008",
         "title":"amazing @_@",
         "description":"i love how u can do many layers without it clumping however taking it off is tough..get a good eye makeup remover !!"
      },
      "catwrangler":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"28 Nov 2012",
         "title":"disappointingly flaky",
         "description":"This mascara looks great when I first put it on and doesn't smudge or smear all day. However, it does tend to flake toward the latter part of the day. Not a very pretty effect!"
      },
      "vito":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"21 Mar 2011",
         "title":"Not as good as regular diorshow",
         "description":"I don't know why, this is very strange, but this mascara actually tends to rub off on my under eye area. I did not change any other part of my makeup regimen, so I can only assume that it is the mascara. I have used the regular, non-waterproof, diorshow for years and have never had this problem. I'm actually wondering if they changed the formula/ingredients but have no way of comparing to my old mascaras as I threw out the containers long ago. I regularly find that within 2 hours of applying this product I have black smudges in the corners of my eyes - and I don't even use more than one swipe per eye!"
      },
      "Catfontenot":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"10 Apr 2009",
         "title":"The mascara is great I just wish it wouldn't smudge off under my eye during the day. I really like it though",
         "description":""
      },
      "mwnewlin":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"3 Apr 2013",
         "title":"Best. Mascara. Ever.",
         "description":"I bought my first tube of azure blue Diorshow in 2004, and I never turned back. It is perfect to give a beautiful bright glow to your eyes, and (along with concealer) is my go-to for covering for being overtired (or hungover) because it makes your eyes look more awake. It's magical."
      },
      "jqueens":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 Apr 2012",
         "title":"My Favorite Mascara",
         "description":"I love this mascara! I have tried more brands than I can remember, and this is one of the few standouts. It is bold without being overdramatic, thickens without clumping and stays put until I take it off with makeup remover. The most expensive mascara I've ever purchased, but in this case you get what you pay for!"
      },
      "emma16":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"29 Jan 2016",
         "title":"Smudges after a few hours and I cant imagine its waterproof. Returning.",
         "description":""
      },
      "MariRae":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Jan 2013",
         "title":"My favorite Mascara",
         "description":"It's the best waterproof mascara, I've tried. I haven't been able to find other that matches up. Take a look at the pic below!"
      },
      "DianaEstephany":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Jul 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838771+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Blue",
         "description":"Worth every penny!"
      },
      "Kailani":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"27 Aug 2009",
         "title":"The best macara for the money!",
         "description":"Being Asian I have short and skinny lashes. Using the Dior show truly lengthens and creates a thicker lash. And it doesn't flake. It's absolutlely worth every penny! I love it!!"
      },
      "StephAK":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"30 Oct 2016",
         "title":"I have short, fine, stubborn lashes. These unfortunately barely held my curl and smudged after 5 hours. It somewhat volumized my lashes but gave absolutely no length unfortunately.",
         "description":""
      },
      "vivianatorres":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"9 Jun 2013",
         "title":"The best waterproof Mascara",
         "description":"Diorshow Waterproof Mascara is the best mascara I've ever used. It doesn't clump when you put on two or three coats for drama and it doesn't run or smear. I love it!"
      },
      "Mo21":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"2 Dec 2012",
         "title":"Disappointed",
         "description":"I first encountered the Diorshow (nonwaterproofed) mascara in the trial form. I really really liked the mascara. It went on well and stayed most of the day. I have a HUGE problem with mascara migrating from my lashes to right under my eyes. I've tried SO many brands and I thought, since regular Diorshow stayed so well then Diorshow waterproof would be even better. Unfortunately, I was wrong. The waterproof formula ended up turning me into a raccoon within 5 minutes of application. It was a huge disappointment. Now I have to figure out how I can return this stuff because I can't use it unless I want to look like I haven't slept in a week.\n\nThat said, it still had all of the good qualities I liked with the regular Diorshow. It made my lashes look long, thick, and defined. It didn't clump and it built on itself without an issue. I already have long eyelashes so this stuff just amplifies my God given asset.\n\nBUT, if you're like me and have issues keeping mascara off your undereye area on your lashes, this is probably not the formula you want to try."
      },
      "itsamywho":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"14 Mar 2012",
         "title":"Absolute Favourite!",
         "description":"I purchased both the black and the blue of this mascara and the formula is absolutely incredible. They hold the curl of my lashes all day long, lengthen my lashes, and provide volume without any clumps. I know that people say that mascara isn't suppose to be used for over a year, but I purchased this mascara almost 3 years ago and there is still a lot of product and the formula has not expired. The blue is definitely great for adding some drama to your look, and the black is great for an everyday look; it makes your eyes pop without looking too flashy. It's waterproof aspect is also great, but if you have oily eyelids like me or are in extremely humid conditions, you might experience a little bit of the mascara being transferred to you lower eye bags at the end of the day. But, this is very slight; you won't be having raccoon eyes, I promise you! This has been my holy grail mascara every since I started wearing make-up and will continue to be until I find one that can top it!"
      },
      "Travelsinheels":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"12 Nov 2016",
         "title":"Not my favorite",
         "description":"I have tried several of the Dior mascaras because of the awesome reviews, but they just don't work for me.  This one in particular seems pretty dry and the brush is WAY too big.  \r\n\r\nThe brush makes the mascara very difficult to apply and because it doesn't seem to collect much product, I have to apply several coats to even make an impact.  Not impressed."
      },
      "Megs84":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"7 Jul 2009",
         "title":"Pretty Good, Not Awesome",
         "description":"For $24 bucks and the Dior name, I was expecting a little more from this mascara. I'm one of those girls who has trouble with her mascara running after a full day at the office so after hearing and reading the rave reviews about this one I decided to go for it.\n\nInitially, this stuff goes on great; No clumping, no turning my eye lashes into tarantula legs. Just a nice, smooth layer of jet black volumizing my skinny Asian lashes. However, after a long day, I noticed a little bit of black under my eyes giving me a slightly \"slept in my makeup\" look, and not in a sexy way either.\n\nI'd like to give this product a high rating, I really would, but it just didn't do what I thought it would."
      },
      "isenephthys":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"29 Nov 2008",
         "title":"i like this mascara quite a bit. i've been using it steadily since fall 2005. it makes my lashes appear dramatically longer and fuller with minimal clumping. my only complaint is that it sometimes rubs off my lower lashes, giving me the dreaded \"raccoon eye\" effect after a few hours. also, it takes copious eye makeup remover to get it off all the way!",
         "description":""
      },
      "greenfairylights":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 Nov 2010",
         "title":"does exactly what it says it does",
         "description":"I LOVE this mascara! I have it in both the blue and the black. I have thin lashes that are straight as a pin, but this makes it look like I'm wearing false lashes without the falsies! I used to live in a humid climate and was looking for a way to get my mascara to last through the day in the heat - this does that! No smearing, dripping, glopping, clumping, or anything! But you need to take care to not pump the brush in and out of the tube to get more product because that will clump the mascara (just like any other mascara, really). A swirl inside the tube will do the trick and won't clump or dry out the product. One tube lasted me months. I wouldn't actually go swimming with it on because it *will* smear, and since it's \"waterproof,\" removal without makeup remover at the pool/beach will be near impossible. Oddly enough, I've cried with it on and the only think that happened was that my lashes came out straight afterward - no raccoon eyes! Also, the blue is AMAZING! No other blue on the market even comes close."
      },
      "shortih":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Sep 2012",
         "title":"Awesome",
         "description":"I am very picky with mascara. My eyes literally leak mascara all the time. And my lashes clump very easily. This mascara is amazing. I finally found my go-to mascara and I couldn't be happier."
      },
      "demora":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"25 Jan 2014",
         "title":"Dramatic and reliable",
         "description":"This is a terrific mascara. Once in a while, someone convinces me to try a different kind of mascara but I always go back to this one."
      },
      "mon3237":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"6 Apr 2011",
         "title":"don't buy",
         "description":"the classic Diorshow is my all time favorite mascara, but the waterproof version I do not recommend at all for the following reasons:\n\n1. It is not going to give you the same effect that the regular non-waterproof Diorshow classic mascara gives you. The sephora associate told me this in store and I wish I had listened. Lashes are far from their most bold and beautiful with this mascara.\n2. The tube dries out extremely quickly - in about 2 months of 4x week use for me. Product is still left - it's just dry.\n3. I did comparisons with other waterproof mascaras, diorshow on this eye and the other brands on the other eye, and the diorshow was always the LEAST volumizing, LEAST black and LEAST lengthening.\n4. The price. For something that is of this quality, you would expect it to be 6 bucks at the drug store\n\nLove the classic non-waterproof version, but this one went into the trash and I will definitely never buy it again. Will try the MUF smokey eyes waterproof next as it was recommended to me in store and also by an online makeup artist guru I watch on youtube.\n\n2 stars because it IS effectively waterproof."
      },
      "anumbunum":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"25 Nov 2013",
         "title":"long wear but not the thickest",
         "description":"it is a great mascara but it doesn't look thick or the blackest mascara. also it has a big wand so it leaves marks on your eyes"
      },
      "aeadri":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Jun 2009",
         "title":"In terms of quality, it's really good. I bought it before going on vacation to Florida and not only did it lengthen my lashes considerably, but it also stayed put even after going into the pool, ocean, and hot tub multiple times a day for sometimes hours at a time. It's pricy, but it just may be worth it.",
         "description":""
      },
      "AnnaWasHere":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Jun 2009",
         "title":"Best mascara on the market",
         "description":"This is seriously the best mascara out there. I've tried them all...from drugstore to the ultra high end brands. It leaves a good amount of pigment on your lashes, lengthens, and creates perfect volume. As with all mascara, it is all about how you apply it in order to get the best effect. A primer helps, and applying from base to tip while moving the wand from side to side and allowing it to dry before touching up. If you apply correctly, allow to dry, and always use a fresh tube (one that has not dried up), you will get a clump-free seductive look with this mascara...\"bambi-like\" lashes."
      },
      "sweettessa":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"6 Mar 2013",
         "title":"No regrets!!!!!!!!!",
         "description":"Oh my gosh!! I love mascaras! i love volume, length, and curl. I am looking for the wedding day mascara that will forever be in pictures. This mascara is my holy grail of mascaras (and i've pretty much tried them all). I am so in love with the fullness, the curl, the definition, the long wear, no flakes, soft to touch formula. It doesn't make my lashes crunchy and it is definitely waterproof! sooo in love with this. Worth the price!"
      },
      "lphou":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"1 Jun 2013",
         "title":"I usually never splurge on mascara but this one was definitely worth it. I have super straight and thick lashes to begin with and this held the curl with no problems. It makes me look like I`m wearing falsies and I don`t even need to wear eyeliner sometimes. The only problem I found is that it was a little flakey in the beginning and it kept flaking onto my cheeks. I would recommend two coats max.",
         "description":""
      },
      "glorinat0rz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Dec 2011",
         "title":"Can't get any better",
         "description":"For years I've been using Dior's DiorShow Waterproof Mascara and though I've tried many others, I still think this one is the best. It lengthens and thickens and does not smudge no matter how much water gets on my lashes. BUT THAT'S NOT THE BEST PART! The best thing about this product is that this mascara holds curl very well. I religiously curl my short, straight, Asian lashes daily prior to applying mascara. The problem is that other mascaras are heavy on the lashes and they cause me to lose the curl. I hate curling my lashes after applying mascara because my lashes break easily and the curler gets gunky. This is the only mascara that I've used in all my years that does not compromise the curl after I've used a curler. Even the nonwaterproof version can NOT do it.\n\nI cannot recommend any other mascara other than this one. It is simply the best."
      },
      "AugustSun":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Jan 2014",
         "title":"Love It!",
         "description":"This is the third bottle of Diorshow Mascara that I have purchased. I use it daily."
      },
      "Marisola":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"1 Jul 2010",
         "title":"5 Stars!!!!!!!!!!!!!!!",
         "description":"The only mascara i will use. I have tried them all"
      },
      "TheEsther":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"20 Sep 2009",
         "title":"NOT as great as everyone says!",
         "description":"I probably should not have purchased this, as I have tiny lashes but I bought it anyhow and what a mistake this was. First off, it isn't waterproof-- 4 hours into the day and I look like I sat in a sauna for an hour. The brush is hard to handle and you're more likely to stab yourself in the eyes.\n\nIf you have big eyes and big lashes then this is awesome for you but otherwise, stay away."
      },
      "Giselle86":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"2 May 2014",
         "title":"Disappointing",
         "description":"I did not like this mascara at all. I had to do more than 3 coats to see some sort of effect I felt that I was putting to much effort to make it work."
      },
      "texaschica":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"6 Aug 2014",
         "title":"Zero smudge",
         "description":"I work long hours, and work out religiously. Other mascara would run or smudge. This stuff does not move. I put it on curled lashes, and then set with Urban Decay all-nighter spray. As an example, earlier this week I woke up at 6am, took a 3-hour flight, and then worked until 10pm, and it still looked fantastic with zero smudge."
      },
      "JWSH":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"28 May 2015",
         "title":"Love this Great Waterproof Mascara",
         "description":"Needed this mascara because my oldest child was graduating from high school and I knew I'd be emotional. :) It was highly recommended by a Sephora staffer. Lengthens and adds volumes and never flakes off, never clumps or smudges. I have found it to be of great quality and worth the $25 price. Need to purchase its non-waterproof counterpart."
      },
      "jaynett30":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 May 2016",
         "title":"zero stars!",
         "description":"Beyond disappointed with this Dior waterproof mascara. I used this product religiously for a year even hooked my friends on this product. They have definitely changed the formula and I'm every unhappy."
      },
      "purpleorcid7":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 Jan 2013",
         "title":"A-M-A-Z-I-N-G",
         "description":"Best mascara ever! Don't even need a lash curler. Great length and great volume. I never leave it!"
      },
      "idkmybffd":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"3 stars",
         "date":"19 Mar 2009",
         "title":"It's a bit messy. I have long eye lashes to start out it and got it b/c it was waterproof and to help curl my lashes and add some thickness. I can only use a small amount though or my lashes look clumpy and it ends up getting all over my eye.",
         "description":""
      },
      "sherriann1":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"26 Feb 2013",
         "title":"Not really liking this. It takes a few coats to lengthen the lashes, and the shade is a strange neon electric blue. I prefer a navy blue, and I've used a different electric blue from Dior, but this looks like I'm from outer space. It does seem to be sweat resistant and waterproof, as advertised.",
         "description":""
      },
      "Nguyen04":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"20 Jul 2016",
         "title":"Good not great!",
         "description":"This is a very black mascara, which I like! This does not hold a curl and my lashes aren't that hard to curl but I would like it if my mascara held a curl. I wear this alone on my lashes on my normal makeup days and they're just straight BUT the mascara gives me a bit of length and the blackness makes me have volume but not a lot. The finish of this is kind of 'fibery'. Will not be repurchasing. The price does not justify what this did for my lashes."
      },
      "Chexxx":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Dec 2012",
         "title":"This is my go to mascara .... Tried to find new ones, but they never worked out and I'm back to diorshow.",
         "description":""
      },
      "onthebeach":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Apr 2011",
         "title":"Incredible",
         "description":"I was in Florida for a week, playing in the ocean, swimming in the pool, tromping in the Everglades, and sweating, A LOT. This mascara withstood even my most stubborn attempts to smear, wear off, wash off, or rub off. It was even hard to get off with my special makeup remover. But, MOST importantly, my eyelashes looked fabulous. full, loong, and they curled on their own once I put it on. I wasn't planning on continuing to wear this mascara after my trip at first, but day after day, my lashes looked so full, and so, well, voluptuous, for lack of better word, and my lashes didn't \"shrink\" when the mascara dried. They were was full hours later as they were right after I applied it, which was a big thing for me. So often I feel like I have a fantastic mascara, and then an hour after applying, my lashes are thinner and less full than they were when they were fresh. Not so with this mascara. Pricey, but worth every dime. I'm in love."
      },
      "Cicii13":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"10 Jan 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Not a good option."
      },
      "makeupartist8888":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"3 stars",
         "date":"25 Apr 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Great - but not for me!"
      },
      "dzinerbee":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"3 stars",
         "date":"26 Jul 2010",
         "title":"brush problems",
         "description":"Like this mascara, but the brush is so huge that it's impossible to use it for bottom lashes. Don't mind the hugeness so much but the tip won't catch the lashes either, which means tons of really hard to remove corner smudges. Need the waterproof specifically for bottom lashes, so Catch 22. Mascara-great-brush needs help."
      },
      "beautifulmaryk":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"6 Sep 2013",
         "title":"Only thing great about it is the BRAND NAME.",
         "description":"I'm super sensitive when it comes to which products work for me, I'm extremely high maintenence and won't be true to a product unless it serves my needs 100%.\n\nThis was just a disappointment.\n\nIt's waterproof so it takes a muscle to remove it, but ironically, it doesn't last long, amd melts off my lashes midday.\n\nAt least it doesn't clump. That's the only good thing about it."
      },
      "Bettile":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"18 Mar 2009",
         "title":"Diorshow Love my lashes",
         "description":"With Diorshow my lashes look long and beautiful like I am a real model. They feel great too. I just love it. I have tried different brands and I always go back to Diorshow there is nothing like it."
      },
      "cm90zaw":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"18 Jun 2014",
         "title":"not as great as regular Dior Show",
         "description":"Not sure why the waterproof is not as great as the regular. It is sort of floppy and smears."
      },
      "Sephoraddict88":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"26 May 2015",
         "title":"clumpy formula but nice brush!",
         "description":"The formula leaves clumps on my eyelashes which is a hassle but I love the brush. I've been dipping the brush is a Clinique formula and find that I get full lashes without the clumping"
      },
      "LiaE":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"21 Apr 2014",
         "title":"Good, not great",
         "description":"This mascara works pretty well for me. I didn't have any problem with smudging, even after falling asleep with it on. Despite this, it comes off easily with waterproof makeup remover without pulling too much on my eyelashes. I'm only giving it four stars because it doesn't do much to make my eyelashes look longer or fuller, but they don't really need that. This is a good mascara if you need something with staying power."
      },
      "angisunset01":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"1 star",
         "date":"9 Jun 2015",
         "title":"surprising",
         "description":"in the sephora store, i tried this mascara on over my already applied mascaras and it looked great, it made my lashes long and it was very volumizing i loved it. I went to the store to buy it , when i put it on the next day it made my lashes clumpy and disgusting. I tried it again the next day again and it looked horrible once again. I was very disappointed because it looked so nice when i tried it on in the store, and it was pretty expensive. Horrible mascara"
      },
      "ridiculou":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"17 Jan 2011",
         "title":"Terrible",
         "description":"This stuff goes on nice but it runs! It's supposed to be waterproof but it gives me black circles under my eyes and I'm not even putting it on my lower lashes. I thought it might be my eyeliner so I tried just wearing mascara and I still get black circles under my eyes."
      },
      "Sarafima":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Aug 2014",
         "title":"a staple",
         "description":"This is the best mascara I have ever used. Occasionally I wander, but I always come back"
      },
      "ashtill":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"25 Aug 2014",
         "title":"not even smudge proof",
         "description":"This smudged with normal wear. Didn't get a chance to test it's waterproof wear...returned it."
      },
      "jsierra":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"19 Nov 2011",
         "title":"Best Mascara Ever!",
         "description":"I love this product! It's hard to find a rich brown mascara, which I prefer over black. This waterproof formula adds volume without getting those little flecks in my eyes, and it comes off easily with waterproof eye makeup remover. It lasts all day - I wore it while swimming with dolphins and snorkling on our last cruise. Amazing stuff!"
      },
      "leipikake":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"3 Jan 2013",
         "title":"Best Mascara, EVER",
         "description":"Love it. My \"go to\" \"gotta have it on a desert island\" product. Can't live without it.\nReally hard to find a product that will touch it when you want to remove it. Have found the only product that works for me is: MakeUpForEver Sens'Eyes, a blue cream remover in a pump."
      },
      "poppyh":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"6 Aug 2011",
         "title":"Me, only better.",
         "description":"I really like this mascara. If you're looking for a really thick, fake lash effect, this is NOT it! This mascara separates and lengthens. It is a very natural-looking effect, as if I was born with naturally long lashes. I gave it 4 stars because I would have liked the black to be a little blacker. It hasn't smudged on me, and the only time it left dark marks was one night when I was lazy with taking off my makeup. I used to use Chanel Inimitable, but I thiink I'll switch to this one as my new favorite. I like to be me, only better."
      },
      "panda1919":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"9 Apr 2009",
         "title":"Not impressed",
         "description":"I bought this product on accident thinking that I was grabbing the regular Dior Show. I thought that there could not be that much difference since I love the original, I was mistaken. This stuff is very very hard to get off even with eye make-up remover and it smudges a lot throughout the day. I don't feel like my lashes look as voluminous or moist with this product as opposed to the original version. I will continue to buy the regular Dior Show."
      },
      "flgolfwidow":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"15 Nov 2011",
         "title":"Melted all over my eyes",
         "description":"This product was terrible! It might be waterproof, but it wasn't meltproof. It was all over my eyelids and under my eyes. I returned it right away."
      },
      "mandersmith":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"11 Mar 2016",
         "title":"seems like a different formula than I remember",
         "description":"I used this religiously a few years back, was obsessed, then jumped around a bit with mascaras. I came back to it because I wanted to try waterproof again since I was getting smudging on my kid and under from the non-water proof kind. I feel like this is a different formula than it used to be - it's very dry, like I'm not sure it's totally covering my lashes, and then throughout the day i have to wipe were my lashes touch and under my lashes. I will probably try something else again next time"
      },
      "BiochemicalX":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"2 Feb 2010",
         "title":"Gives the sexiest lashes.. but with raccoon eyes=(",
         "description":"I read all the reviews positive and negative about this mascara.. but I was willing to take the chance and I really wanted to love it.. Also one of the reasons I bought this is because Sephora accepts returns..\n\nSo I tried it out.. It looked really great.. but.. it won't do you a thing if it smudges down and give you raccoon circles right? And because this formula is waterproof.. it stays there giving you dark circles all day until you remove it with remover.. I had to very sadly send the product back.. I looks great if you just want to wear it to take a nice photo though.. gives you that nice look for about 10 minutes.. If you sweat, then that's the end of it.."
      },
      "buffalogal":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"24 Jan 2012",
         "title":"not good at all",
         "description":"I bought this because I loved the DiorShow mascara but I wanted something waterproof. When you first apply it, it looks fantastic. Easy to apply, lashes are long and black and separated. After a few hours of wearing it, however, I had terrible raccoon eyes. This stuff ran all over my eye area in a way that no other mascara ever has. I finally threw it out. What a waste."
      },
      "jess742":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"22 Aug 2016",
         "title":"No thanks",
         "description":"This mascara looks great from the time you put it on to only about two minutes later. I did not notice really any volume, but any volume would fall away only after a minute or so. Also, I noticed that it would smudge really bad underneath my eye."
      },
      "DanniCappz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"26 Feb 2015",
         "title":"Maybe I got a bad batch?",
         "description":"I've used this before and its been about a year and a half since I've re-purchased it. I'm not sure if its just my tube but everything is just awful. I have natural volume in my lashes but I don't have much length. This product used to lengthen my lashes and make them all nice and wispy...almost like individual lash extensions. NOT ANYMORE. I'm really bummed."
      },
      "Marisorza":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jan 2013",
         "title":":(",
         "description":"Disappointed. My lashes went back down after applying it. Had high expectations for this mascara but it let me down."
      },
      "MsMags":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"2 stars",
         "date":"15 Nov 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Diorshow is a no-show."
      },
      "floridaprincess":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"13 Dec 2011",
         "title":"Only mascara you will ever need",
         "description":"The best....stays on forever....through anything!!!!"
      },
      "culebra":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"26 Jan 2016",
         "title":"Best Mascara out there!",
         "description":"I do not waste my time with other mascara's. I buy this one and it successfully thickens, darkens and curves my lashes.I prefer the waterproof version in brown. I will never waste my money on another mascara ever!"
      },
      "bklync":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Sep 2012",
         "title":"My Favourite",
         "description":"This is my favourite mascara to buy. I honestly don't care to pay $30 for it. I have very short eyelashes, so I usually curl my lashes. Diorshow definitely makes them stay curled, and lasts a long time (I can fall asleep, and wake up the next morning with my lashes still curled in tact). I love it because it makes my lashes thicker as well. It definitely lengthens my lashes too. I was once asked if I was wearing false eyelashes while wearing this mascara."
      },
      "sassigrass":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"2 Apr 2016",
         "title":"loved it at first",
         "description":"This was the first truly waterproof smudgeproof mascara I've found. I actually was able to quit looking for dark mascara circles to appear under my eyes in the afternoon. I was magic... UNTIL after 2 months not only is it migrating out under my eye, then THAT streak is waterproof and really hard to rub off. Won't buy this one again"
      },
      "ramdoride":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"2 stars",
         "date":"14 Mar 2011",
         "title":"Lovely but not long-lasting",
         "description":"I keep coming back to this product but I also keep being disappointed. The mascara seems half-dried up when I open the tube for the first time. This is the third time that has happened. Hard to beat the look DiorShow gives but I ear I must find another product that's packaged more efficiently."
      },
      "norcalgrl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"15 Sep 2008",
         "title":"Great waterproof mascara!",
         "description":"I wore this mascara for my wedding in January. It worked great! Even with the snow falling and landing on my face the mascara didn't budge. Nor did I get raccoon eyes when I started crying during the speeches! Great Mascara!"
      },
      "leveta":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"1 Jun 2012",
         "title":"waterproof and glamorous",
         "description":"Being a lady of age ( : I need to wear a heavy duty eye cream that really works for me. And Dior mascara looks amazing and doesn't smudge under the eye. Thanks for a great product Dior!!!"
      },
      "calypso27":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"15 Jun 2009",
         "title":"show stopper",
         "description":"The waterproof Show mascara is great for show-off lashes. It actually seems to improve the condition of my lashes. Plus, I swim and this stays put. In brief, expensive, but worth it."
      },
      "tieleyo":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 May 2011",
         "title":"Favorite mascara ever",
         "description":"i've used everything (drug store stuff, lacome, chanel, etc). looks sharp, natural (yet black), and holds a curl like nobody's business.\n\nlooooooooooooove this stuff."
      },
      "rainingsparks":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"5 Jan 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Game changer!"
      },
      "chibiworm":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"6 May 2015",
         "title":"SMUDGE like crazy",
         "description":"I got it as a gift (so thankfully I did not waste my money on this piece of c***). I have never tried Dior's mascara before so I was really looking forward to it. This mascara turned out to be a complete disappointment. It smudges sooooooooooooo easily! I only used it as a daily wear at office and there is no hot weather or body exercise or humidity that will contribute to smudging. It is a complete joke branding it as \"WATERPROOF\"!!! Also, it is neither volumizing nor lengthening, very hard to apply as you need to do it so carefully to avoid it touches your eyelid, and you need to do it repeatedly to at least see some effect. Unfortunately I cannot return it as the person gave it to me left the country. But I do hope my review can help other people from wasting their money on this. This product needs to be taken off from the shelf."
      },
      "lilac268":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"22 Aug 2011",
         "title":"Better than most",
         "description":"To be fair, I haven't used a ton of designer/high end mascaras except Dior. Compared with department store brands, I found this to be great at lengthening and defining each lash. It wasn't as \"full\" as I would have liked it and it's sometimes difficult to coat bottom lashes properly due to the size of the brush head. That being said, I still think it's a great choice. Also, it means serious business about the waterproof part - it usually takes me a couple of cotton swabs of remover to get it off each night."
      },
      "tarojelly":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"4 Jan 2013",
         "title":"Soft Defined eyelashes but loses the curl.",
         "description":"This mascara is really soft and doesn't make my eyelashes stiff and brittle feeling. That being said, I have Asian eyelashes which stick out straight, and I need to use an eyelash curler for them. I have to use waterproof mascara so the wax can keep them curled, but I think the reason this mascara is so soft on my eyelashes is that it doesn't have as much wax as most waterproof mascaras have, so my eyelashes don't stay as curled. However, the brush seperated each eyelash, but I didnt feel that there was as much volume as I wanted. I need more drama in my think wispy eyelashes! So I'll be going back to Lancome Hypnose Drama for now! Love the mascara though, even in blue!"
      },
      "karr0tstick":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"17 Apr 2012",
         "title":"Not a fan",
         "description":"Initially, I thought this was a great mascara, but don't bother with the non-waterproof version. It smudges and doesn't stay put for long. It does add volume and lengthens, but it clumps a little. I'm not a big fan."
      },
      "lisalouwho":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Jan 2015",
         "title":"my favorite mascara",
         "description":"I bought this mascara about five years ago. It was the first \"expensive\" mascara I purchased but I decided to treat myself. Since then I have tried other mascaras but I always ended up buying this again. I don't think of this as \"expensive\" anymore. It's become a \"must-have\" and the only mascara I use."
      },
      "fabgal4":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"3 Apr 2012",
         "title":"grossly over advertised.",
         "description":"if racoon eyes galore are the look you desire, then absolutely, DO buy this half dried out tube of smudging goop. dior is not what it used to be. I lived this mascara a few years ago. what happened?!?! seriously disappointing...."
      },
      "xbeemine":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Dec 2012",
         "title":"Diorshow in Black &lt;3",
         "description":"This is my all time favorite mascara! :) Usually when I apply mascara it won't curl even when I curl it but this mascara did the trick and it made my eyelashes look longer ."
      },
      "Eve68":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"27 Jan 2015",
         "title":"Extraordinary lashes",
         "description":"This mascara, combined with the Iconic one, makes lashes look FABULOUS!!! Well-defined, thick, long... WONDERFUL!!!!"
      },
      "pcastillo":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"6 Dec 2008",
         "title":"This mascara does it all",
         "description":"This is the best mascara I have used and I have tried them all. I have skimpy, short lashes yet this mascara makes me look like I have long thick lashes without clumping. It goes on fast an easy and if you curl your lashes they will stay curled with this mascara. Also it does not smudge onto the eyelid as some do at the end of the day."
      },
      "beachbabexo":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"1 Jan 2011",
         "title":"Favorite! :)",
         "description":"This is my first Sephora product and was recommended by a friend who is a Sephora junkie! Well, I absolutely love it. I actually didn't mean to buy waterproof, but I'm glad I did. I cry a lot at movies and stuff, lol, and this mascara is definitely waterproof! No black lines running down my face.\n\nIt's not difficult to remove with make up removerm, either. I've jused drug store brands in the past that were like plastered to my eyelashes. Ridiculous! Dior really has a great line of products.\n\nI also use the DiorShow Mazimizer lash plumping serum before I apply the mascara, and I must say, my eyelashes are amazing! If you're looking for volume and length, I suggest both products.\n\nI have not had any clumping with it and it doesn't seem dry to me."
      },
      "Ashleigh01":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"1 star",
         "date":"1 Nov 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"Like using a baby carrot to apply mascara."
      },
      "Sthgal":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Aug 2012",
         "title":"In LOVE!!",
         "description":"I LOVE LOVE LOVE this mascara. Sooo wondering why it took me so long to find it. I've tried EVERY mascara in the world. Literally. This mascara rocks!! I love the extra length of my lashes, I love the coverage, and it's never clumpy...even the tube is large so you get lots of product. I'm in Love!!"
      },
      "powerfulbeauty":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"17 May 2012",
         "title":"Just OK",
         "description":"I used to use this mascara, it was the only thing I would use. However, I wonder if they have changed the formula because it seems the last 2 tubes I got were very drying and the mascara would flake off of my lashes through the day."
      },
      "jcb1978":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"20 May 2011",
         "title":"Waterproof?",
         "description":"I haven't even tested the waterproof abilities of this mascara yet, but if the raccoon eyes I have every time I wear it are any indication, it's probably not very waterproof. This mascara smudges every time I wear it. Would not buy again."
      },
      "beautybee93402":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"11 Aug 2010",
         "title":"EXCELLENT MASCARA!",
         "description":"This is my second-favorite mascara after Estee Lauder Double Wear. It offers good coverage, lengthens and increases lash volume. It doesn't clump and it doesn't smudge. Makes eyelashes look miles long and fat! The only drawback is the cost."
      },
      "mareese":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"22 Jul 2011",
         "title":"Nicest mascara I've ever purchased",
         "description":"I'm constantly looking for the perfect mascara to help my stick straight lashes. I've tried Nars, Clinique, Benefit, Lancome, MAC, and even Maybelline without being completely wowed. I finally picked up the Diorshow and realized why it is a top seller. The mascara gives my lashes volume and a bit of length and helps keep a curl in my lashes. This is one of the few mascaras I've tried that allows me to put on multiple coats (even with minutes in between) and still has a smooth application. I haven't had a single issue with clumping or flaking. This is worth a try and definitely worth the money."
      },
      "MelissaNYC76":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"11 Apr 2016",
         "title":"Not impressed",
         "description":"It is clumpy and the brush is too large. I love mascara and spent the extra money on Dior - what is supposed to be the top mascara - and I am not impressed. When I tried to apply to my lower lashes, I ended up looking like a raccoon. When I did apply it, I did not think it made my lashes look any longer or fuller than a drugstore brand."
      },
      "jennjetta":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"16 Jun 2010",
         "title":"Waterproof that smudges",
         "description":"I actually did not like this mascara. it smudges after every use. i have to wipe under my eyes constantly - thus removing my concealer. very disappointed"
      },
      "socal05":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 Nov 2012",
         "title":"Favorite Mascara, period.",
         "description":"This is my...I don't even know what review number I'm on, but this the best volume mascara EVER. I've been using it since it came out and I'll continue to do so. The brown is a dark brown. It's a buildable formula. It lasts and lasts all day and into the night, if needed. Not clumpy. I recommend it."
      },
      "eileenpat":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"17 Apr 2011",
         "title":"Best mascara EVER MADE",
         "description":"I started using this based on the Sephora reviews and I am so thankful I did.! This is absolutely the best mascara I've ever used, and it is now the ONLY one I ever plan to use! I'm a hard contact lens wearer have never had a problem with the mascara on that score. It comes off easily with Ponds cold cream (I admit it - I'm old school!)."
      },
      "daphna":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"27 Jul 2010",
         "title":"has this formula changed? I used diorshow in the past and remember it being much thicker and giving me fuller lashes. It doesn't seem like the same mascara????",
         "description":""
      },
      "juliexo":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"25 Jun 2011",
         "title":"Nice, but too expensive",
         "description":"This doesn't clump, has an awesome brush, gives me volume and stays put - no doubt about that.\n\nStill, I won't purchase it again, since it dries out pretty fast (at least mine did) and there are cheaper products out there that fulfill the same purposes."
      },
      "phyllisb":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"19 Dec 2012",
         "title":"best out there",
         "description":"You can try drug store brands and other high end names,but this one is the best around."
      },
      "icee":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 Mar 2009",
         "title":"Great Mascara",
         "description":"I was soo excited when I got this mascara after seeing all the great reviews about it! It is a great mascara! My lashes are pretty average but this mascara gives me volume and length.. but I feel it does way better with a primer. I had L'Oreals Beauty tube mascara and I used the primer under my Dior and it's perfect! I have long,thick lashes! & it is sweat proof, tear proof..waterproof! Would recommend to anybody! *Love!*"
      },
      "sfj786":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Nov 2013",
         "title":"keep coming back...",
         "description":"On my quest for the \"perfect\" mascara I keep coming back to this one since I purchased my first tube 5 years ago. It's funny because I am sensing a pattern: every other tube of mascara is a different brand (both high-end and drugstore) then back again to this one. I love the way the lashes stay separated, I hate clumps! I think the large brush isn't an issue once you get used to it. The one drawback is the price, as it's an item that has to be replaced often--even if there is product left."
      },
      "littlecutey":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"29 Mar 2011",
         "title":"Not bad",
         "description":"The mascara wasn't dry as others had complained it was. The brush is definitely not super-wet like drugstore mascaras can be though. I liked that the lid gives a little click when it's closed so you know it's not going to dry out. I did get some smudging under my eyes, which seems to be reduced by using a mineral powder concealer. Volume was good, lengthening not as good, and a bit flaky by the end of the day."
      },
      "vmuto":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"20 Dec 2012",
         "title":"LOVE",
         "description":"I don't know why I try other mascara's, Dioshow never lets me down! for pretty but not lost lashes and stay all day formula this is a must."
      },
      "Micht350":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"12 Jan 2016",
         "title":"Love this mascara",
         "description":"This is the best mascara I have used"
      },
      "joseibi":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"24 May 2010",
         "title":"Another disappointment",
         "description":"I used Diorshow Blackout before and it smudges very easily. I thought to try the waterproof version but it smudges too! I don't know why because it's not easy to remove with an eye makeup remover and cleansing oil, and yet it smudges so easily under my eyes. Hate that about it. It's pricey for what it is too."
      },
      "myff":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jan 2011",
         "title":"The Best",
         "description":"Doesn't clump. Goes on smoothly. Unnecessary to use an eyelash brush or comb afterward. Haven't worn any other brand since trying this a year and a half ago."
      },
      "Ruth1234":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Jan 2015",
         "title":"HG mascara",
         "description":"I love the original Diorshow but it tended to smudge underneath a lot. I like how natural Diorshow looks while being very lengthening and black. I like that this waterproof mascara doesn't make my eyelashes crunchy and is easy to remove unlike most waterproof formulas. I layer this over my Diorshow maximizer."
      },
      "apojack":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"3 Sep 2013",
         "title":"Good but not great",
         "description":"I am a mascara freak and have sampled them ALL! This one is not a moist as I would like, gets wiped off easy and slow to go on."
      },
      "jablo005":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"11 Apr 2013",
         "title":"Great Mascara but...",
         "description":"Diorshow Waterproof Mascara definitely makes my short light lashes long and pretty, but unfortunately by mid-day it is flaking off making dark circles under my eyes."
      },
      "amndshlyr31":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"27 Feb 2015",
         "title":"It gave more of a natural look. It did smudge at the end of the day.",
         "description":""
      },
      "McSki":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Dec 2014",
         "title":"My FAVORITE",
         "description":"I LOVE this mascara. My eyelashes are long and curly on their own, so I look for a mascara that will define and stay put. This one adds volume without clumping. I've used this one for several years and keep going back."
      },
      "glorianola":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"16 Nov 2009",
         "title":"sad",
         "description":"I love Dior products, and was really excited to try this out. It was NOT waterproof. I would wear it at 8am and by 9am I had dark-ness under my eyes. I looked like a raccoon. I was very disappointed especially for the price I paid. BUT it did volumize well."
      },
      "annec322":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Jan 2014",
         "title":"Love!",
         "description":"I purchased this item after it was recommended by a sales associate. I had asked her to give me whichever type of mascara she felt was the most dramatic one Sephora sold. I had already tried other popular ones, including Tarte's lights camera lashes, Benefit's they're real, and Too Faced's Lashgasm (all good products just not the dramatic effect I was looking for). Well this Dior Mascara put all the other ones to shame. This is a great product. It gives you thick, dark lashes that really make a statement! Perfect!"
      },
      "sprinkles002":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"29 Jan 2009",
         "title":"I can't live without it!",
         "description":"I Love this stuff! It really does make your eyelashes STAND OUT and it really is waterproof. Make sure that you have a good eye cleanser. The original DiorShow Mascara is awesome as well! =)"
      },
      "dollfingal":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"23 May 2010",
         "title":"Love IT!!!",
         "description":"I've been searching for a new good mascara all year (and spent a good amount of money trying out top sellers). I had hear that this was a \"cult favorite\" among make-up artists so I decided to give it a try.\n\nI LOVE IT!!!!\n\nGives great definition, adds some volume, lasts all day and doesn't leave smudges or flakes after all day wear.\n\nI would say it is a lighter weight, more natural looking mascara so if you looking for something to add tons of oomph this is probably not your cup of tea!"
      },
      "sarahkincaid":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 Jul 2012",
         "title":"Best Mascara",
         "description":"I never thought I would feel it necessary to purchase mascara over $10.00, but I would pay $100.00 for this product...I have NEVER used any mascara that provides even half of the benefits and look! XOXO"
      },
      "demandrea":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"11 Apr 2009",
         "title":"too black for me",
         "description":"I bought this mascara because it was in the shade of \"chestnut.\" It isn't! It is black or very dark brown at best, If your looking for a lighter mascara for lighter skiin, don't buy this."
      },
      "grrace":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"3 Dec 2009",
         "title":"I have extremely watery eyes and so after about 12 hours my mascara smudges like crazy but i haven't had any other problems with it. It dries quick and it's great for those mornings when you're running late and don't have much time for makeup",
         "description":""
      },
      "afitzg75":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"28 Sep 2014",
         "title":"Not waterproof enough",
         "description":"Doesn't hold curl for me, even paired with a primer. Since that's the biggest reason I use waterproof formulas this was a miss for me. Ended up returning it."
      },
      "Weezy1":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"17 Nov 2012",
         "title":"A bit pricey for what you get",
         "description":"I tried this for my daughters wedding. It does add thickness and does not leave any dark cirlces under your eyes which is great.Stays on well. I just found that even though I curled my lashes this stuff is so soft that my lashes did not hold the curl and I didn't get the effect I was hoping for."
      },
      "leeloo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"17 Oct 2011",
         "title":"This is my all time favorite mascara. It builds, lengthens, and really defines the lashes.",
         "description":""
      },
      "lindswing":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Aug 2012",
         "title":"My favorite",
         "description":"Definitely the best waterproof mascara I've tried, and I've tried a lot of them. It dries without clumping or getting weird, and it makes your lashes look incredible. I don't splurge on it very often, sadly, but I eke out every last swipe when I do."
      },
      "RoseannM":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"1 star",
         "date":"12 Jul 2017",
         "title":"Disappointing",
         "description":"I bought this product based on reviews and was so disappointed. Within an hour of wearing this product at work, I had dark circles under my eyes. Have no idea how they can say this is waterproof."
      },
      "concretestiletto":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 May 2009",
         "title":"I love this stuff!! My favorite is the Dior Iconic but I couldn't get it in waterproof. Wore this in Vegas while chillin and swimmin by the pool and it never budged. Beautiful:)",
         "description":""
      },
      "sephoraaaa1028":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Aug 2015",
         "title":"AMAZING",
         "description":"I have used this mascara for about a year now and I absolutely LOVE it. Seriously amazing results. However, I recently tried the new mascara when I went in to Sephora last and I HATED IT. Since then, I bought 4 new mascaras trying to get the same effect, but I did not find one. I am so pleased it is still available online!!!!"
      },
      "MilaLila":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"7 Nov 2013",
         "title":"The best",
         "description":"Love this mascara I have tried many others this one is truly the best, I have long straight eyelashes after I curl them I use this mascara keeps my lashes perfect all day long !"
      },
      "nicol3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"3 Dec 2015",
         "title":"Volume, but NOT Without the Mess...",
         "description":"I've been using the \"Diorshow Iconic Waterproof Mascara\" as my go-to mascara for ages now, so when my tube was running low I went back to Sephora to purchase a back up. I took a picture of the box so I knew which code to look for to ensure I picked up the right one... Well, silly me only looked at the box thinking there's no need to check inside. When I got home, to my surprise, this mascara was in the box! I was furious, but I knew it was my fault as well for not double checking, so I thought I would give this mascara a chance.\n\nI opened the bottle to see a gigantic brush caked with mascara. Since this wasn't the the brush style I was used to, I applied it as slowly as I possibly could. Some product fell off of the brush, even after doing my best to scrape it off on the top of the tube, and went into my eye – very uncomfortable. Then as soon as I fully opened my eye, and my lashes touched my skin, the mascara smudged everywhere *sigh*.\n\nAt this point I was determined to make friends with the mascara because I wasn't planning a trip back to Sephora any time soon.\n\nI'd say after four or five attempts with this mascara I finally made it work. I started putting this one on first as a rich, thick, and voluminous base, and then adding my original (depleted tube) on afterwards to clean it up. The sleek brush from my original mascara was the saviour here.\n\nCONS:\nThis mascara cakes on, doesn't dry quickly, and clumps almost instantly with two swipes. It's also very hard to get to the eye lid without smudging this somewhere.\n\nPROS:\nIt does add a lot of volume if you get the hang of it, the colour is rich and dark, and combined with a more subtle brush [afterward] it gives your eyes a nice finish – if you're able to remove the clumps.\n\nWould I buy this again? I honestly don't think so.\n\n--\n\ntl;dr – The mascara clumps, is messy, slow to dry, and difficult to apply if you're not used to it. Does provide volume if combined with a thinner brush and you're able to remove any clumps from the lashes."
      },
      "tashinamaria":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"7 Aug 2012",
         "title":"Awesomeness",
         "description":"This is the only mascara I use anymore. I have naturally long lashes but this adds thickness and beautiful black color. Makes me feel savy!!"
      },
      "RroseR":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"16 Apr 2016",
         "title":"Formula changed?",
         "description":"I used to use this religiously, but I felt like the formula has changed or something.  Not a fan of it anymore."
      },
      "fabtwinsmom":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"28 Aug 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838771+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Blue",
         "description":"Beautiful blue"
      },
      "sotobanks":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"7 Aug 2011",
         "title":"It's wedding season....",
         "description":"I wore this mascara for my own wedding a year ago and made sure to have a fresh tube for this summer's wedding season. Doesn't run, but DOES do wonders for your lashes. A must-have for me!"
      },
      "canmynamebethis":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"14 Jun 2011",
         "title":"I love that this mascara gives the fullness, length, and curl it promises, but I don't like that it smudges. Although it's waterproof, I always have to be conscious of black smudges under my eye throughout the day. :(",
         "description":""
      },
      "gloria1956":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"16 Feb 2016",
         "title":"So disappointed",
         "description":"This mascara was a bitter disappointment. It ran from day one. I tried powder under my eyes, but it still ran. Back to Loreal's volumizing mascara - 100 % better at a fraction of the cost"
      },
      "lamby":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"11 Dec 2011",
         "title":"Ironically becomes waterproof when being removed",
         "description":"I bought this after trying the regular DiorShow (which I really like). I live in Hawaii...it rains a lot...waterproof mascara seems like a good idea. So I bought this. It ran, flaked, smudged, and gave me racoon eyes within an hour of applying. It wasn't waterproof until I tried to remove it. Had to use two kinds of eye makeup remover and lots of scrubbing...and it would still be flaking and leaving smudges the next day. Wore it about six times and threw it out. Going back to regular DiorShow because it actually doesn't run/flake/smudge/racoon like the waterproof stuff."
      },
      "SanneWoo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Jul 2014",
         "title":"Loveliness",
         "description":"If you cry at weddings movies proposals or just sad tv commercials this is your mascara! it's extra super extremely waterproof, but when it's time to remove it comes off very easy and effortless! Very luxurious exactly what to expect from a nice brand as Dior! Love!! J'Adore!"
      },
      "ginz311":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"7 Jun 2012",
         "title":"smudges too easily",
         "description":"i was really disappointed in this product considering the brand name that its attached to. not more than 5 minutes, the mascara started smudging on my lower lid. even after cleaning it up... an hour later, i still ended up looking like a raccoon."
      },
      "SCNerd":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"22 Mar 2016",
         "title":"Not Smudge-Proof",
         "description":"I have thin straight lashes.\r\n\r\nDelivers thick, full lashes?  Yes\r\nLengthens decently? Yes\r\nHolds curl? Average\r\nWaterproof? Average\r\nSmudge-Proof? No. It smudges a GREAT deal, setting powder or not.\r\n\r\nMascaras that smudge are the bane of my existence. Extremely disappointed. This was a near-perfect mascara. $27.50 mascaras should not smudge."
      },
      "Sophisticated1":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"28 Aug 2013",
         "title":"Love it!",
         "description":"I live in hot humid Florida. The waterproof mascara I used to use became discontinued so I purchased this one in black. I have long lashes and like them to look their best without being overly heavily done up. I love the way it applies elegantly without clumping. I can achieve the soft look I like or layer for a more dramatic effect, maybe when I'm going out. The reason I don't give it a 5 star is that by the end of the day, it has smudged a tiny bit. Nothing dramatic and only if I have been outside in the Florida heat working out. But waterproof it is."
      },
      "ythak":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"1 May 2010",
         "title":"dior waterproof?",
         "description":"Thsi was recommended when I asked that it must be waterproof and the woman assured me it was. I applied it and within 30 minutes I had racoon eyes. I need to return it"
      },
      "melissalu":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"18 Aug 2011",
         "title":"Great for Asian lashes",
         "description":"My best friend gave me my first DiorShow last Christmas. At first I was hesitant to start using waterproof mascara since I had to start washing with eye makeup remover instead of just with my normal face wash. I let the mascara sit for a couple months before I gave it a chance. But then I became curious to try it out since I heard that waterproof mascara holds curl better. I typically curl with my eyelash curler for at least 10 minutes since my Asian lashes so stubbornly stick-straight. As soon as I put on my old (non water proof mascara) they would turn immediately stick straight again.\n\nThe first time I tried DiorShow I fell in love. My lashes stayed curly after I used this mascara and it did not clump at all. Also doesn't smudge through my long work day. If I go out at night, I just swipe a few more strokes of DS and I'm set to go. Love it!"
      },
      "jari1119":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"29 May 2012",
         "title":"BEST!",
         "description":"Personally, waterproof mascara's work the best for me because my eyes tear up often and i'm also a laugh crier (the worst). I went to sephora the other day and decided to purchase this mascara with the Lancome XL lash boost primer. The two together work like magic for my lashes. My lashes have never looked loner, thicker, and better. Great job Dior!"
      },
      "simplyred86":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"29 Jul 2009",
         "title":"this mascara is fantastic! i have outdoor allergies so my eyes water quite a bit, and this mascara doesn't budge...actually it barely comes off in the shower! the shape of the brush is perfect for volumizing my lashes and it doesn't clump up. It gives enough drama with a few coats for a night out and is subtle enough with one or two coats for day time. overall a very versatile product, i will definitely be buying this again and again!",
         "description":""
      },
      "GlossyLee":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Jun 2016",
         "title":"Friends used to rave about this, so I finally decided to try it. The formula must have changed, because this is awful and I can't imagine anyone thinking it's good. This gave me raccoon eyes in a matter of hours.",
         "description":""
      },
      "pinkpleaz":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"20 Jul 2015",
         "title":"Okay but......",
         "description":"This mascara gave me big gorgeous lashes; too bad the formula (I bought waterproof!!) was under my eyes in less than 2 hours!"
      },
      "ms1028":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Sep 2010",
         "title":"Completely impressed!",
         "description":"I am a big fan of Clinique’s high impact mascara, but with the onset of allergy season and an upcoming funeral to attend- I desperately needed something waterproof. I read the reviews for Clinique (which weren’t all that great) and then read the most recommended on Sephora’s site. I was a little hesitant in getting DiorShow because of the price – but it was worth EVERY PENNY!\n\nThis mascara did not run, smudge or flake at all the day my tears were flowing for 12+ hours. What I loved most about it was the brush and the ease of putting it on. The brush was fuller than Clinique’s high impact, so I got longer, fuller, thicker lashes. I couldn’t believe it stayed put all day. I read the other reviews about the flaking and that didn’t happen to me at all. You don’t need numerous coats either, just brush it through until all lashes are evenly coated – it looks like professionally done lashes after application. I’m so glad I went with this product, and equally as glad that it did what it was supposed to."
      },
      "biscuitz":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"16 Oct 2008",
         "title":"Best Mascara on Market!!",
         "description":"I have about 10 different high end masacaras in my make-up case...different varieties of Clinique, Lancome, Laura Mercier...Diorshow is the BEST mascara hands down! My eye lashes just can not hold a curl all day. This mascara gives them volume and length and keeps the curl all day - AMAZING!! I LOVE IT!!"
      },
      "Winegals":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"27 Jul 2013",
         "title":"THE ONE &amp; ONLY!!",
         "description":"In my 40's and I've tried just about every mascara out there! This is the one!! It does exactly what it says it does. I've been using this for years, and will continue to do so as long as it's available."
      },
      "star25":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"18 Aug 2012",
         "title":"My new favorite",
         "description":"I bought Diorshow Waterproof Mascara by mistake but I decided to give it a try and was pleasantly surprise. It makes my lashes a mile long and last all day looking like I just apply it."
      },
      "boppa":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"2 Apr 2009",
         "title":"not great",
         "description":"was told by salesperson that it would be great for keeping the curl...not so much. Immediately lost its curl...sad!!"
      },
      "bostonlady233":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"23 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s838763+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Catwalk Black",
         "description":"I love this mascara so much. It’s been the only kind I use since I first discovered it 10 years ago, which says a lot! I use it with the lash primer and it works flawlessly. I just wish they made a mini/sample size so I could more easily throw it in my clutch or purse when I go out."
      },
      "amanda17171717":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"2 Aug 2010",
         "title":"I LOVE MY DIORSHOW!",
         "description":"With only one swipe of this awesomely huge brush you get everything-volume, length, definition! And it really is waterproof! :) (my sisters and I sprayed water at each other for fun once and this stayed on!) At first I thought it was a little overrated but really, this mascara is perfect! Buy it!"
      },
      "Cosuna":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Jan 2014",
         "title":"Its wonderful.",
         "description":"I haven't been able to find a good mascara. But this one is wonderful. The brush works great, when you pull out the brush its NOT clumpy. My eyelashes POP (lol)"
      },
      "DonnaOh":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"23 Jul 2015",
         "title":"Diorshow Delivers",
         "description":"I used to use a voluminous, waterproof mascara. Treated myself to Diorshow for a birthday.\nWhen I ran out, I couldn't remember what was so special about it, so went back to the old mascara. 3 days later, I threw that out and bought Diorshow again. Love it!"
      },
      "Diva83":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"23 Feb 2009",
         "title":"Surprised W/ results",
         "description":"To start off I have long fine lashes that usually get weighed down by non-waterproof mascara. I tried the regular diorshow and I hated it b/c it was too wet and sloppy, tried iconic and blackout hated them as well, I was hesistant on trying this version but was told it would work better since its waterproof. It is true, it holds my curl after I curl them w/ Shu Uemura, nice rich black and my lashes look like a pretty fan of sexy lashes. I gave it 4 out of 5 b/c the brush is so big it's hard to apply it w/out making a mess."
      },
      "espoo5":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"29 Dec 2010",
         "title":"love this mascara, it's the only one I can use as I have oily skin and all the other mascaras smudge all over!!!!",
         "description":""
      },
      "batgitl":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"13 Jul 2012",
         "title":"the best",
         "description":"I have tried so many mascaras and I keep coming back to this one. I have short and skimpy lashes and wouldn't have but a couple if I didn't also use Latisse. This mascara never collects under my eyes as so many others do and it makes my lashes look so much better."
      },
      "chelsea19":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"10 Apr 2009",
         "title":"not worth the money",
         "description":"At first I thought this mascara was pretty good but after trying it at home i realized it wasnt worth buying again or even using another day. It smudged, had a weird smell, flaked, and irritated my eyes. Its extremely hard to take off even with makeup remover and does not make my lashes look any better than a drug store mascara would."
      },
      "iortiz0404":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Oct 2013",
         "title":"It's in The Brush!",
         "description":"And worth evert cent. The brush has the perfect amt. and type of bristle. I have short, thin lashes. This Mascara helps to improve both issues with a great looking result. Ive tried a few other name brands, but keep coming back to this one."
      },
      "robind323":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"21 Jan 2009",
         "title":"Diorshow Makes Lashes STAND OUT",
         "description":"This is one of the best mascara's I've used. It really does make your lashes have that WOW FACTOR. However I have one problem. I don't believe it's truly waterproof. After wearing it for a few hours I get these black marks under my eyes like it's smearing. I don't get it. It does it even when I have a day when all I wear is mascara and lipgloss. Weird"
      },
      "seppo":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"8 Mar 2012",
         "title":"awesome",
         "description":"This is hands down the best mascara I've ever used. I've tried the other formulas but this one works best on my long lashes. It makes them longer, separates them as well and never clumps. I use the waterproof and never have a problem. Run to get this, its that good."
      },
      "GennipherW":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"3 Oct 2012",
         "title":"The Best",
         "description":"I travel and teach for a living so I need something that stays on and looks great all day. Doesn't clump, stays on and easy to come off at night. The only one I've used for years!"
      },
      "esthetictian":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"13 Apr 2009",
         "title":"This makes me sad!",
         "description":"Oh I am so sad about this product. It makes my lashes look soooo great. I only wear waterproof, and am happy to find that in this product. However this product gave me racoon eyes half way through my day. My friend had the same problem. We love it so much that we wiped it away half way through our day. But I truely want to find a product that makes my lashes look like this, without the raccoon part!"
      },
      "roshyh":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"5 Sep 2012",
         "title":"Great for a natural look",
         "description":"Not the blackest or the most lengthening mascara, but creates beautiful natural lashes."
      },
      "beracah12":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"3 Feb 2011",
         "title":"Christian Dior mascara",
         "description":"The azure blue is tops! I get compliments all the time! from people of all ages and gender. Hope they NEVER stop producing it. Thanks Sephora for always having a supply! I gave my second one as a birthday gift and the receiver was very greatful."
      },
      "tat2chk":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 Mar 2009",
         "title":"I love this mascara",
         "description":"I have no complaints with this mascara. Best I've ever used!!!"
      },
      "buschy":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"19 Aug 2014",
         "title":"Dramatic Eyes in a tube!",
         "description":"I'm beginning to use this wonderful product on a day-to-day basis as I love the volume and lengthening I get when I use it. My lashes aren't too short, but they're blond tipped, and there's not an over-abundance of them. This mascara brings out the glamour and really pops my eyes. I love it!"
      },
      "lcael":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"25 May 2010",
         "title":"best I have tried in years...",
         "description":"No flakes! wears well & washes off with my gentle cleanser choice (Philosophy PURITY) . smuges just a little after 80-90 mins of cardio activitiy. and I love the BROWN ...I think it is more flaterring."
      },
      "sephorastopfan":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"23 Jul 2015",
         "title":"not for me",
         "description":"I wasn't really into how this product dried, and I did not feel like it gave me a full or volumized look. Too lazy to return, but definitely purchased other brands and won't use this again."
      },
      "jcat425":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"7 Oct 2013",
         "title":"Best mascara",
         "description":"I loved this before (in black) but now using the blue and it's just awesome. It's subtle enough to wear everywhere and adds an extra pop when I want/need it."
      },
      "gap23":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"8 Nov 2010",
         "title":"Smudges. . .",
         "description":"I bought this thinking that waterproof would actually work and I wouldn't be walking around with big raccoon eyes but FAIL. It didn't work for me!"
      },
      "wyzenskid":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 Jan 2014",
         "title":"Love",
         "description":"I love this mascara. It gives great coverage without being lumpy and gives a full look to your eyelashes."
      },
      "Smallsgirl":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"27 May 2009",
         "title":"What's the big deal?",
         "description":"I have heard rave reviews about Dior Show Mascara for years and finally decided to give in and try it. And, I'm sorry to say, it was horrible. I needed something super strong since I blink a ton, so the salesman suggested the waterproof version. Yet, even after letting it dry, within minutes it smuged! I decided to give it a few more days...but alas, when it rolled off my bathroom counter on to the floor, the bottle cracked and broke and not after just two days of using it....it's useless. I will never give it another try and an completely disappointed. i only hope that when I take it back to complain, Sephora will honor the return. For $24 bucks a pop, the packaging should be able to withstand a two foot fall from the sink!"
      },
      "hottstuff":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"11 Jul 2009",
         "title":"Fabulous",
         "description":"Absolutly amazing! It stays put even through a long day in the water!"
      },
      "jenr2107":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Dec 2008",
         "title":"Great waterproof mascara!",
         "description":"This mascara works great without clumping. The brush is a little bit on the larger side, which took some getting used to - but that is the only downside to this mascara. Really helps my short lashes stand out and look defined, plus it REALLY IS waterproof!"
      },
      "jennymacneil":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 May 2010",
         "title":"I love DiorShow the best mascara I have ever used!! The only thing is I accidentally bought waterproof. I would stick with regular its hard to get off.",
         "description":""
      },
      "aidenxo":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"6 Dec 2015",
         "title":"so yeah i had hurt my foot and i had the mascara on at the same time. so i had cried too cuz it really hurt and my little toe was red so when i cried my mascara wasnt ruined. Thanks sephora",
         "description":""
      },
      "Kiddsize":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Feb 2017",
         "title":"love this mascara!",
         "description":"Love this!! Makes your eyelashes look you have fake lashes on! I just don't like that I easily get it on my eyelids when applying it but it seems like everyone else has that issue too! I'll be buying it again as well"
      },
      "brandizieg":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"15 Jun 2017",
         "title":"Best Mascara!",
         "description":"I have tried alot of mascaras, and always end up back to Dior. It never flakes, doesn't smudge, and you can look natural or build it up to glam. I am a contact wearer, and unlike some others, Dior never makes my eyes itchy."
      },
      "lily231":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"24 Jan 2009",
         "title":"Pass on this one",
         "description":"I had high hopes for this mascara after reading the reviews and getting rave reviews from a friend. The mascara does a good job on thickening, but is not smudge proof. After less than two hours I had racoon eyes."
      },
      "cclina821":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"1 Jul 2013",
         "title":"Surprisingly mediocre mascara",
         "description":"I've always heard great things about Dior mascara so I was really excited to purchase this one. I sail almost everyday during the fall and spring so I decided that the waterproof would work best. For the first week I was pleased with the product, but then I started noticing that when used on my lower lashes it would smudge all over the place leaving me with raccoon eyes, not a good look. Once I noticed that I started using it only on my top lashes. It was volumizing and the black color did really define my lashes, but I always felt like they clumped quickly after application. I do love Dior makeup, so I'm hoping I just made a mistake with the waterproof and the normal DiorShow will be more successful."
      },
      "ErinnirE":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"16 Nov 2012",
         "title":"I decided to finally try a waterproof mascara as I was tired of getting raccoon eyes from regular mascara. The lady at the store convinced me to go with this one in the brown. I was worried that the shade wouldn't be dark enough and not accent my eyes. I was wrong! This is a deep shade of brown and worked beautifully on my blue eyes. (Black is too harsh for me, so I usually go with a brown-black mascara and this was similar to that in my opinion.) I found it nicely defined my lashes and wasn't clumpy or vampy in any way. (I hate those volumizing mascaras that make your lashes look like freaky spiderwebs!) It also stayed put through my long work day and didn't end up under or around my eyes. This is a great formula and worth every cent.",
         "description":""
      },
      "LCary":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"15 Nov 2015",
         "title":"Flaked and cracked",
         "description":"Flakey and crumbly from day one. Was recommended to me but not a fan."
      },
      "CYRY":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"21 Jul 2010",
         "title":"Best mascara to hold a curl",
         "description":"I have naturally long, thick, dark lashes but they would never hold a curl. This is the only mascara that holds the curl and it lasts from the minute I put it on in the morning until I go to bed. I curl my lashes with the Shu Umera lash curler first and then put on a coat of Dior Show. Worth noting that it seems to be something in the waterproof formula that holds the curl as the regular DiorShow had minimal effect. Also, a few posts about it being hard to remove - I just use Neutrogena waterproof eye makeup remover ... it comes off clean."
      },
      "amhwk":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"11 Jan 2013",
         "title":"DiorShow",
         "description":"This is the best mascara out there! I have used this for about 4 years and will not even think about switching to another brand."
      },
      "Mich22":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Jan 2016",
         "title":"tried and true",
         "description":"This has been my go to mascara for years and years. The thick bristled brush really adds volume and the formula is very dark, which I love! Must focus the product on the ends of lashes to build more length, but works very well. You won't be disappointed with this mascara!"
      },
      "indenial":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"31 Mar 2013",
         "title":"Perfection",
         "description":"I have long lashes, so I want to enhance then but have to be careful that they don't look fake. This works perfectly. While I'm not fond if waterproof, other mascaras end up. With under-eye smudge. This never does that I've tried lots of other mascaras, but always come back to the best."
      },
      "col3r":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"6 Sep 2013",
         "title":"I tried this mascara, because people rave about it however, I did not feel the same. The applicator is HUGE, so applying the mascara was difficult. I like to get waterproof mascara so I can wear it all day and not worry about it smudging, unfortunately this mascara did not hold up all day :(",
         "description":""
      },
      "nashbash":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"11 Sep 2015",
         "title":"Wanted to love this.",
         "description":"This mascara looks amazing on my lashes, but it smudges all over the place and makes me look like a panda. I can't get through an 8 hour shift without looking like I got hit in the face. Definitely not waterproof or worth it."
      },
      "monteer2":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Jul 2011",
         "title":"Best Mascara I've Ever Used!",
         "description":"This product is totally worth the money! It goes on so smoothly and you can put on as many layers as you want without it getting clumpy. It also stays put wonderfully!"
      },
      "rozlynzs":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"14 Jul 2015",
         "title":"Dior Show Jet Black",
         "description":"This is my go to mascara. I have tried all the others, however they either disappoint me with allergic reactions, bits and blobs falling onto my face during application, or a generally fake appearance. Dior Show never disappoints.\nI have fine hair and lashes and this mascara builds length and with while gliding on smoothly during first or secondf coat. Worth the extra $."
      },
      "xxaabb":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"12 Jul 2013",
         "title":"Good but not Great",
         "description":"Used Mascara while on vacation in VERY HUMID Cancun. It still smudged and ran at the end of the day after wearing at the beach and in the pool. As a general waterproof mascara it would probably be just fine. LOVE the non-waterproof version as many do but this formula fell short of my expectations."
      },
      "jamadian":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"4 Nov 2012",
         "title":"Not worth buying",
         "description":"I bought this upon a suggestion because I had asked for a mascara that was waterproof, I wear contacts. I had this all of 2 days and returned it. Very pricey for something that doesn't live up to what I need it to do. It does lengthen eyelashes but it flaked off. No good."
      },
      "glamslamt":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"19 Nov 2011",
         "title":"Not for me",
         "description":"Wand is a bit big for my liking and puts little product onto my lashes. Smells awful too. Also extremely hard to wash off my eyes (and under my eyes) with my make-up removing face wash."
      },
      "lawrgrl":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"17 Oct 2016",
         "title":"Used to love this",
         "description":"I used to love this mascara but recently it is just not working. I don't know if they changed the formula but it is just...odd. It is impossible to put on smoothly because it just will not dry! My lashes clump together in weird knots and it smears under my eyes from looking down at the computer. What a waste! And it used to be so good...."
      },
      "vermonter":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"19 Jul 2009",
         "title":"dior show waterproof mascara",
         "description":"maybe my eyes are small but I found this wand to be ginormous. a little hard to use without getting mascara on my lids and under my eyes. I 'll keep working with it."
      },
      "beautybunnyy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Nov 2014",
         "title":"amazing",
         "description":"Absolutely love this mascara. I've been using it for 5yrs + and its perfect. So many of my friends are now hooked also! It really is waterproof! The only thing is, as with most mascaras, a brand new tube works better after its used 2-4 times. You'll be glad you tried this!"
      },
      "bizmark":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"29 Jun 2013",
         "title":"cool color",
         "description":"very good product.I need the waterproof and that it is but when its time to take it off, it comes off easily. The blue color is beautiful and makes your lashes look longer and thicker. A trick is to put a lighter color on your lid it makes your eyes stand out with the blue in the mascara."
      },
      "mistressmorgan":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"12 Apr 2013",
         "title":"Lovely Mascara - Still Runs Like Crazy",
         "description":"What's up with the running, Diorshow? You're waterproof, and should stay in one place. Instead you end up underneath my eyes.\n\nThe brush that comes with this mascara is absolutely amazing, and when the mascara stays on your lashes it looks great. No clumping, just gorgeous, lengthy lashes from here to Sunday! Unfortunately, the running is a deal breaker, so I probably won't purchase this item again. :("
      },
      "Dlrium":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"11 Apr 2016",
         "title":"Perfect for Racoon eyes",
         "description":"I was very disappointed by Diorshow Waterproof Mascara.\r\nWhen I put this mascara on, I\"m guaranteed to have a dark shadow ( aka racoon eyes) within a few hours.\r\nI don't rub my eyes since I wear contacts. And yet this waterproof mascara will flake and smear just from the humidity in GA.\r\nI will not be purchasing this again and I recommend you stay away"
      }
   }
}