{ 
    "product_name":"Emotionproof Mascara",
    "product_type":"Mascara",
    "brand":"Tom Ford",
    "url":"https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433",
    "reviews":{ 
       "hannahsun14":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"13 May 2019",
          "title":"Tati Approved &amp; that’s all you really need to know...",
          "description":""
       },
       "beautygirl44772":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"4 stars",
          "date":"13 May 2019",
          "title":"it’s pretty nice",
          "description":"To be honest I wanted to hate this. It’s really expensive for mascara and after recently buying and loving the Pat Mgrath fetish, I didn’t think I’d find anything better. I wouldn’t say this is better, but I’d say it’s different. Fetish really brings it with volume and length if you’re okay with clumpy (I am), but Tom Ford takes it when it comes to nice length that doesn’t clump. I feel I now need both in my collection so RIP my wallet."
       },
       "browneyedgirl11":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"17 May 2019",
          "title":"Best mascara ever. I have found the one. I have horrible allergies and my eyes water constantly. I also was in the rain AND then sprayed myself in the face with water—it did not budge. There is the tiniest amount of flake but my god. The right amount of volume and length for me. This is the best mascara ever. Like ever. Comes right off with waterproof makeup remover.",
          "description":""
       },
       "jedmonds96":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"4 stars",
          "date":"15 May 2019",
          "title":"good, not great",
          "description":"This mascara is definitely really nice, it’s super volumizing, not too clumpy, and still lengthening. The only thing it doesn’t do for me is give me the waterproof mascara dry down I need. I have straight lashes so if they can fall out of a curl they will, and unfortunately this mascara won’t hold the curl like I need. However I layer it over Lancôme monsuier big waterproof and it works as a combo!"
       },
       "tj90":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"4 stars",
          "date":"15 May 2019",
          "title":"This mascara will give you length and volume. It truly is waterproof and smudge proof. Accidentally rubbed my eyes with the mascara on and it didn’t budge or smudge. The reason I knocked down a star was because it does make your lashes a bit clumpy. Also when I put the mascara on both top and bottom lashes they tend to stick a little to each other when I blink sometimes. But all in all it does what it says it will do.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
          "description":""
       },
       "rainsound1004":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"16 Jul 2019",
          "title":"this is my holy grail mascara and i’m so glad it’s back. i had been using this for a long while and then suddenly earlier this year i believe, i saw that it wasn’t available anymore and i was so heartbroken. but then i saw its back just rebranded as emotionproof and i’m SO. HAPPY. i had tried many other waterproof mascaras and this one was still my standard that i compared them to. i’m asian so my lashes are stick straight but this mascara keeps them curled, and as long as you don’t layer it too much, it doesn’t clump which is nice because more often than not i prefer a more natural look and this helps give me the look i want while still making a noticeable change. one of the best mascaras hands down.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
          "description":""
       },
       "Gbluz":{ 
          "extra_info":"<b>Age</b> 25-34",
          "stars":"5 stars",
          "date":"23 Jun 2019",
          "title":"Great mascara!!",
          "description":"Except for the price this mascara is awesome. It leaves your lashes good enough. This is completely waterproof and easy to remove."
       },
       "Erika1082":{ 
          "extra_info":"<b>Eye Color</b> Green",
          "stars":"2 stars",
          "date":"28 Jul 2019",
          "title":"Not too impressed.",
          "description":"I don’t really see a difference between this product and really any mascara that costs half the price. Its not a terrible mascara or anything, just not outstanding. It doesn’t smear throughout the day, which is good because I have oily eyelids. It does however flake quite a bit. Every time I’ve worn it by noon I have flaking under my eyes. I know it’s the mascara because I don’t frequently wear eyeliner to work. I’ll be returning, nearly 50$ for flaky mascara doesn’t fly with me.\n…read more"
       },
       "CCATL16":{ 
          "extra_info":"<b>Eye Color</b> Gray",
          "stars":"5 stars",
          "date":"31 Jul 2019",
          "title":"incredible !",
          "description":"Unfortunately.... this is the best of the best. And I say that because ouch it’s expensive. However, I wore this mascara in Tulum (extremely humid) all day riding a bike, visiting the Mayan ruins in the scorching sun (an enormous amount of sweat) , swimming in a cenote AND it still made to dinner after ALL OF THAT. Absolutely no running whatsoever. My fiancé approves even after he heard the price. Tom has done it again. Note: this didn’t give me a dramatic eye whatsoever- beautiful natural lashes with a bit of added length and volume - but perfect for all day wear especially for long flights -\n…read more"
       },
       "lilangel36":{ 
          "extra_info":"<b>Age</b> over 54",
          "stars":"5 stars",
          "date":"12 Jul 2019",
          "title":"I love everything about this mascara except the price. It gives me great length without the clumpy spider lash look and stays put. This allergy season has been the worst, but this stuff is anazing. Looked perfect even when my eyes were watering or if I itched them.",
          "description":""
       },
       "PieNicole":{ 
          "extra_info":"<b>Age</b> 35-44",
          "stars":"5 stars",
          "date":"18 Jul 2019",
          "title":"FINALLY!!!",
          "description":"For me, this mascara is worth its high price. I have tried several top-rated waterproof & smudge proof mascaras (high-end & drugstore brands) that have failed me. But not this one!!! And, it washes off quite easily with the appropriate cleanser (I use a cleansing balm) -- so you won't find residue on after you've spent five minutes trying to rub waterproof mascara from your raw eyelids. Thank you, TATI for recommending!!!\n…read more"
       },
       "pinkpixiedust17":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"1 star",
          "date":"23 Aug 2019",
          "title":"46$ for what?",
          "description":"Ummm....I found it to give length. And that’s about it. It didn’t add any volume. It also wasn’t very black. I can’t say anything about “emotion proof” cause there’s no way I’m paying 46$ for a mascara that doesn’t do anything worthy of 46$"
       },
       "frunzabee":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"16 d ago",
          "title":"Great pigment",
          "description":"Woooooow, shocked! This mascara is very pigmented. My lashes are dramatically voluminous."
       },
       "itslykregina":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"13 Jun 2019",
          "title":"Best Waterproof Mascara",
          "description":"This mascara is waterproof but comes off easily with a makeup wipe. It also makes my natural lashes look amazing!!"
       },
       "misstan":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"17 Jul 2019",
          "title":"my favorite mascara!",
          "description":"I have tried sooo many different mascaras, this formula is my holy grail though. It lasts all day and night, no need to re-apply. It doesn’t smudge and most importantly it doesn’t irritate my eyes. With most other mascaras by the end of the day my eyes are itchy and I have to rub them and I get mascara all over my face this is the only one I’ve used where that doesn’t happen. I highly recommend."
       },
       "StinasaurusRex":{ 
          "extra_info":"<b>Age</b> over 54",
          "stars":"4 stars",
          "date":"1 Aug 2019",
          "title":"Really is emotion proof!",
          "description":"This lives up to the description of emotion proof! It did not smudge or leave marks or leak down! The only reason I gave it a 4 instead of 5 is because it was a bit irritating on the lashes closer to the inner corners of my eyes. I have pretty full, long, lashes naturally so the inner corner lashes started to almost feel sharp and pointy, but this mascara really does last! Super impressed!"
       },
       "delcymartins":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"4 stars",
          "date":"19 Aug 2019",
          "title":"Is it worth the Hype?",
          "description":"OK so I decided to buy this mascara was because Tati Westbrooke raved about it. So I decided to give this puppy a try. I gave this a 4 star because it does give you volume and it does lengthen your lashes, but it does have a tendency to have fallout and the cost for me is too high for a mascara. I won't be buying this again, I'd rather stick the Chanel."
       },
       "SusieQ6189":{ 
          "extra_info":"<b>Eye Color</b> Blue",
          "stars":"2 stars",
          "date":"5 Aug 2019",
          "title":"Super hard to wash off and didn’t give me the gorgeous lashes that I wanted. Just an average mascara.",
          "description":""
       },
       "knf519":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"19 d ago",
          "title":"Totally worth every penny! This mascara stays on so long. My lashes look soooo FULL and SO thick!! I love it! I got this in my influenster package and I am SO lucky to have received it because this mascara is the BOMB!",
          "description":""
       },
       "Jericasmu":{ 
          "extra_info":"error getting this field.",
          "stars":"1 star",
          "date":"19 d ago",
          "title":"Hard pass!! not impressed",
          "description":"Ok I have to say right off the bat that I am not impressed. I was SO excited receiving this to test complimentary from influenster especially because of the name ,price point, and I was just grateful to even be receiving something like this to test. This is a perfect example to everyone that just because some products/name brands are considered high quality does NOT mean it actually is the best. When I put this on I was expecting my lashes to look different than what my everyday mascara does for me. Nope. I will say that it does give me a lot of length but nothing so drastic from my everyday mascara that I wear. I had to keep adding multiple layers to see more length and volume with this. For $46 I should only have to go over once or twice. The brush is super basic as well. And I’m not a fan of big brushes. The packaging is sleek but what’s inside is what really counts. Guys and gals do not buy this mascara. For $46 you can buy mascara and something else from a different brand. Please this one is a hard pass for me. Super disappointed.\n…read more"
       },
       "emmie33613":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"17 d ago",
          "title":"Love this",
          "description":"I received this product in exchange for a review. I have sensitive eyes so eye cream shadow etc can cause tears, redness, irritation,. I was impressed by this since the wand is lightweight and easy to use. No harsh smells. The best is that it is not clumpy and goes on lightly and is buildable. I highly recommend this."
       },
       "megich":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"10 d ago",
          "title":"Flawless",
          "description":"This mascara is absolutely flawless. Quality is unbelievable. I am mascara lover and i have never had such a great one. Price isn't inexpensive but really really worth it! Easy to apply, you don't need any primers before it to look your lashes amazing. Now i know which one is my all time favorite mascara! Try it for sure"
       },
       "MiaLachee":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"6 d ago",
          "title":"I am in love with this mascara, the pigmentation is good and the spoofie wand is gigantic which makes it easy to get medium to full coverage. It is very buildable and doesn't look clotted and stuck together . It gave me the volume I needed without having to go over it 8 times. My lashes looked thick but still natural. I recommend this mascara it’s worth it!",
          "description":""
       },
       "AdiEv":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"6 d ago",
          "title":"Gorgeous Mascara",
          "description":"I really loved this mascara! I have tiny baby lashes that often times even the most critically acclaimed mascaras can't help so I often wear false lashes. Since trying this mascara I haven't wanted to wear false lashes! It really lifts and separates my lashes and adds length -- not to mention it lasts forever! I fell asleep it in and even rubbed my eyes a little and when I woke up, it was still intact. It comes off easily with my typical makeup remover. The pigment is nice and it doesn't dry out my lashes or cause fallout. I would highly recommend, however, it is a tad pricey so that is why I have to give it 4 out of 5 stars. I received this product complimentary for testing purposes.\n…read more"
       },
       "xmintyann":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"5 d ago",
          "title":"Love this mascara! It made my lashes look long and full and love the way it stays on them!",
          "description":""
       },
       "sabi1994":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"4 d ago",
          "title":"One of the best waterproof mascara that I’ve tried. It is definitely waterproof, could go in the pool or visit the pool. I tried this mascara for free and I would recommend to others.",
          "description":""
       },
       "maddiekhan":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"29 Jun 2019",
          "title":"Awesome mascara! I love how it lengthens my eye lashes❤️❤️❤️",
          "description":""
       },
       "AKlona":{ 
          "extra_info":"<b>Eye Color</b> Blue",
          "stars":"4 stars",
          "date":"16 Sep 2019",
          "title":"❤️",
          "description":"I love this mascara!!! I didn’t like the brush so I used a brush I do like and it’s amazing!!! My lashes are full and long!"
       },
       "Joyyaa":{ 
          "extra_info":"<b>Eye Color</b> Green",
          "stars":"4 stars",
          "date":"14 Sep 2019",
          "title":"Disappointed..",
          "description":"Fantastic product but incredibly disappointed in the packaging. I expected much better from a brand like Tom Ford. The packaging isn’t worth $20 let along $46."
       },
       "simons1mom":{ 
          "extra_info":"<b>Eye Color</b> Hazel",
          "stars":"1 star",
          "date":"8 Aug 2019",
          "title":"Worst mascara ...save your money",
          "description":"I HAD HIGH HOPES FOR THIS AND IT IS BAD. IT FLAKES WORSE THAN A SNOW STORM IN NEW ENGLAND. IT DOES NOT STAY ON MY LASHES. BY THE END OF AN 8 HOUR DAY AT WORK THE MASCARA IS GONE. IT DOES NOT VOLUMIZE. THE WAND IS SOOO BAD. GOOP ALL OVER THE WAND, THE BRUSH IS TOO LARGE. SO I WIPED OFF A ANOTHER WAND FROM A DRUG STORE BRAND THAT I LIKE AND USED THE TOM FORD MASCARA, IT DID NOT LAST .\n…read more"
       },
       "kaitlynnflowers":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"19 d ago",
          "title":"Definitely one of the BEST mascaras I have EVER used! My lashes are so much longer and so much more fuller when I use this mascara. I dont think I will ever use another kind to be honest. I received this in my influenster VoxBox and I am super lucky that I did because this mascara is the BOMB!",
          "description":""
       },
       "Adiik":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"18 d ago",
          "title":"I really love this mascara ! It gives my lashes so much volume and darkness to them! I love the applicator! Super easy to apply and remove ! Great mascara",
          "description":""
       },
       "uppiditycracker":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"18 d ago",
          "title":"Vavavoom!",
          "description":"My eyes can be sensitive to mascara. Any flaking and I am itchy and bloodshot for days. I had zero issues with this wonderful mascara! Long wear, waterproof and vavavoom length!"
       },
       "WhitneyNoelle":{ 
          "extra_info":"error getting this field.",
          "stars":"2 stars",
          "date":"11 d ago",
          "title":"This is not emotion proof, it ran when I cried. But one great thing about this product is that when it clumps it easy to smooth out. I'll stick with my waterproof better than sex mascara.",
          "description":""
       },
       "nicolemidnight":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"11 d ago",
          "title":"Tom Ford Mascara",
          "description":"I received this Tom Ford Mascara from influenster and I loved it,it made my eyelashes really stick out,I even got some compliments!"
       },
       "angelab1006":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"14 d ago",
          "title":"influenster",
          "description":"This product isnindustrial kitchen proof. I work in a nursing home as a dietary aide. around lots of water from dish machine, steam and cool mositure from freezer and fridge. let me tell you know matter what hit this face my lashes did not fail. this mascara gave me volume and lasted all day. did flake but didn't smeary mess."
       },
       "gennny25":{ 
          "extra_info":"error getting this field.",
          "stars":"3 stars",
          "date":"14 d ago",
          "title":"stayed put during my engagement!",
          "description":"I agree with another girl in the reviews the wand is super long! But I did really like the stay of it! I was wearing it on the I got engaged and was afraid it was going to smear but nope! It stayed put even after all the tears!!! I did receive this from Influenster for testing purposes. If you have the money do it if not I’d pass"
       },
       "hevancathey":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"16 d ago",
          "title":"Love it",
          "description":"This product has a very beautiful packaging, very elegant and stunning"
       },
       "JassyRiv":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"15 d ago",
          "title":"Volume, length, and doesn’t smudge",
          "description":"I wore this mascara several times, for several hours, a let me tell you that this product did not disappoint. I was amazed by how smoothly the mascara went on and for a waterproof mascara I was so glad it wasn’t clumpy. The mascara made my lashes lengthy and voluminous without smudging on my eyelids."
       },
       "VB11":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"14 d ago",
          "title":"Love!",
          "description":"Love it!! This is the first waterproof mascara that I have actually loved! Usually they irritate my eyes and make my lashes feel stiff, but this does not! It lengthens my lashes perfectly!"
       },
       "ezramarie":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"10 d ago",
          "title":"Love it!",
          "description":"I really enjoyed this mascara!! I’ve found a lot of mascaras (even the more high end ones) tend to fall off through out the day and make dark circles under my eyes. This doesn’t do that PLUS it adds lots of length to the lashes and gives a curl to them that looks like if I used an eyelash curler. The only reason I wouldn’t recommend this is if someone had smaller eyes as the applicator is a bit large. Other than that, I really do love this mascara.\n…read more"
       },
       "lawlesshellion":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"8 d ago",
          "title":"This is honestly one of the best mascaras I’ve ever used. It’s true to its name in that it’s amazingly waterproof, unlike many others I’ve tried in the past.\nThis mascara made my lashes look super long and voluminous without looking heavy or clumpy.  My only gripe with this product is that the brush is a little on the long side, so it can be a little tricky to apply until you get used to it.",
          "description":""
       },
       "samanthatedrow":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"7 d ago",
          "title":"Love it",
          "description":"Great, waterproof mascara! It left my lashes looking great! Long and volume-ized. I usually have multiple mascaras on my vanity, but I found myself repeatedly reaching for this one alone. I have already recommended this mascara and will for sure buy more when I run out. I wore it for 8 hours and it stayed put and never made me look like a raccoon."
       },
       "Breeeii":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"6 d ago",
          "title":"Lovely",
          "description":"I love it. Fortunately, i recieved this as a sample and was able to expand my go-to list in the process. Very awesome : ) I normally have watery eyes and allergies/seasonal ruin my makeup problems, the mascara hasn't budged! The actual mascara is not clumpy or thick. I have had problems in the past with other brands irritating or coming off, this one is good for lazy days with a touch up too, it doesn't irritate at all. I like the design of the container as well, very cute. You get what you pay for, they got the name right with this product and i am impressed overall.\n…read more"
       },
       "Chandni27":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"3 d ago",
          "title":"Love love love!",
          "description":"I am generally not satisfied with mascaras because I feel like they don’t add a lot of volume for my eyelashes but this one did the trick! I think the consistency could have been a little better but it added an amazing volume to my eyelashes. In all I loved it! Definitely a must buy."
       },
       "GuerraL":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"13 Aug 2019",
          "title":"",
          "description":""
       },
       "LDC77":{ 
          "extra_info":"<b>Age</b> over 54",
          "stars":"2 stars",
          "date":"1 Sep 2019",
          "title":"meh....",
          "description":"I really wanted to love this mascara and it's \"ok\". It doesn't hold the curl and the formula seems weak, not enough oomph for me. For someone who already has long, dark lashes with a good curve this would probably do the trick. I also found that it didn't hold up well in the hot/humid weather. It didn't flake or smudge but it did seem to attract moisture and became sticky feeling over the course of an afternoon walking around in the sun. I'm going to return it and look for something else. Surely one day a formula comparable to the urban decay cannonball will hit the market :(\n…read more"
       },
       "Pinkrose1742":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"18 d ago",
          "title":"So Lux",
          "description":"Beautiful packaging and love the product as well. Will continue to use and I am so happy I now own it in my collection. Received complimentary for review purposes but I am so glad I did because I love it!"
       },
       "Deee565":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"19 d ago",
          "title":"Great product!",
          "description":"I was able to try this product for free . I can honestly say this is the best mascara I have ever tried . My eyelashes finally look full and it add volume to my eye."
       },
       "MakeupSavyyy":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"4 stars",
          "date":"19 d ago",
          "title":"Tom Ford mascara",
          "description":"I do like this product however it isn’t my go to also it is pricy and kinda big I would make the brush of it a little smaller so far it does last a good bit of time I’m not sure if I would buy it again or not!"
       },
       "MzMiiMelanin":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"17 d ago",
          "title":"Hands down the best!",
          "description":"Yyyeesssss! Hands down the best mascara I have ever used! Went to a movie and dropped a few years. I was so scared that it had ran but once I looked it didn't! Come on who would not love that. I was overjoyed! It actually defined my lashes, defined they looked longer. I'm in love and I don't say that about many products."
       },
       "kresen1":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"16 d ago",
          "title":"A little clumpy, but overall good",
          "description":"I wish I could have given this mascara 5 stars, but I had some trouble with clumping when I put it on. Overall, though, I absolutely love how it thickens and extends my lashes. The black color is dramatic and with a little wiping of the brush it will go on smooth. I will use this mascara again, I just wish the brush didn’t clump as it comes out of the tube."
       },
       "Ninadisney10":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"15 d ago",
          "title":"Great Product",
          "description":"One of the best mascaras I have tried in my life. It works well with two coats to get it to my liking and held up through a very eventful concert full of all kinds of emotions. From sweating to crying it stayed on all day and partial night until I took it off. KEPT MY LASHES LOOKING LONG AND LUCIOUS WITHOUT HAVING TO CURL THEM !!!! Although if I had to have one bad thing to say it would probably have to be I’d you’ve applied your skin care routine and any residue is left on the lashes it’s best to wipe them clean and apply the mascara after !\n…read more"
       },
       "mootini":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"13 d ago",
          "title":"Really worth the price!",
          "description":"I got this complimentary for testing purposes and decided to wait and use it on my anniversary. I was very surprised how long it made my lashes look with one swipe and naturally thicker and not caked. It didn’t flake and I didn’t have any reactions to it as the night went on. Only downside is I had a hard time removing it with my normal eye makeup cleaners but eventually I got it off without damage."
       },
       "Tunah":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"10 d ago",
          "title":"NO SMUDGING UNDER THE EYES",
          "description":"I really didn’t have a lot of hope on this because of the clumping on the wand. BUT was I wrong!! It goes on pretty well after scraping off some product from the wand and it doesn’t clump your lashes together! One of my biggest problem is the smudging under the eye over the course of time wearing the mascara. I can wear this for over 12 hours and still no smudging!"
       },
       "heaveenn":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"11 d ago",
          "title":"Mascara",
          "description":"I love this Tom Ford mascara it goes on so effortless and easily!!"
       },
       "jojelly12199589":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"7 d ago",
          "title":"I received this mascara free for review from Influenster. This mascara is truly emotion proof!! I was able to wear it on a recent trip to Florida, it did not smudge, I was able to wear it in the water and it also withstood tears! I am very impressed!",
          "description":""
       },
       "chow87":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"6 d ago",
          "title":"Beautiful lashes",
          "description":"The mascara stays put all day, waterproof and smudge proof. You do have to be careful when applying, can become clumpy."
       },
       "alexislombardi":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"7 d ago",
          "title":"Owns Up to the Name!",
          "description":"I recieved my Tom Ford Emotionproof Mascara from my Influenster VoxBox! This beautiful non-pastey, scentless and weightless formula gives a natural look with the help of a long wand! The formula is weightless when applied to your lashes and provides great separation. It owns up to its name by not smudging or coming off with water (or tears!)"
       },
       "Betziavalos1":{ 
          "extra_info":"|",
          "stars":"5 stars",
          "date":"6 d ago",
          "title":"Emotionless proof mascara",
          "description":"This is the most amazing mascara i ever tried! I can sweat , cry and rubber my eyes without getting a black patch all over my face and eyes! I love this is the best mascara ever ! I totally recommend it !"
       },
       "abbijennnings":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"4 d ago",
          "title":"Love!!!",
          "description":"I’m absolutely in love with this product! I haven’t ever tried this till now! It’s an amazing product, definite I’m absolutely in love with this product! I haven’t ever tried this till now! It’s an amazing product, definitely is smudge proof and waterproof! I cried and cried and everything and it still looked so good!! I will be constantly be buying this product!! I received this product complimentary for review purposes."
       },
       "notsusan":{ 
          "extra_info":"error getting this field.",
          "stars":"2 stars",
          "date":"4 d ago",
          "title":"expensive and doesnt deliver volume or length.",
          "description":"Not terrible, but nothing amazing. I expected more from this mascara, and while it is fairly waterproof, it doesnt do much for my lashes. There isnt much difference when i have this on vs off. It makes my lashes very clumpy, but somehow no volume or length. The packaging is nice and feels expensive, but i can get better performance from cheaper brands."
       },
       "ashleyzzzz":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"1 d ago",
          "title":"Great mascara",
          "description":"I really liked this mascara. It is very pigmented and lengthened my lashes quite a bit. I would definitely say it's waterproof/emotion proof. I wore this on vacation and it lasted through both sweat and rain."
       },
       "dogwood7":{ 
          "extra_info":"<b>Eye Color</b> Blue",
          "stars":"1 star",
          "date":"21 Aug 2019",
          "title":"Gritty clumpy yuck",
          "description":"Terrible. Huge brush. Bigger than my eyes. Why? Is this made for giants? Mascara is clumpy and gritty. You can see the chunks all over the brush. If you like sticky clumpy dry looking lashes with little gritty balls of mascara clinging everywhere then by all means buy it."
       },
       "KHCMB":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"5 stars",
          "date":"3 Sep 2019",
          "title":"Truly No Raccoon Eyes",
          "description":"I actually started wearing mascara again because of this product. I did not want to like this $46 mascara because THAT PRICE, but it really did stay fully on my lashes with no smudging or smearing even after walking around all day in the hot sun with my kids. I stopped wearing mascara for years because I could never find one that didn't end up under my eyes. My lashes would look good for maybe an hour, then I would have black marks under my eyes, and that's just not cute. The mascara was not the absolute best for volume or length, but it defined my lashes well enough, and most important to me, it didn't smear at all!\n…read more"
       },
       "Celeste15148":{ 
          "extra_info":"<b>Eye Color</b> Hazel",
          "stars":"4 stars",
          "date":"15 Sep 2019",
          "title":"Fun to try out but not to repurchase",
          "description":"I do really like this mascara and there’s nothing wrong with it. My main problem is that I think that it’s pretty overpriced for what you get. I honestly like Pat McGrath’s better than this one and Pat’s is cheaper. I probably wouldn’t purchase this one again."
       },
       "Zarry":{ 
          "extra_info":"error getting this field.",
          "stars":"3 stars",
          "date":"12 d ago",
          "title":"Not worth the price tag",
          "description":"I received this mascara complimentary for testing purposes and I have to say it’s pretty good. It got the job done, my lashes held their curl because it is a waterproof mascara. The way the wand is built keeps from clumping my lashes together. That being, said I don’t think this mascara is worth the price. I have drugstore mascaras that are a fraction of the price and do the exact same thing. So personally don’t think this is a must have.\n…read more"
       },
       "kristinevee":{ 
          "extra_info":"error getting this field.",
          "stars":"3 stars",
          "date":"11 d ago",
          "title":"Good mascara!",
          "description":"So I got try out Tom Ford Emotionproof Mascara, I don’t wear false lashes so I need a little extra for my lashes and my eyes are small. And what I liked is the brush is big and it managed to open my top and under eye lashes and I prefer to always put extra coats but this mascara will get clumpier and hard to separate lashes. So 2 coats is the max! The mascara drys-up quickly but doesn’t smudge when it’s dry. Last good for 12 hours.\n…read more"
       },
       "SophsReviewer":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"11 d ago",
          "title":"Got this as part of my VoxBox. The color is perfectly black. Love that it does not flake or cluster. I have very straight lashes and it did stay curled for a decent amount of time but eventually was straight again about 5 hours later. Unsure if I could purchase due to how expensive it is.",
          "description":""
       },
       "Jessyfos":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"12 d ago",
          "title":"OMG!!!",
          "description":"Ive been using this Tom Ford mascara for a week now and it is hands down my absolute favorite if you more natural looking lashes that wont run then i recommend giving this a try you wil not regret it"
       },
       "kellyjellycos":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"11 d ago",
          "title":"I like it but I’m not sure for that price, is it worth it. It’s volumizing and lengthening but you have to use it sparingly. It can get clumpy fast. Also, I have a hard time getting the bottom lashes without it getting clumpy. The wand‘s bristles is a bit too big for my taste. I have smaller eyes so it’s hard to get the corners without the clump. Will work better for someone with big eyes. I’ve had other masacaras that do a good job for a much lesser price.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
          "description":""
       },
       "Bbymelii":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"17 d ago",
          "title":"lovely!",
          "description":"Tom Ford Emotionproof Mascara is my new favorite! This mascara is luxurious. The packaging is really high quality and simple. I love the brush applicator. It leaves my lashes looking nice. This mascara is classic to me. it doesn't give my lashes drama or full definition. It's simple and light. I love the formula. It didn't smudge or crumble. It dries fast without flaking or feeling hard. Great product and great brand!"
       },
       "jhamilton0419":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"15 d ago",
          "title":"beautiful mascara",
          "description":"This is a beautiful mascara, it gives length and volume, it is definitely waterproof, or emotion proof as it states in its name. The wand is a little big for my liking. Is it worth almost $50?? I don’t think so."
       },
       "stephanieee123":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"16 d ago",
          "title":"Best mascara",
          "description":"I received this as a complementary item to test from Influenster. I couldn’t be more happy with the results of this mascara. I always have trouble with mascaras and having them make my lashes clumpy. But this one actually lengthens my lashes, does not clump,and last all day long!"
       },
       "lilianachacon":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"16 d ago",
          "title":"Luxurious formula!",
          "description":"I received this product complimentary from Influenster for testing purposes! I love the consistency of this mascara and the way that this applies so smoothly coating every lash individually. I love how this mascara does not clump up your lashes or crumble and leave fallout whatsoever. Instead, the beautifully shaped full wand separates your lashes beautifully with each bristle! The only reason that I did not give this mascara the full 5 stars was because I felt like it weighed down my eyelashes a bit. Usually, my everyday mascara keeps my lashes curled and lifted up all day but this mascara kinda made my lashes spread forward and out instead of up how I prefer. Other than that, absolutely amazing mascara and it reflects in the price! I would definitely recommend this to anyone who wants to spend a little extra on mascara for a very luxurious formula and amazing application!\n…read more"
       },
       "KrisHorton":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"10 d ago",
          "title":"Great Mascara",
          "description":"I've tried many high quality Mascaras and I was impressed with Tom Ford Emotionproof Mascara. I intentionally slept in this mascara and it didn't even smudge. It holds the color all day long so there's no need to reapply. It did make my lashes appear to have more volume and length. However, it was a little heavy so my lashes didn't hold a curl. I also felt that it was a bit clumpy when it went on as well. Overall I would highly recommend this Mascara.\n…read more"
       },
       "pickles1989":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"10 d ago",
          "title":"Amazing",
          "description":"I received this product as a free sample. I have to say though it is simply amazing. I like how it manages to stay fresh throughout the day no matter what the day may bring."
       },
       "NykkiRose":{ 
          "extra_info":"error getting this field.",
          "stars":"3 stars",
          "date":"10 d ago",
          "title":"It’s OK",
          "description":"I don’t LOVE this mascara but I also don’t hate it. It gets the job done but for a $46 mascara I hoped for more. It does stay on for a long time which was appreciated. I wore it to a rock concert and to a military ball and it lasted through both. I do get some fallout from it after its set and wish that it would give me a little more length or volume. So it’s an OK choice for me."
       },
       "MJSilva091788":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"8 d ago",
          "title":"It’s good but not the best",
          "description":"I received this mascara for free from Influenster. I think it’s a pretty good mascara. It lengthens my lashes and holds the curl."
       },
       "Staceykt":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"6 d ago",
          "title":"When I first received my Tom Ford Emotionproof mascara, I was impressed with the name so I had high hopes emotionproof would prove itself. My first application was smooth and didn’t have any clumps which scored good points with me. It did lengthen my lashes slightly. I was happy it didn’t look obnoxiously longer. My mascara lasted all day and didn’t have any smudges. The real test is how long the packages lasts before it dries out or I use it all since it is costly.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
          "description":""
       },
       "StephLynn7":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"6 d ago",
          "title":"Gorgeous mascara for a splurge",
          "description":"I received this mascara through Influenster to test it, and I'm so glad I got to try it out! It took me a minute to get used to the size of the wand (I usually have a smaller wand in my daily mascara), but once I did, it was a dream. My fiance could see individual lashes from across the room when I was applying it the first time... WOW! I love the definition of this mascara, and it's so nice to wear a mascara without the fallout or needing a clear coat to keep it from smudging. Plus, it's waterproof, but it isn't a pain to take off at the end of the day! It's clear why this mascara costs what it does! The only downside is the cost, honestly. I likely won't be able to repurchase on my grad school budget, but if you can splurge on this one, you won't be sorry! Not only is it an excellent mascara that can last and last and LAST, the packaging is gorgeous too. I highly recommend this to anyone with this kind of budget. Maybe I'll be able to pick it up again after graduation.\n…read more"
       },
       "Luelueheart":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"6 d ago",
          "title":"My first time using! This mascara is amazing! Its light weight and easy to apply. I like the fact that its waterproof and dries pretty fast because i have no lashes at all and its not heavy that itll drag my lashes down like other mascaras. The brush is nice and well didnt see any clumping. It does give volume if you apply a few coats. I definetly would buy again. I received this product complimentary for review purposes.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
          "description":""
       },
       "DianaA06":{ 
          "extra_info":"error getting this field.",
          "stars":"5 stars",
          "date":"6 d ago",
          "title":"Great product",
          "description":"I got this mascara through infuenster (thank you so much) just when I was desperately looking for a mascara that was actually good and waterproof! The day I received it I applied it right away and I loved it! It lasted on my lashes all day and not on my skin like other mascara. I've been applying it for 5 days now and I love it. Makes my lashes look longer and with more volume! I will definitely buy it after i run out! Awsome product and the pigmentation of the mascara is awsome! No more mascara on my under the eye skin anymore! I received this product complimentary for review purposes.\n…read more"
       },
       "Chas92":{ 
          "extra_info":"<b>Eye Color</b> Brown",
          "stars":"3 stars",
          "date":"4 d ago",
          "title":"Overall i was impressed with this mascara. I used it everyday for a week to test out how it wore and it did great. If i could change anything it would be the way that it volumizes. I will finish the tube, but i don’t think i will buy it again because i think i could get a similar look for a lower price. I enjoyed the mascara though! I received this product complimentary for review purposes from Influenster.",
          "description":""
       },
       "gotcheer14":{ 
          "extra_info":"error getting this field.",
          "stars":"3 stars",
          "date":"2 d ago",
          "title":"This mascara is mediocre. For the price, I really expected a lot more but I find myself reaching for my drugstore mascaras more often than this one. I will say that I’m pretty picky with mascara because a lot of times mascara makes my curled eyelashes become completely straight and this doesn’t do that so that’s a plus. The brush is nothing special and is almost a little too long to get the inner corner of my eye. Overall, a decent mascara but I’ll probably stick to my L’Oréal voluminous mascara.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
          "description":""
       },
       "Nicolem529":{ 
          "extra_info":"error getting this field.",
          "stars":"4 stars",
          "date":"2 d ago",
          "title":"Thick Lashes",
          "description":"This mascara is truly smudge and waterproof.  It took a while to dry but once it did I tried using water and really rubbed my lashes and it did not break down until pass seven across it.  At that point just a few pieces came off and it still looked decent. It did go on fairly smoothly due to the creamy texture but I did experience some clumping if I applied it too heavy.  Since water was not really making this budge I used a cream based cleanser and was able to remove it fully after a few times across my lash line.\n…read more"
       }
    }
 }