{ 
   "product_name":"Hangover Replenishing Face Primer",
   "product_type":"Primer",
   "brand":"Too Faced",
   "url":"https://www.sephora.com/product/hangover-replenishing-face-primer-P387589?icid2=products%20grid:p387589",
   "reviews":{ 
   "fatimayousuf":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"15 Sep 2016",
      "title":"Acne prone?? here's your winner",
      "description":"Holy moly! I got a sample from my points at the counter and I was skeptical when I saw the texture of this primer,it's very fluid and looks like milk and I have combination/oily skin so I wasn't sure,I only use mattifying primers but this isn't a mattifying primer regardless of that IT'S NOT BAD AT ALL..it did justice to my makeup without breaking up on me but the real magic happened when I took my makeup off..GeneraIy I have very problematic skin with acne scarring and spots and every time I remove my makeup it breaks my heart to look at my skin but when I took my makeup off this time my skin was radiant and...Healed? It looked healthy n for the first time in my life not like I aggravated something bad..I am so gonna get the full size n so must you..wear it underneath a matte foundation n it's life changing..…read more"
   },
   "apeas274":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"25 Apr 2015",
      "title":"amazing primer for oily acne prone skin",
      "description":"I live in humid Florida and have super oily, acne prone skin. I had been looking for a primer that would keep me matte longer. I'm usually oily within minutes of applying make up and this primer truly maintains my oil. I go hours without having to touch up my make up with mattifying powder. It also hasn't caused me to break out more than usual and improves the look of my skin. I've been through 3 tubes now and will likely repurchase.…read more"
   },
   "makatacky":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"2 Feb 2018",
      "title":"Wear with or without makeup",
      "description":"Having sensitive, highly allergic skin and rosacea, I was a bit nervous to try this out as it contains fragrance and a few other potentially irritating ingredients. I'm pleased to say this did not exacerbate rosacea or give me hives!\n\nI use this as a daytime moisturizer. It makes my skin look smooth and hydrated. It won't fill in your pores and it doesn't feel like a typical primer. It's great if you want a light primer that can stand alone or be used with makeup, this is a great fit. If you want to resurface your face, this is not the product for you.…read more"
   },
   "ayojenniferr":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"15 Mar 2016",
      "title":"I have very dry skin",
      "description":"I have really dry skin and I've been trying to find a primer that wouldn't dry out my skin. This one works wonders for me. Before I put this on, I always make sure to exfoliate and moisturize thoroughly because this is only a primer so I do not solely rely on it to keep my skin hydrated. And this has such a delightful, sweet coconut scent to it that isn't over powering. Over all, I love this product."
   },
   "cc168555":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"23 Sep 2016",
      "title":"love it!",
      "description":"I have extremely oily skin and was hesitant to buy this, even though I'm well aware oily skin needs hydrated as well (which I do on a daily basis), because I was afraid to use a primer not used to mattifying. It's so light and non greasy, and as long as it's set with my normal powder, etc, it's perfect! Don't be afraid of it, even if you have oily skin!!"
   },
   "leapyearbaby229":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"15 Sep 2014",
      "title":"one of the best!",
      "description":"I have skin that gets super oily thru the day, so finding the right primer has been quite a hunt. I use it in place of my moisturizer or mix it with my cc cream for a little color and it keeps my makeup from sliding all day. It also hydrates perfectly without feeling greasy and dries quickly. The consistency is great and there is no obnoxious smell to it either. Absolutely love this!"
   },
   "meglills":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"26 Jan 2017",
      "title":"obsessed.",
      "description":"I struggle with extremely dry skin in the winter and I have finally found a product that allows me to apply foundation without my skin flaking. This smells like a dream and is really nourishing. Highly recommend."
   },
   "torontogirl23":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"2 Feb 2015",
      "title":"Excellent primer for acne-prone skin!",
      "description":"I've tried primers from a few other brands in the past (all the most popular ones), Smashbox, Hourglass, Benefit, etc. All of them either left my skin weirdly dry and flakey (worse than before I applied it), or they were heavy for my skin and broke me out. I don't really like the feeling of silicone primers on my face so when I came across this Too Faced one, it peaked my interest.\n\nSince I have sensitive skin, I always read a number of reviews for makeup before I buy - all I can say is, i'm so glad I took the plunge. I love it!! Not only does it prime my skin so well that my makeup glides on (my morning routine is much quicker), but it also moisturizes my skin and keeps it perfectly hydrated all day (dry spots are pretty much eliminated). It also keeps my whole face makeup looking great all day! All this without causing a single breakout.\n\nNot to mention, it smells heavenly (a very light smell, so it doesn't linger on the skin). It feels beautiful on the skin and coming from someone who has a very difficult time finding anything 'face' related (foundation, concealer, powder), this is heaven sent for my problem skin.\n\nI will 100% repurchase this!…read more"
   },
   "handymandy77":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"13 Jul 2014",
      "title":"&lt;33333",
      "description":"Another amazing product from Too Faced!❤️ I'm a dog walker and I like to look nice while I work. It kept my makeup looking fresh and flawless all day even in 85 degree weather. I have sensitive oily skin and this is perfect for me. It's light weight and hydrating but doesn't make my skin feel greasy or oily"
   },
   "Andy91":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"14 Feb 2015",
      "title":"Great for people who don't like silicone primers",
      "description":"This is very hydrating especially during winter. Makeup stays all day and love that it is silicone free!"
   },
   "lestylojess":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"23 Jul 2014",
      "title":"I have oily skin and I use this as a combination moisturizer and primer. It's fantastic under makeup and holds your foundation on for quite a long time. It doesn't mattify, but doesn't make me oilier either. It sinks in beautifully and doesn't have that slick silicone feel. I also love the idea of probiotics in skincare, although I'm not sure of the benefits. Overall, I 100% would buy again. It's awesome.",
      "description":""
   },
   "Mickeylee99":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"20 Feb 2016",
      "title":"Love!",
      "description":"New favorite face primer! It is the smoothest thing I have ever put on my skin, feels amazing. It is super hydrating and my makeup goes on beautifully and prolongs it so well!"
   },
   "BSuzanne":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"16 Feb 2016",
      "title":"Too Faced can do better",
      "description":"Let me begin by saying that Too Faced is my go-to brand. I love all of their products.... Except this guy.\nI compare this product to their other primer: Primed and Poreless, which is a PERFECT primer. It smooths the skin, feels great, makes foundation look great.\nHangover primer was totally disappointing. It makes my skin look BAD. It is supposed to have a coconut scent to it, which I was looking forward to because coconut is my favorite. But instead, it smells more like melted crayons. Putting it on... I feel like I need a ton because it just does nothing to replenish the moisture in my skin. My skin feels dryer once I put it on--but in a thirsty way. My skin also looks red and blotchy after applying. Then the makeup goes on top... And this stuff just does not behave like a primer. I have better results putting just foundation on without priming my skin. But it gets worse because after an hour or so, I have extremely visible pores, makeup caking and peeling off, and dry skin patches that were previously not noticeable.\nI've tried this stuff many ways... After exfoliating and moisturizing even, and it's always the same.\nMaybe I got a bad bottle. I don't understand.\nI pair this with a face full of Too Faced makeup. Still bad results.\nI highly recommend Primed and Poreless.…read more"
   },
   "laurenjm":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"16 Oct 2016",
      "title":"Obsessed",
      "description":"I have tried every primer for my combination sensitive skin. From YSL, to Laura Mercier, to Make Up Forever, and this hands down is my favorite\r\n1) It smells delicious\r\n2) It doesn't break my skin out \r\n3) Its ultra hydrating\r\n4) It is almost like your foundation grabs a hold of it and stays in place. \r\nThis is my new favorite thing"
   },
   "mkwhitneyy":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"13 Jan 2016",
      "title":"Love it!",
      "description":"I love this as a primer. I have some spots that don't hold makeup well for some reason so I put smashbox primer over those areas but this works great for all over. It's so moisturizing! even on days I don't wear makeup, I still put this on. it makes my skin so soft. It's my favorite primer I've ever used. and the smell is delicious!"
   },
   "eva0587":{ 
      "extra_info":"<b>Skin Type</b> Combination",
      "stars":"5 stars",
      "date":"8 Aug 2016",
      "title":"amazing",
      "description":"I love this primer. It holds my makeup perfectly all day and night long! For this primer to work well, you would have to let it absorb and set to your skin for about 5 - 7 mins for it to work effectively"
   },
   "vblais":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"10 May 2016",
      "title":"love this!!",
      "description":"A little goes a long way with this!! It feels nice on the skin and works great!"
   },
   "wellheyhannah":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"23 Sep 2015",
      "title":"Hydrates and Prolongs makeup!",
      "description":"I have oily/combination skin. I bought this primer because even though I have oilier skin, I still need hydration. To my surprise, this primer actually controls my oil AND makes my makeup go on smoother and prolongs it. It goes on smoothly and is great for extra hydration. Will definitely repurchase."
   },
   "novembercharm":{ 
      "extra_info":"<b>Hair Condition</b> Chemically Treated (Colored, Relaxed, or Permed)",
      "stars":"5 stars",
      "date":"26 Aug 2018",
      "title":"I went in for a setting spray walked out with this and wow! I took a chance took a risk and went and bought this. This is my first primer!! And I’m not disappointed whatsoever. I wish I would’ve tried this sooner after a 10 hr shift my make up still looks super good!’ So shocked!!!",
      "description":""
   },
   "Cehfix":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"11 Aug 2018",
      "title":"I thought it would be greasy for my skin with oiliness, but not at all. I always use it in the morning before putting on makeup. the resting skin effect that it leaves is incredible",
      "description":""
   },
   "MzKhaos13":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Jan 2017",
      "title":"AMAZING FOR DRY SKIN!!!!",
      "description":"I wish I would've bought this years ago. After biting the bullet and buying the full size I AM IN LOVE!!! It instantly made my extremely dry skin feel hydrated and SOFT. My foundation looked so amazing and for literally the first time my face did NOT look cakey. Obsessed. Will buy foreverrrrrrrr. PS- smells slightly like coconut tanning lotion but the smell disappates."
   },
   "MUAmelia":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"26 Aug 2014",
      "title":"Love it",
      "description":"Awesome for adding moisture to dry skin. Holds makeup in place, good for filling in fine lines and smoothing pores but doesn't do the trick for larger pores or deep lines. Smells great :) I'm partial to coconut."
   },
   "veryunique88":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"19 Mar 2016",
      "title":"broke me out",
      "description":"I have oily combo skin that also gets dehydrated. I've been searching for a primer to help moisturize, brighten, help my makeup look fresh. While this is really moisturizing it made me break out horribly. I even did a test for a week by not using it (my skin cleared) and used it again, immediately that night I got 2 surface zits."
   },
   "LoveCarly":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"21 Apr 2015",
      "title":"LOVE THIS",
      "description":"This smells so good and really hydrates my dry skin. I use it as a moisturizer before putting on my porefessionals primer. I love it."
   },
   "SarahKabrajee":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"21 Jul 2017",
      "title":"Great base for makeup",
      "description":"This primer is the best primer I've used for my skin. I don't get along well with silicone based primers (porefessional/smashbox photofinish) and this is the opposite. It goes on almost like a lotion but then becomes tacky to adhere to makeup. Lasts a long time, moisturizing, makes my skin feel amazing."
   },
   "Alex2789":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"19 Apr 2017",
      "title":"Can't Live Without This Stuff",
      "description":"I don't know what it is, but my skin just loves this primer. I have oily, super sensitive skin and really dislike silicone-based primers. This stuff goes on like a second moisturizer and keeps my makeup in place, does not break me out, and doesn't feel like I'm wearing anything extra. This is my everyday primer."
   },
   "LH15A":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"16 Jan 2017",
      "title":"Perfect for my combination skin!",
      "description":"This is my holy grail primer! I've been using it daily for about 6 months now. It is perfect for my combination skin because it is moisturizing yet doesn't make my face oily throughout the day. I've tried many silicone based primers before, but always found they sat on my skin weird and made my foundation breakup when my skin got oily. I've had no issues with this primer at all! I'm surprised to see the reviews about it breaking people out, I have very sensitive acne prone skin and my skin has actually improved since using this product.…read more"
   },
   "alazar278":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"27 Apr 2017",
      "title":"FAVORITE MOISTURIZING PRIMER",
      "description":"This is hands down my favorite moisturizing primer. I have very dry skin in the winter so I will use this on top of my daytime moisturizer. I also have acne prone skin so I was worried this would break me out but I haven't had any incidents. All my foundations lay beautifully on top of this. Definitely will repurchase!"
   },
   "kaitlinbby":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"25 Feb 2016",
      "title":"INCREDIBLE",
      "description":"This stuff is nothing short of amazing. I was previously using Smashbox Primer water as a primer and setting spray but noticed that every time I went to apply foundation or powder it would end up very blotchy and by the end of the day was almost completely worn off. I decided to give this a try and fell in love! My make up now goes on completely smoothly and stays put all day, even if I forget to use setting spray! Not only that but it has improved my skins over all health!!! My skin is much more moisturized and soft. To top all of that off I have not had any issues with breakouts as I previously was! ABSOLUTELY LOVE.…read more"
   },
   "saraalison":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Aug 2014",
      "title":"Perfect for dry skin!!!",
      "description":"I have dry, flakey skin (even during the hot, humid summer months of the South), and was so excited to find this new primer by Two Faced. I had been using Primed & Poreless, which I love, but it wasn't able to mask my dry spots. This primer does the trick! It makes my face looks flawless with a dewy finish, I absolutely love it and would highly recommend it to anyone with dry skin. Plus the bottle has a pump, huge bonus!…read more"
   },
   "stephii28":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"12 Mar 2015",
      "title":"Great for oily skin. Especially in winter",
      "description":""
   },
   "Andycha98":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"7 Jul 2017",
      "title":"BEWARE",
      "description":"BEWARE!!!!!! Wow so I have combination, sensitive skin and I'd been hearing a LOT about this primer all over the Internet and YouTube. I eventually caved and bought it for myself. So, my skin is normally pretty clear with the occasional rare pimple but when I started using this product I started breaking out BADLY. I had small bumps all over my forehead around my mouth tiny pimples along my cheeks and bigger ones along my hairline. I thought it must have been stress from college applications or senior year and kept trying to switch out other makeup products that I was using because it couldnt be my all natural coconut primer from Too faced!! I even rebought this product because it smelled good and felt so light on the skin. Ugh! Anyway just a month ago it was suggested to me that I must be breaking out because of my makeup so I went a week without wearing any skin makeup. Immediately my skin started to clear. I got excited and went back to using this primer with only a bit of concealer and started breaking out again. I finally accepted that this primer was causing the breakouts when I wore it only on my nose rather than in my entire face for another week and my nose broke out while the rest of my face cleared up. If you have similar skin or are just on the fence about this product please dont waste as much of your time and money on this primer as I did!!…read more"
   },
   "mightychieftane":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"4 Nov 2014",
      "title":"Really Nice!",
      "description":"I like this primer. It keeps my dry skin from soaking up all my foundation and looking patchy. It smells good! It doesn't get shiny or oily throughout the day, which is nice. And I like that it has a natural finish, not matte or \"luminizing\" which usually just translates as sparkly. I took off one star because the packaging is annoying. I don't like tubes with pumps because I feel like you can never get all of the product out. Not to mention they are a little unwieldy. Overall a good product. Has lasted a while and will purchase again!…read more"
   },
   "ber7676":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"10 Aug 2014",
      "title":"Can I give this product 10 stars?",
      "description":"I normally use Benefit That Gal, since I do not like the thick, silicone/mattifying primers. I tried this on a whim and wow.\n\nIt's lightweight, absorbs quickly and really gives my makeup staying power. I have sensitive, acne-prone skin and have had no issues.\n\nAnother thing I noticed was that my skin was noticeably brighter and fresher-looking. The best thing about this product? My skin even looked bright and fresh the next morning! Great for weekend days where you want to run to the store sans makeup. Nice added bonus!…read more"
   },
   "karebearlola":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"21 Dec 2014",
      "title":"In love",
      "description":"Truly amazing product. Worth every penny. I have oily skin and my face just loves this stuff, no issues what so ever."
   },
   "td05":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"5 Mar 2017",
      "title":"combination skin life saver",
      "description":"If you struggle with foundation clinging to dry patches, this is for you! I love the feel and the smell is amazing. Is it necessary? No it could be replaced by a simple moisturizer. But this is so hydrating I will continue to repurchase."
   },
   "gabilovesbeauty":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"18 Oct 2015",
      "title":"Love the smell...but not the hydration",
      "description":"I bought this product because the whole idea of a 'replenishing', 'hydrating' primer infused with 'coconut water' sounded amazing for my dry skin. Unfortunately, this did nothing for my dry, tight feeling face. As far as making my makeup last any longer, it worked just as well as all my other primers. The thing I loved the most about this product was the smell of coconuts :) I still use it because I am sure some of the ingredients in the formula are benefitting my skin, it just doesn't add any hydration to my skin like I was hoping for :(\nI will not be repurchasing this product when I am finished with my current tube.…read more"
   },
   "cassiesavan":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"19 Mar 2017",
      "title":"AMAZING",
      "description":"I don't have normal skin and wow this is so hydrating! like seriously my makeup looks so dewy using this primer and my skin feels so moisturized. And the smell is to die for! love this product"
   },
   "hdezsonia":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"14 Mar 2016",
      "title":"Dry Skin",
      "description":"I definitely LOVE this primer !! I would deff recommended if you have sensitive dry skin. It works wonders."
   },
   "Sabthao":{ 
      "extra_info":"<b>Eye Color</b> Hazel",
      "stars":"5 stars",
      "date":"25 Sep 2017",
      "title":"My \"Go-To\"",
      "description":"This is perfect for my skin! Living in Minnesota weather does horrors to my skin. One day its dry and sunny, the next its a blizzard outside. Strange, I know. Well My skin is usually very dry most of the time. This primer is so amazing. It hydrates my skin and smells soo good. And feels refreshing on my skin! I lovee love loveee this!"
   },
   "jvk2000":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"5 stars",
      "date":"26 Dec 2016",
      "title":"So good!",
      "description":"I have really dry skin and this just gives me an extra boost of moisture. It's hydrating and tacky so that it really holds the foundation on all day long."
   },
   "saraamc":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"27 Aug 2016",
      "title":"LOVE!!",
      "description":"I have repurchased this twice now along with the Born this Way foundation and I am honestly afraid to try anything else because it works so well!! My face is loving the two faced products lately, my skin's never been so clear and fresh looking!!"
   },
   "ludwig887":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"31 Aug 2014",
      "title":"Definitely replenishing!",
      "description":"I avoid primers at all costs because my skin is super sensitive to silicones. I also have combination oil-dry skin which makes it really hard to find the perfect makeup because mattifying products can get too drying and hydrating products can make me too oily. This solved everything. This is silicone free, it is fast absorbing, balances out my oily and dry patches and smells amazing to boot! I'm not usually a fan of Too Faced but they hit it out of the ballpark with this!…read more"
   },
   "aross89":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Dec 2016",
      "title":"proved me wrong",
      "description":"I'll admit, I thought primers were a joke. I have dry skin and it seemed all the primers I ever used including Dior Airflash never impressed me and felt like they were working against my moisturizer making my dry patches more visible. I started using more Too Faced products recently including the Born this Way foundation and liked it so decided to try a primer again. Wow! What a difference. Sometimes I don't even wear foundation after I put this on, my skin looks so hydrated and refreshed which is hard when you have dry skin. I'm sold, I just bought 3 more bottles, I never want to be without!…read more"
   },
   "Kelsey7996":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"7 Dec 2016",
      "title":"my skin loves me for this",
      "description":"I have very dry skin and I refuse to try other primers anymore because I love this stuff so much. I have one opened and two new ones stocked up and ready to go. And it lasts a long time. 1-1.5 pumps is enough for my face and one thing of this has lasted me 4 months already and isn't really even close to empty (I've maybe used 3/4 of it?). It's the perfect base for my foundations and genuinely keeps my skin hydrated. It works well with silicon primers too which I sometimes like to use on my t zone on top of this on more full coverage glam days. Oh and the packaging on this is great. I love me a pump. Coconuts are a nice little bonus too. Definitely recommend this for anyone with dry skin.…read more"
   },
   "Honeybunmom":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"5 Oct 2016",
      "title":"Happy skin",
      "description":"This primer is a game changer.  I wear it with mascara and lip gloss and my skin glows."
   },
   "steelersgirl22":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"8 Nov 2015",
      "title":"SOO GOOD",
      "description":"I've been using this EVERY DAY since June. So amazing. I get compliments on my skin every day even when I'm not wearing foundation. I recommend this fully. I ran out and had to IMMEDIATELY go buy another one. It's amazing"
   },
   "bonenna":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"3 Aug 2014",
      "title":"Great so far.",
      "description":"I have been using this primer for about a week now and so far it's doing a great job.\n\nI have very acne-prone combination skin (fairly oily t-zone) and every other primer I've tried caused very deep cystic acne within hours of application. So, at this point, I don't expect to see anything like that from this product.\n\nIt goes on pretty dewy/tacky but dries to a nice natural lightweight finish, and moisturizes nicely without feeling slick/greasy.\nIt helped my foundation go on smoothly and stay on during the heat and humidity. I also feel like my skin has gotten better/softer since using this.\n\nMy only complaint is the coconut smell when you first apply it, because I hate coconut, but thankfully it goes away completely once the primer dries.…read more"
   },
   "makaelamonique":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Mar 2015",
      "title":"Love Love Love",
      "description":"This is an amazing primer/moisturizer, I have combo to oily skin and I use this as a moisturizer before my actual face primer and this just adds a full 24 hour wear to your face lol I also like adding just a pump to my foundation for a more sheer look when I don't need to look at dressed up and it's just amazing!"
   },
   "Nicole5557":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"23 Mar 2017",
      "title":"not really a \"primer\"",
      "description":"I love Too Faced so I thought I needed this in my life plus I needed a primer. This is a light moisturizer...a nice one. But, I would not call this a primer. I'm still in need of a good actually primer. Frustrating! this sinks into your skin quickly and feels nice but doesn't leave a 'primed surface' I will keep using this as it is a nice light moisturizer but wouldn't buy again. Don't buy into the hype on this one."
   },
   "alexrae":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"14 Aug 2015",
      "title":"My secret ingredient!",
      "description":"I love this product. No other primer compares for me. Most primers leave a gross, slimy, greasy feeling behind that makes me feel like my makeup will slide right off. Not this stuff! It absorbs right in quickly and my makeup stays put all day long. In fact, if I use this product, I can be confident my makeup will still look exactly the same 15 hours later when I take it off for the day. I will also say, I bought this for the name. To be honest, I ENJOY alcohol but my skin does NOT. My skin is usually just a wreck after a night of drinking (I can’t be the only one with this problem), so when I saw this product it seemed like a miracle. And sure enough it is. On days when I have a hangover I will moisturize, prime, and usually my skin drinks it right up and I end up having to prime again (but that’s perfectly fine) and my skin thanks me and looks healthy and amazing!!! I can’t say enough good things about this product; it just leaves skin looking and feeling healthy and happy!…read more"
   },
   "moontoast":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"22 Mar 2015",
      "title":"This primer makes my face look and feel amazing. Makeup goes on smoothly and lasts all day! LOVE IT!",
      "description":""
   },
   "36yearsyoung":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"30 Nov 2016",
      "title":"Not For Me",
      "description":"I am 40 with Dry skin, plus lines and some wrinkles. I used this sparingly as directed! It balls up, regardless of Foundation or skincare type you have underneath. This is not for dry mature skin. Grr.. I would not repurchase."
   },
   "Nessa95":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"1 Aug 2015",
      "title":"Finally",
      "description":"Finally found a primer I like!! I have very dry skin and this primer hydrates my skin and makes it look brighter! I've tried Kat Von D's primer and makeup forever and both didn't do anything for me. I use this after moisturizer and let it sink in a little before my foundation. Definitely worth a try!!"
   },
   "NinaVirgilio":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"3 Feb 2015",
      "title":"I've seen this primer all over the blogs/vlogs and wanted to try it out. As someone with incredibly dry, flaky skin, I thought it could at least help hydrate and plump up my skin a bit before foundation. At first, I thought it didn't really do much, but now, I know when I don't use it! It helps my makeup go on much smoother. It helps the foundation not cling to my dry patches. I like to use this, then a spritz of UD's All-Nighter before applying foundation. The combo of these two seem to be working well for me right now. I wonder if it might be too hydrating once the spring/summer comes and the air isn't so dry. The smell is so-so, but it's not offensive enough to make me stop using it.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
      "description":""
   },
   "alliwoods":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"30 Jul 2014",
      "title":"Perfect",
      "description":"This primer is my new favorite. It's lightweight yet moisturizing. It makes my skin look smoother and glowing. The finish is a nice in between of dewy and matte. It will definitely benefit to all skin types."
   },
   "Bohemianhipster":{ 
      "extra_info":"<b>Hair Condition</b> Curly",
      "stars":"5 stars",
      "date":"18 Jul 2018",
      "title":"For some reason when I used this primer my skin looked amazing and I have oily skin. But idk what’s in this bottle but my skin loves it and it looks radiant and perfect. And it didn’t break me out. Which everything does. 5 stars from me!!",
      "description":""
   },
   "angelswings0304":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"23 Sep 2014",
      "title":"Hydrating",
      "description":"Vey hydrating and fast penetrating with a lotion type consistency from a pump type tube. Has a tropical scent which some may find irksome but I don't mind it. I bought this because I am not a fan of silicone based primers which make me feel like I've just applied an invisible coating of wax on my face. TF Hangover absorbs right in and face feels like it's been nourished. Skin looks fresh and radiant. I wish there was SPF added to it but I bought it knowing there wasn't and I wanted to try it anyway. My daughter who is in 20s has been using this and she really like it. Will purchase again.…read more"
   },
   "hd411":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"16 Aug 2016",
      "title":"Moisturizes without causing breakouts!!",
      "description":"I bought this for my sister for her birthday, and she loves it. Her skin gets dry very easily, so she loves how this primer moisturizes her face without making her breakout! She said the primer holds your makeup pretty well, so it's good for every day use. You might want something with a stronger hold for special occasions."
   },
   "marijanelle7":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"17 Aug 2015",
      "title":"I really wanted to love it.",
      "description":"After reading raving reviews on this primer, I decided to purchase it. I was so excited when I got it in the mail. I was so disappointed. (I really wanted to love it.) it never fully set on my face and left a sticky feeling. It didn't leave a smooth finish like other primers, and the worst part was after applying foundation, a ton of flakiness appeared on my face. Sadly, I am going to have to return it."
   },
   "meagxn":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"26 Dec 2016",
      "title":"Love it",
      "description":"This has literally made such a difference in my make up. However I do not use this product alone for priming my face. After I moisturize my face I use this product and then after that I put Benefit's Porefessional on areas where I feel my pores need further smoothing. I absolutely loved how it made my make up look so smooth and it lasted much longer. \r\n\r\nI have used this product alone and I feel it works much better with the Porefessional over it.\r\n\r\nPS I have combination skin…read more"
   },
   "Rachelcrist":{ 
      "extra_info":"<b>Eye Color</b> Blue",
      "stars":"3 stars",
      "date":"9 Mar 2018",
      "title":"This primer just wasn’t a good fit for me. I have oily skin, and this product made my skin shinier than normal not even a full hour after application. The smell was so-so, and the consistency of the product was a little too slick for my liking. The absorb-ability was mediocre, which I think is what contributed to the left over shine on my face. I would only recommend this to people with dryer or dehydrated skin types.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
      "description":""
   },
   "MariaEstela":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"14 May 2017",
      "title":"Breakouts",
      "description":"I received a sample and It did not work for me, I don't really have sensitive skin and it made me breakout in places that are not prone to breakouts on my face like my under eyes :("
   },
   "fieldhockeygk11":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"1 Feb 2016",
      "title":"I purchased this product on the recommendation of a Sephora employee (I have combination skin that tends to get more irritated during the winter), and have found that it is moderately helpful, though is causing some breakouts. It also does very little for my oily spots. However, it makes my dry patches look beautiful! However, it is a bit tacky and sticky, and takes time to sink into the skin, which is problematic if I need to slap it on and go. I love using this as a moisturizer on those days when I don't feel like wearing makeup but want glowy skin.\nSolution: use two primers - one more mattifying, and this. I recommend this for people with combination skin, as well as those with normal, sensitive skin, though with a caveat. I do believe this is breaking me out, as this is the only thing that has changed in my routine.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
      "description":""
   },
   "kittyplease":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"3 Jan 2015",
      "title":"I wouldn't call it \"holy grail\" status, but this is definitely my favorite primer I have tried so far. It's very hydrating, but also light and non-greasy. The coconut scent is rather strong, but not unpleasant - plus it goes away as the product dries. I have not noticed any of the brightening effects, unfortunately. I've also noticed that you actually need to apply foundation while this primer is still moist - if you let it dry first, it will \"ball\" up, and you end up looking like you have eraser crumbs on your face.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
      "description":""
   },
   "Amandaziv":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"27 Dec 2016",
      "title":"Lightweight &amp; Hydrating",
      "description":"I like this for everyday- I feels like another step to my skincare routine. Its a lightweight gel-lotion that smells lovely and absorbs quickly. Really hydrates, and does help my foundation go on well. ALSO- it has excellent skincare ingredients (seriously, wow). I think it's good for dry/normal/combo skin.It doesn't necessarily help prolong my foundation, though. It primes the foundation to go on evenly and is good for your skin but isn't a \"make your makeup last 24 hrs\" or \"make your face look airbrushed\" kind of primer. \r\n\r\nIf you want a little more radiance, or something even more hydrating, the new First Aid Beauty Coconut Face Smoothie is what I prefer. It has 1.7 fl oz, making it much much cheaper. It's super radiant (winter takes makes my skin so dull) and also has excellent skincare ingredients. You also need a lot less of this product than the hangover rx.…read more"
   },
   "AA07":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"16 Dec 2015",
      "title":"Not really much of a \"primer,\" but...",
      "description":"I think most of the mixed reviews of this product are due to Too Faced’s own marketing misnomer.\n\nToo Faced is definitely a makeup brand. They haven’t gotten much into the skincare game yet... and to fit with their current branding and make this a step in the Too Faced “foundation routine,” this was labeled as a “primer.”\n\nIt’s really not. No more than any other moisturizer, at least. Of course, makeup DOES apply and last longer on well-moisturized skin. But this doesn’t have the smoothing or prolonging power of a dedicated “makeup primer” designed to do just that. If you want a longer wear for your makeup, the Urban Decay Primer Potions and setting sprays are a better bet. And if you desire something skin-smoothing you’ll want a formula with silicon.\n\nWhat this IS is a really nice, nourishing daytime moisturizer. People with oily skin know they don’t NEED this sort of day time moisturizer--they’d go for a gel or something oil-free, if anything--so if Too Faced hadn’t called this a “primer” they could have avoided a lot of the unhappy reviews from oily-skinned people who were hoping for something with more “priming” qualities.\n\nAs a daytime moisturizer, I really like this stuff. I prefer a dewy finish so this works great for my combination skin. Just know what you’re buying!…read more"
   },
   "emilyeran":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"11 Dec 2015",
      "title":"Hydrating!",
      "description":"I wouldn't really call this a primer, however, this is such a good moisture boost for the winter months! I've been struggling with dry patches and this is so calming to put on the skin."
   },
   "cryscam":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"20 Sep 2015",
      "title":"good for sensitive skin",
      "description":"Love this primer when needing a boost in hydration. I have several primers and this is my go to for hydration."
   },
   "JennyMcD":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"20 Dec 2015",
      "title":"moisturizing",
      "description":"I don't know that this product is the best in terms of priming but it does provide excellent moisture for my extremely dry skin."
   },
   "mariafra":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"14 Jan 2016",
      "title":"love love",
      "description":"I bough that primer because my skin feels so dry lately even though I usually have combination skin. It was so bad I wanted to remove my foundation! Thanks to this primer my skin feels a lot better and my foundation lasts all day long. I love it"
   },
   "absutt":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"17 Aug 2017",
      "title":"HEAVEN SENT",
      "description":"I have rosacea, and so my skin is rough and patchy on my cheeks. Powder foundations have been a hassle, and liquid foundations build up and highlight every imperfection. I have had bad luck with primers, which work at first but ultimately leave my skin looking dry and flaky. Then... this beauty. It keeps my skin hydrated all day and my liquid foundation goes on smooth. Highly recommend for anyone with Type 2 Rosacea. \r\n\r\nI'm using it with Tarte's Amazonian Clay foundation, which also helps keep skin hydrated, but looks so much better with Hangover underneath.…read more"
   },
   "emdear":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"10 Feb 2015",
      "title":"This product left my combination dry skin oily and very shiny even with setting powder. It's the dead of winter and I wore it outside and in class today.\n\nIt did not blend well with Laura Mercier tinted moisturizer at all. I use tinted moisturizer because it is light and this product also so heavy.\n\nIt left my skin feeling sticky all day and did nothing for the appearance of my pores whatsoever.\n\nI am returning it tomorrow.\n\nIn conclusion, it is getting two stars rather than one because I definitely still saw pigment left/staying power at the end of the day although it was overshadowed by all the shine! May work if you are used to having a heavier foundation on your face and if your skin is dry.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
      "description":""
   },
   "marymac":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"3 stars",
      "date":"8 Sep 2014",
      "title":"Not the best for me",
      "description":"Being over 60, I like a little more help with the coverage of wrinkle lines. That being said, I did find this product to have a reviving effect -- it smells great and is readily absorbed. I will use it for everyday wear and recommend it for the younger customers who aren't fighting the ravages of age:)"
   },
   "SarahTheBear":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Nov 2016",
      "title":"combo skin LIFESAVER",
      "description":"I only bought this product because a Sephora employee recommended it. I told her I have never found a foundation or BB cream that worked well for me, and she recognized instantly that it was because of the primer I had been using. Since using this product, my skin has been a lot less prone to acne, I can use almost all the foundations that I could not before, my makeup blends easier and stays longer, and the overall moisture level of my skin has been even across my whole face and much improved. I especially like that I don't need a lot of product to get the job done, a pea sized amount is more than enough.…read more"
   },
   "JennaSaisQuois":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"21 Dec 2015",
      "title":"Finally a Primer for Dry Skin!",
      "description":"This is seriously amazing! I have combination/dry skin especially in winter, and this has already made such a difference! Silicon-based primers, while they definitely help to minimize the appearance of pores, really dry me out and make my makeup look super flakey/cakey. But this is the consistency of a facial moisturizer, and super nourishing and refreshing.\n\nWhile this FEELS like applying moisturizer, it definitely acts as a great base to lock-in foundation while retaining some healthy hydration. I like to apply this first, all-over, and then go in with just a dab of a pore minimizing primer in just my trouble spots to avoid that dried out look/feeling.…read more"
   },
   "iuli":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"28 Apr 2016",
      "title":"exactly what I needed",
      "description":"I have dehydrated oily skin (you read that right). My skin likes to drink up my foundation during the day, and it ends up separating, which I hate. This primer fixes that for me! It is hydrating and it helps my foundation last longer and look better. I often wear foundation for around 12 hours, so I can tell that this primer made a big difference! It helps control my oiliness in my T-zone, which is wonderful, but I wouldn't recommend it for its mattifying properties, if you know what I mean. It makes me look awake, a sort of lit-from-within glow, but it's not dewy!\nIt does help my foundation apply better and look more natural, as long as I don't wait too long between applications.…read more"
   },
   "peytlb":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"2 Jan 2017",
      "title":"great for dry skin",
      "description":"I love this primer for my skin type. I am prone to dry patches on my skin, making my make up look cakey.  This helps tremendously.  It doesnt help so much with longevity, but that isnt so much a concern with my skin type.  Great product for dry, uneven skintones."
   },
   "perfumequeen":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"5 stars",
      "date":"21 Jun 2015",
      "title":"NO SILLY-CONES! YAY!",
      "description":"I don't use primers. I hate to pile stuff on my skin. But I got a generous sample of this, used it several times, and I love it. It's a gel-like, not-too-thick primer that smooths my skin in a natural and believable way. Never once broke me out, absorbs fast, and hydrates my oily skin w/o turning it into a greasy mess.\n\nAnd most important of all: NO SILICONES! Bless you, Too Faced!\n\nI think this is great for oily/acne-prone skinned ladies. However, since every skin is different get a sample first, if you can.…read more"
   },
   "Evelynn21":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"17 Oct 2016",
      "title":"Love!",
      "description":"I have oily skin and I use this almost every day. I have dry patches around my mouth area because I am on acne medication but this masks it! I also love the scent. I have already gone through one entire tube and just purchased my second one. It does feel tacky after application but that is to help the makeup stick to your face. Really do love this product, it is a staple in my routine."
   },
   "addict1":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"3 Aug 2014",
      "title":"GREAT PRODUCT",
      "description":"Finally a primer that doesn't irritate or make my cranky/sensitive skin breakout! No silicones!\nWorks fantastic, very soothing and moisturizing without being greasy or slippery. Foundation goes on smoothly and lasts longer with it. Very happy with this purchase!"
   },
   "Sparklygirly":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"9 Aug 2014",
      "title":"So far, great!",
      "description":"Its name first attracted me to this product. I've been using it for 3 weeks. It is a lightweight veil under makeup, leaves skin soft and refreshed, dewy, but never greasy. It doesn't cause redness or irritation to my sensitive skin. I love the pump dispenser and it is portable. It smells faintly of coconut and an herby scent, almost like thyme. A little dab is all you need. I definitely will repurchase."
   },
   "Nim13":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"13 Mar 2017",
      "title":"Hydrating",
      "description":"This primer is great. It's not my absolute favorite because it doesn't fill in pores and lines, but it works so well with my facial oil and foundation. It's hydrating and gives my face a little radiance before I apply my foundation. I love it."
   },
   "Jooleeaah":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"3 stars",
      "date":"14 Jun 2016",
      "title":"Great Product, Broke Me Out",
      "description":"I bought this a little while ago and got about halfway through the bottle before I had to stop using it. It hydrated my skin and helped my makeup stay on my face, but ultimately broke out my very sensitive skin and I had to stop using it. Which is a shame, it smelt very good and made my skin feel nice."
   },
   "Amyesthetician":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"24 Aug 2015",
      "title":"Take it from a skin care expert!",
      "description":"I have been in the skin care business for over twelve years. I am always willing to try something new on the market. This primer is lightweight and I appreciate the ingredients. It is not silicone based. Other primers are so greasy, heavy, and have a tendency to not allow your skin to breathe. I always take them off immediately because they make me feel almost claustrophobic. This is an excellent choice for a primer and Too Faced not only cares about your makeup staying in place, but the overall health of your skin as well! Definitely recommend to anyone, but especially to anyone that is prone to breakouts or oily skin. It's nice and refreshing! Such an awesome product!…read more"
   },
   "MeghanD1120":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"24 Feb 2015",
      "title":"Love!",
      "description":"So I have combination skin, and very rarely do I have a break out. Before this product I was using a L'Oéal moisturizer under my makeup and it was nice but a bit too heavy. When I saw this I figured I would give it a shot. I LOVE IT! Now, I would not recommend this product as a PORE primer, but it definitely is a face primer. It nicely preps my skin before I apply my makeup. I don't have too many trouble pores but on days I want to conceal them, I use this product along with the smash box pore minimizer, and together... flawless!! The smell is basically the ingredients.. coconut water. I didn't love the smell at first but now I do because it just replenishes my face! I will even use this product on days when I don't wear any makeup. Overall, its for sure worth a try! You will fall in love if you know this product is more of a pre-makeup moisturizer.…read more"
   },
   "julia46":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"5 stars",
      "date":"14 Nov 2015",
      "title":"Love this primer!",
      "description":"This primer is awesome! I put on and wait for a few minutes and then apply my foundation and it goes on so smooth. I highly recommend this product.. it is the best primer I have ever used."
   },
   "pancakemomma":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"10 Dec 2014",
      "title":"This is my jam!",
      "description":"I have dry, sensitive skin. This means I have to wear a moisturizer every day, even during summer in Houston. This also means the fewer products the better. If I pile on moisturizer, primer, and foundation, my makeup sticks but my skin burns like crazy. Then I discovered this perfect little multi-tasker! I use this product as both moisturizer and primer and my skin has never been happier and my foundation has never looked better. It soothes, smooths, moisturizes.…read more"
   },
   "INC0503":{ 
      "extra_info":"<b>Hair Condition</b> Normal",
      "stars":"4 stars",
      "date":"24 May 2018",
      "title":"Smells natural and helps my makeup stay at my face for a longer time while keeping my face hydrated. The only reason I put 4 stars instead of 5 is because It doesn’t smooth out any pores or has any special function compare to the primer I have for other brands. Overall, still a pretty good primer.",
      "description":""
   },
   "Lunastella22":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"25 Feb 2016",
      "title":"Too Perfect",
      "description":"I love this primer so much that I wore it on my wedding day! It was a hot and long [but fantastic] day, my make-up stayed in place and didn't budge a bit all day. Better yet it kept my skin moisturized underneath a pound of makeup. I cannot recommend this enough and will be using it as long as they make it."
   },
   "jazzyhaire":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"22 Jul 2016",
      "title":"Holy Grail!!",
      "description":"I got this product as a sample in my monthly IPSY bag. The first thing I noticed after putting it on was how soft it made my skin feel and how good it smelled. I normally don't wear my mineral powder foundation alone because of how dry my skin can be, but I decided to test it with this primer. My skin did not dry out ALL DAY and my foundation stayed on! I will definitely be purchasing the full size."
   },
   "eire3":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"9 Mar 2015",
      "title":"Good!",
      "description":"I have never purchase a primer that was not catered to oily or acne prone skin until this. I do love the primer! It a really moisturizing primer. Even though i am oily my skin get drier throughout the winter without proper products and this did the trick for me."
   },
   "JessicaB18":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"13 May 2015",
      "title":"Love this primer!",
      "description":"I love this primer! I use it as a moisturizer for days that I'm wearing makeup. It's been great for my combo/oily/acne prone/sensitive skin!"
   },
   "AverySutton":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"21 Jun 2017",
      "title":"CONFUSED",
      "description":"When I first got this primer, it was PERFECT. My foundation applied flawlessly over my dry, dehydrated and extremely textured skin. It acts as more of a moisturizer than I primer, but I LOVED IT. I used this whenever I wore face makeup and I was never disappointed. There was a period of about a month where u didn't wear foundation and my skin was a little less flaky and so I had no need to use it. But eventually I wanted to wear foundation again so I picked it up to use it. I was so excited, and when it applied it to my face, it felt wonderful. My skin felt moisturized, but when I was finishing rubbing it into my face, it started balling up and PEELING OFF MY FACE! I tried using it many more times but it still kept just clumping off my face!!! I checked the expiration time, and I atoll have a few more months before I expires! I'm so disappointed, I still have a lot of product left and I don't want to waste my money on a new one incase this happens again.…read more"
   },
   "Reighna":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"7 Jan 2017",
      "title":"Dry Skin Miracle",
      "description":"I have pretty flakey, dry skin and this is one of the best primers for that! it made my makeup last all day and i noticed a difference in my skin without makeup. and one pump can cover your whole face so it's definitely worth the price."
   },
   "klghpytn":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"4 stars",
      "date":"23 Apr 2018",
      "title":"great for dry, sensitive, eczema-prone skin",
      "description":"I was struggling with eczema around my eyes for the first time in my life, I assume due to a reaction I was having to a cosmetic I was using, and saw online someone recommended using this primer before applying under eye concealer, and my gosh, IT WORKS! My eyelid eczema has totally cleared and this primer creates a moisture barrier between my skin and concealer/setting powder, with only very minimal creasing (I use a lot though just to be cautious, so that could be why). I can't speak to using on the rest of the face because I prefer silicone primers for my oily skin and large pores. Cool thing about this primer is the first time I used it I was amazed seeing my dark circles diminish within a couple minutes!…read more"
   },
   "IrinaRoo82":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"11 Jan 2017",
      "title":"dry skin saver!",
      "description":"i was doing a walk of shame and had such dry skin from the cleanser at guys place, this was the first thing i saw and instantly my dry patches were soothed...i use becca's backlight priming filter but for the winter i mix this in or use this under it as a moisturizer- its soooo nice on skin"
   },
   "RedUni":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"8 Oct 2016",
      "title":"Not the best but will do",
      "description":"I've been using this primer for maybe 2 months or so. I love the coconut smell and hydrating effect but I wouldn't recommend it if you were wanting only a primer. It will do the job, just not as well as other brands."
   },
   "jnj2313":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"3 Apr 2015",
      "title":"This primer did save my severely dehydrated winter skin, however it broke me out. It also caused some weird texture issues.",
      "description":""
   },
   "JayLips":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"10 May 2016",
      "title":"Just buy it!",
      "description":"The product name says it all. This primer leaves my skin feeling refreshed, smooth,  toned and gives it such a healthy glow! It's a must have! I'm so glad I tried this product and am completely obsessed! It has replaced every other primer I've owned. This one is pure magic. If you're still thinking about it.... Just buy it! You won't regret it."
   },
   "Reshhhu":{ 
      "extra_info":"error getting this field.",
      "stars":"3 stars",
      "date":"7 Mar 2015",
      "title":"works but made me break out",
      "description":"I used this for about a week but I unfortunately had to return it since it made me break out.\n\nThis stuff does work great. It's very moisturizing but unlike the korres primer, this one actually works as a primer.\nIt will help your foundation last longer and I loved that it didn't have silicone.\n\nI had to return this though because it was creating small pimples all over my face. This foundation has lactobacilli which is a probiotic bacteria. But lactobacilli makes the environment around it acidic. I think that's why it made me break out. It was changing my skin's pH to acidic and my normal skin microbiota was not used to it. Each time I used this primer it got worse and worse. After a week I gave up and went to go return it because I was tired of the itchiness on my face.\n\nIt does work as a great foundation guys but it just was not for me. I wanted to love it but it just was not for me.…read more"
   },
   "sydfernandes":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"19 Aug 2017",
      "title":"awesome",
      "description":"it's very moisturizing and makes my makeup look so dewy and glowy"
   },
   "Annayibab":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"22 Jan 2018",
      "title":"I really wanted it to work.",
      "description":"I love love the brand too faced!! but the primer didn't do it for me.. I really wanted it to work, It was super moisturizing, but as soon as I put on the foundation it was super blotchy, started peeling and I didn't really like the scent, smelt like crayons."
   },
   "fabulous44":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"20 Aug 2014",
      "title":"Absolutely Fabulous!",
      "description":"What a great product....I am not sure there is a better primer out there right now. I had read about Two Face's Hangover Replenishing Primer in a well known beauty magazine where it received rave reviews. I am not a fan of primers, I find the silicone based ones too slick, and end up doing the opposite of what they are designed to do.\nI find the cream based ones too thick....whether its creamy in texture, or silicone based: my make up is shiny and\nslipping in a matter of hours. So I stopped using primers, but being the product junkie I am, decided to give this new one a try.\nSo glad I did! The texture is thin, no silicones, my skin absorbs it in no time. I hardly have to wait at all for it to set so I can apply my foundation.\nThe formula smells a little odd....herbal like?...but it's not an over powering scent. It kind of gives a slight tingling sensation too, but it does not irritate my skin. Once it absorbs there is no scent.\nThe result is just lovely....a soft focus inner glow that lasts all day and keeps my foundation fresh looking.\nI am not sure it evens out my skin tone, but it does appear to make the areas on my face where my pores are more visible, a lot less visible.\nVery happy to have given into my \"addiction\" and tried this amazing product.…read more"
   },
   "LovetoLoveLife":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"14 Oct 2016",
      "title":"Most Hydrating Primer Ever",
      "description":"Unlike the majority of primers on the market, this has absolutely no silicone! Too Faced's Hangover Replenishing Face Primer is just pure moisture for your face. If you have normal, dry, or combo skin, this will suit your skin and make you look like you're glowing from within. (Sometimes I just put it on without makeup just because I love the moisture and coconut smell so much! :P) I do not recommend it for people with oily skin, but it may work for you during the colder months. Highly quality ingredients work effectively together to produce a high quality, moisturizing, smoothing product. Way to go Too Faced, this is one of my favorite releases from your brand!…read more"
   },
   "annieward1119":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"2 Aug 2017",
      "title":"amazing moisture",
      "description":"yo, this shiz is legit. wakes me skin tf up and makes me concealer and foundation stay longer than my dad did."
   },
   "shelbytetford":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"2 Jan 2017",
      "title":"just a moisturizer",
      "description":"I love this... it smells good and it seems to work but it's just a moisturizer I think. Pricy again for the amount you get but I really like the packaging with the pump!"
   },
   "rachmakeup23":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"10 Aug 2016",
      "title":"Love dis stuff",
      "description":"Girl I put this on after the shower my face glowin. So moisturizing make up stays on A1. Got it in my eye now my eyeball moisturized too"
   },
   "LaylaKitten":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"11 Aug 2014",
      "title":"love the smell",
      "description":"I have tried their sensitive skin poreless primer and was not happy with it... Made my skin feel like I was rubbing on too thick a silicone type primer. I was hesitant to try this so tested it in store and immediately fell in love with the way it absorbed into my skin leaving a smooth even texture and the smell has a slight coconut fragrance which I believe is one of the ingredients. Well done too faced! Big improvement!!!! Will buy again!!!…read more"
   },
   "snoclassy":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"23 Jan 2015",
      "title":"keeps face looking alive. Don't conceal pores and doesn't hold on to foundation... I use this as a moisturizer and put a primer in my t zone and it's fine for me...",
      "description":""
   },
   "summi11":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"4 stars",
      "date":"9 Sep 2017",
      "title":"4 stars because i notice my foundation will slide couple hours later even after setting with powder &amp; spray ..although the smell is delightful, maybe the combo i used didn't work well lol",
      "description":""
   },
   "JRshops":{ 
      "extra_info":"<b>Skin Type</b> Dry",
      "stars":"4 stars",
      "date":"17 Jan 2016",
      "title":"Great Primer",
      "description":"I have used this for about a week and a half. It is very hydrating and absorbs quickly which is great for my pre-work morning makeup routine. My make up goes on smooth and lasts all day! I haven't noticed any brightening effects but maybe it's too soon?"
   },
   "mvm211":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"8 Jul 2017",
      "title":"Best Primer EVER",
      "description":"I have terribly dry skin. I have tried many different primers and lotions to prevent flaking and cakyness. I live in a very humid place and my makeup usually ends up flaking off by the end of the day. This primer allowed my makeup to stay on all day without flaking or caking. It also is very nice formula for sensitive skin, it doesn't have a strong scent, and it has no artificial colour.  Will repurchase in the future!"
   },
   "sunshine23":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Sep 2017",
      "title":"Best Primer I have EVER used",
      "description":"I love this primer. It doesn't matter which foundation I use with it, it will always keep my makeup in place all day. If I'm tired in the morning and forget to use I can always tell a few hours after. I use this in the mornings and then I go work out at 7pm, even after working out and sweating for over an hour my makeup still looks great. This has a slight cooling and tacky feeling after putting on so it really wakes me up and my foundation sticks. Primers have never mattered to me one way or another until I started using this one, now I can't go a day without it…read more"
   },
   "makeuplover003":{ 
      "extra_info":"<b>Skin Tone</b> Light",
      "stars":"1 star",
      "date":"5 Sep 2017",
      "title":"just a bad (overpriced) primer",
      "description":"it peels off. it's rolls up with the foundation and even when used alone it rolls up almost flaky. is not a good primer and does not do a good job moisturizing either"
   },
   "LaughingLizzy":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"15 Feb 2017",
      "title":"Not worth the money",
      "description":"This primer smells amazing like the majority of people have said. However, instead of moisturizing my dry skin it made me; break out, caused my skin to peel, and didn't help my makeup last. BI have to finish the product before I buy a new one, but I'm so disappointed. I had such high hopes for this and was let down. Does anyone else have a peeling effect or is it just me?"
   },
   "Cristina4106":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"16 May 2015",
      "title":"didn't work well with",
      "description":"This didn't work well with my nars sheer glow. My makeup was breaking up on my face with an hour. It looked awful. I tried it with different lotions underneath, but eventually I returned it. I wanted this to work so bad I have dry skin, I need any boost I can get."
   },
   "1ladynita":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"6 Oct 2015",
      "title":"Dry Skin Solution",
      "description":"I have dry skin especially in the colder months. I've tried a lot of primers that I felt sat on top of my skin. This product penetrates my skin and does it's job at moisturizing. I will continue to purchase this product."
   },
   "victoriale":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"12 Oct 2015",
      "title":"Used as a moisturizer",
      "description":"It's more of a moisturizer than a primer. Makes my skin feel so replenished and I love the fact that it has coconut water in it."
   },
   "RizaB":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"11 Jan 2015",
      "title":"New Favourite",
      "description":"I'm really digging this primer-- In the past I've used pore-filling primers because I have large pores, but even though this doesn't do a lot to conceal my pores, I definitely think I have better results with this! My foundation goes on smoothly, my skin feels hydrated and healthy, and I've noticed a definite improvement in the texture of my skin since starting to use this. On days I don't wear makeup, I'll just use this in addition to my moisturiser with a little translucent powder and I feel really fresh-faced. (Plus is smells like paradise.)…read more"
   },
   "tragedie8":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"9 Jan 2015",
      "title":"It puts the primer on its skin...",
      "description":"This stuff is amazing, yes it smells like Piña Coladas, but after 2 minutes you don't smell it anymore. I love the smell, it's super fresh, this feels just as amazing going on your skin as it feels. I don't see any crazy difference in my skin after using this except that my skin is much more radiant. HOWEVER, my skin feels amazing with this on, it is crazy moisturizing, my skin drinks it up, products go on top of it super easy, and after hours of wear, my skin doesn't start to feel dry, tight or itchy like it does with other primers. And that says a lot, out of the 30 something primers I've tried. And that is more than enough for me, just refreshed, moisturizer skin makes me more than happy.…read more"
   },
   "RoyalButterfly":{ 
      "extra_info":"<b>Eye Color</b> Green",
      "stars":"1 star",
      "date":"7 Jan 2018",
      "title":"Horrible.. make my foundation separate really badly and makes me break out with acne. I’m glad I got a sample of this before buying it because I was going to and I’m so happy I didn’t. I had this on not even two hours and it looked so bad I had to wipe off all my face makeup, and it already gave me acne in that short period of time. I do not recommend this.",
      "description":""
   },
   "valeaolivas":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"4 Feb 2016",
      "title":"Good Primer",
      "description":"I have combo skin (more dry than oily), but this primer really helps give me that extra moisture I need in the drier parts of my face. With that said, it really helps my foundation to stay put longer instead of it withering away bit by bit throughout the day. The only con is that your skin does feel a bit sticky at first, but for me that feeling goes away after a few minutes. Unless you don't like the smell of coconuts and/or you have really oily skin, I would recommend this primer.…read more"
   },
   "juliaraaa":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"16 Aug 2016",
      "title":"nice",
      "description":"I love this primer! It makes my skin feel super hydrated and it also smells amazing. I like to use this on days when my skin feels really dry"
   },
   "chrisluvsdjr":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"16 Feb 2016",
      "title":"10 years younger",
      "description":"I love it ! Can't live without it!"
   },
   "jacksonkc":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"18 Jan 2015",
      "title":"Not Simply a Primer",
      "description":"Unless you have very dry skin, I wouldn't recommend using this as a primer. I use it as a moisturizer and it's great for that purpose. It's ingredients have ton of great benefits and it smells amazing."
   },
   "shevz":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"3 Nov 2015",
      "title":"not for sensitive skin",
      "description":"This product is definitely not good for me I have very sensitive fair skin. I foolishly didn't read the ingredients and bought it because I trusted the employee. This product contains fragrance and fragrance should never ever be put on the skin! also caused my makeup to have way tooo much of a slip."
   },
   "maggilicious5":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"4 stars",
      "date":"6 Apr 2018",
      "title":"I have combo skin oily on the forehead but dry on the cheeks and especially the chin so this primer has worked pretty well for the bottom half of my face but I’m still trying the best method for my forehead (might just need to powder it a lot more). I’m not particularly fond of the smell but it has a great feel/texture. It gets absorbed by ur skin. Really nice and will consider buying it again",
      "description":""
   },
   "Jayt04":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"3 stars",
      "date":"18 Oct 2016",
      "title":"Use wisely based on your skin type",
      "description":"I have oily to combo skin. This is definitely a product that is more suited to dry skintypes, and I wish I would have known that before buying it. That being said, I CAN make it work for me, but it's definitely not as effortless as any of my other primers. It has to be one of the first things I apply on my face, my foundation being one of the last things I apply (other than bronzer, powder, highlight, etc). If it isn't, it will ball up my foundation and cause it to separate in areas.\r\nIt smells great. If you are sensitive to strong scents then you may want to avoid it, but I love the smell of pina coladas/coconut.\r\nIt also does not break me out. If I use this, one thing I don't have to worry about is having a new zit pop up after wearing face makeup all day. It's like skincare, but for makeup! That's pretty cool.…read more"
   },
   "SmileCuz":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"22 Aug 2016",
      "title":"The best",
      "description":"Love this stuff!  It is fast absorbing and great on its own!"
   },
   "carlismith1":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"7 May 2016",
      "title":"Love",
      "description":"This is my new favorite primer. I haven't gone a day without it since I first tried it a few weeks ago. It's great for combo skin, hydrates but doesn't make me greasy. I love it!"
   },
   "smashleylynn":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"3 Oct 2015",
      "title":"Love this!",
      "description":"I was hesitant to try this since I can get a little oily but wow, am I impressed. This keeps my skin so nice throughout the day - I can't even explain. It smooths and keeps me looking dewy (not greasy!!) and healthy and I just can't get enough! When I use this my confidence goes through the roof because my skin just looks so great, even with makeup! It's a great find and if you're considering, give it a shot!"
   },
   "Meeliza":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"7 Feb 2016",
      "title":"Amazing",
      "description":"I have extremely oily skin, and have had issues with almost every type of makeup either looking cakey or looking oily after about 2 hours. This stuff helps my makeup stay put almost all day. Not only that, but it smells like coconut and doesn't make my sensitive skin break out like some primers do. Absolutely amazing!"
   },
   "cchong":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"5 Feb 2015",
      "title":"Pleasant surprise",
      "description":"I first got this months ago when the Too Faced Cocoa Powder Foundation came out as well. I just happened to mention to the Too Faced rep that I didn't like silicone primers, so she immediately recommended this. At first, I was pretty skeptical. I have oily skin and this has no promises to keep the oil at bay. However, my skin LOVES this stuff. It makes my makeup glide on, and if I felt like it, I could probably use only this as a moisturizer-primer combo.\n\nWith my oil skin, I've stopped expecting products to totally and completely prevent oil breakthrough. What I look for is how the products perform when the oil does break through. With this, oil breaks through evenly, gives my face a nice glow, and magically prevents whatever make up on top from totally breaking down. LOVE.…read more"
   },
   "ckatec":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Apr 2017",
      "title":"OBSESSED/ NEW HOLY GRAIL but use it the RIGHT way!",
      "description":"This primer is amazing! It feels amazing (silicone free), makes makeup look flawless, and smells amazing! Let me explain why there are negative reviews.. if you take this primer, immediately rub it all over your skin and then immediately put on foundation- you might hate it. BUT if you use it correctly, take a pump on your hands and rub it for like 3 seconds it will get slightly tacky, then rub/pat all over your face. Wait 30secs-1minute (which you should do with every primer) and then put on foundation- YOU WILL ADORE IT. It keeps makeup on all day and makes my pores invisible. I have tried many primers, but my all time favorites are (still) the becca backlight priming filter and NOW the toofaced hangover. Keep in mind these are completely different primers. Anyone could use the toofaced, but I'm not sure if a very oily person would like becca. (I'm oily-combo)…read more"
   },
   "ayyychelsaaay":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"5 Mar 2017",
      "title":"PROS / CONS",
      "description":"PROS: \n- Ultra Hydrating! Perfect for the cool weather that'll chap your skin!\n- Dry Patches? No problem! This'll help moisturize and smooth them out underneath your foundation!\n- Smells Amazing! Like creamy coconuts.. makes you tempted to taste it! Lol!\n\nCONS:\n- Non pore minimizing.. I didn't notice any difference in my overall textures in my skin(besides dry patches)\n- Oily skin? It provides great hydration but no properties of keeping your oiliness at bay.. I love using this with a powder foundation and setting spray!\n- Don't put too much!! You're makeup will be slippin' and slidin' everywhere!…read more"
   },
   "TiaMiracle":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"14 Apr 2017",
      "title":"For dry skin",
      "description":"I've been wanting to try this product for awhile since I hear so much about it, but it didn't work for me. I have combination/oily skin and it made me extra oily and it stinks. People say it smells like coconut but it doesn't to me, it is moisturizing for people that have dry skin. I'm glad I purchased the mini size first."
   },
   "margottt":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"4 Aug 2016",
      "title":"I have very oily but very dull/dehydrated skin, but this primer hydrates my skin and plumps it up to make it look brighter and more alive without increasing oiliness or causing breakouts, which is a miracle in my book, and it gives my foundation a \"fresher\" more natural look. It even smells amazing - like sipping from a young coconut on a white sand beach. It's a thinner consistency so it doesn't feel heavy or goopy on your skin which is a blessing especially in the summer heat. I use it every single day.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
      "description":""
   },
   "shooshieushoosh":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"18 Oct 2016",
      "title":"amazing",
      "description":"This is my third tube of this stuff. I love the way it looks and feels. Especially helpful for older folks whose skin has started to become more dry. Proves much needed moister."
   },
   "azelc":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"4 stars",
      "date":"16 Sep 2017",
      "title":"eh so so",
      "description":"I love it but I hate the smell"
   },
   "mesmith322":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"5 stars",
      "date":"6 May 2015",
      "title":"A Very Different Primer",
      "description":"I've never really felt that primers were all that necessary. I would buy them and then forget to use them most days. However, I just love this one! I can't say for sure that it makes my foundation last a whole lot longer than it would otherwise as I am using a new foundation as well, but I just find this primer to be so nice to apply and it absorbs very quickly. My new foundation is rather sheer and applies much better over this primer than ones with silicone. This primer is worth a try if for no other reason than to enjoy the smell and light feel of the coconut water.…read more"
   },
   "Paka078":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Aug 2016",
      "title":"great!",
      "description":"Love the ingredients, love the light texture but makes makeup last all day! I like that I don't need too much moisturizer under it cause it is so hydrating and slick but long lasting."
   },
   "laurenllove":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 May 2015",
      "title":"best!!",
      "description":"I have tried sooo many different primers. Nothing seemed to work on my dry spots. This primer is amazing. Its very moisturizing with great staying power. Makes my skin feel luxurious. I am addicted."
   },
   "Reesie26":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"9 Sep 2017",
      "title":"Dry Skin Savior",
      "description":"I love this primer. It's extremely, lavishly moisturizing while somehow not being greasy. Sinks into my skin almost instantly, and my makeup applies beautifully over the top of this. I wouldn't recommend this underneath tinted moisturizer, because it gave me a look that was too dewy. But then, ask me in the winter when my skin is a desert. Might be a perfect combo at that time! If you have dry skin, you need this primer!…read more"
   },
   "Jamie19":{ 
      "extra_info":"<b>Eye Color</b> Blue",
      "stars":"2 stars",
      "date":"6 Jan 2018",
      "title":"At first I liked it especially the smell but it started to peel off my face :(",
      "description":""
   },
   "Pimanee":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"26 Sep 2016",
      "title":"Pointless",
      "description":"This doesn't smooth or brighten or make the skin dewy. Really all it does is add a bit of moisture, but why spend the cash on an expensive primer when you can use the moisturizer you already have and get the same results?"
   },
   "JCarrera93":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"12 Dec 2014",
      "title":"very good",
      "description":"At first I was skeptical... A moisturizing primer with no silicone? I was afraid it would make me look oily, since I already have to blot once throughout the day. But quite the contrary! I never get oily with this primer, because the silicone was the culprit all along. It feels great, keeps my makeup on and moisturizes. Love the smell. But if you have a problem with large pores this may not be for you. The pores on my nose are slightly larger than the rest of my face, but this primer does tighten them for me. Recommend for skin with small-medium pores, or dry skin.…read more"
   },
   "floette":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"2 stars",
      "date":"7 Oct 2015",
      "title":"wish it worked!",
      "description":"i was super excited to try this product. my skin is sensitive and dry, so i thought coconut water sounded great for my skin! well, maybe it is, but this primer certainly isn't. i liked the texture, although it was a little hard to spread, and the scent was very nice. however, this broke me out... everywhere. i've never had acne on my cheeks and now i have tons of it. im still fighting to get rid of it, so this product was a huge regret for me. :( (it also takes a long time to dry- if you don't wait long enough, it rolls up your foundation)…read more"
   },
   "kayylanguyen":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"23 Nov 2016",
      "title":"holy grail primer!!",
      "description":"When I first tried this primer, I didn't like it at all, but then I started to use a semi matte foundation and paired it with this primer and it was amazing!! I use the porefessional in my smile lines and pore areas; the hangover primer everywhere else! It made my makeup last so much longer!"
   },
   "Junkrat":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"13 Mar 2017",
      "title":"Goes bad too fast",
      "description":"I was totally loving this product, until one day my foundation was just melting off my face. I went to Sephora to purchase a new primer and the Too Faced rep actually happened to be there, so I asked her what happened. According to her, this product spoils after three months. I had at least 3/4ths of the tube left! So much of the product was just wasted, not worth the money."
   },
   "hberrie":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"26 May 2015",
      "title":"perfect",
      "description":"finally a primer that does not feel waxy - i love this product - i also have sensitive skin and don't like to wear too much makeup - perfect with a little bit of shimmer powder"
   },
   "airwrecka":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"1 Dec 2016",
      "title":"Made it last even for my oily nose",
      "description":"This primer has kinda of a runny lotion-y feel to it. First time I tried it, I used the L'Oreal Infallible Matte foundation & usually, foundation would come off around my nose but with this primer, it stayed in for a 7 maybe 8 hours."
   },
   "amandabegonia":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"7 Dec 2016",
      "title":"Not for me.",
      "description":"I really wanted to like this primer because everyone seems to go crazy for it. Unfortunately, I didn't find that it made my skin look that much better and it makes my skin get waaaaaay oilier than it normally would throughout the day. I have combination/dehydrated skin. I feel like this would only really work for super dry skin or if you don't need your makeup to last all day."
   },
   "MalissaT":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"19 Oct 2016",
      "title":"Didn't help with my dry patches, it made them worse.  Plus it broke me out.  Used it for for a couple weeks to make sure this was what was causing the break outs and it was.  Stopped using it and my skin cleared up.",
      "description":""
   },
   "Dallasgirl88":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"7 Apr 2017",
      "title":"Perfect for sensitive and acne-prone skin!",
      "description":"This primer is one of the best primers I have ever used and it smells amazing too! It doesn't break me out and it hydrates my face like no other primer. It's the perfect consistency, not siliconey or greasy. I've tried the Hourglass Mineral Veil primer, Make Up Forever Step 1 primer and the Smash Box primer but this if by far my favorite. Already onto my second bottle!!! It's a MUST HAVE!!!!!!"
   },
   "mee90":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"23 Aug 2014",
      "title":"Love!",
      "description":"Love this. I've never been a fan of popular silicone primers like smashbox or baby skin. I've never found a primer worth using. This is different. My skin is oily and acne prone and sensitive to products. This goes on smooth like a lightweight moisturizer. Within a minute it is soaked in my skin and I can continue with my makeup routine! You don't have to wait a few minutes for the primer to soak in like with other primers I've used in he past. I've been using this a few weeks and no breakouts from it. I work 12 hour shifts and I have noticed that my makeup looks better at the end of the day than when I don't use a primer ( which I usually don't ). Lastly- like others have said, it's a decent size! I was expecting a smaller bottle but it's quite big! I also love that it has a pump!!…read more"
   },
   "MinervaT":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"14 May 2016",
      "title":"YES",
      "description":"I will never use another primer ever again! I went to a Bernie Sanders Rally in 90 degree weather and waited for 8 hours in the sun and my makeup didn't move one bit! I'm so in love with this product HIGHLY RECOMMEND!"
   },
   "aalambert":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"25 Feb 2015",
      "title":"Really tried to like this...",
      "description":"I really like the way this primer made my face LOOK. It seemed to brighten my face and I liked the finish, it was dewy without looking oily. But, I did not like the way this made my face FEEL. Although the formula is lightweight, my face burned and tingled all day and itched like crazy on my jawline, which leads me to think I just had an allergic reaction. I also did not care for the smell, but that went away pretty quickly.\n\nOverall, this is a great product, my skin just didn't like it. I had to return.…read more"
   },
   "rawrlizj":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Jun 2017",
      "title":"game changer!",
      "description":"I have extremely dry skin but I mostly use one drop under my dry under eyes and it makes my concealer look so smooth and soft even after powder! <3"
   },
   "LunaHeart13":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"22 Jun 2016",
      "title":"First and Only",
      "description":"When I started wearing foundation I tried this. I fell in love with it immediately. I love how it gets a little tacky because I feel it makes the foundation stick to me a little more. And when I started using the Born This Way foundation I started to live it even more. I can't get enough of it. I LIVE FOR THIS PRIMER!!!!!!! LOVE LOVE LOVE IT!!!!!!!!!"
   },
   "cereus":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"3 Sep 2014",
      "title":"the primer of all primers",
      "description":"So this stuff is amazing. I had used primers for a while a couple of years back, but I stopped using them because of the gross silicone residue they would always leave behind on my skin. Recently, I was given Benefit's Porefessional as a birthday gift, but once I discovered this I immediately switched.\n\nIt's lightweight, smells divine, and goes on super smoothly; not to mention it absorbs into my skin really quickly too. I find that I don't really need to use a moisturizer prior to using this and it really does what it says and locks down makeup. I live in Hawaii and it's been really hot and humid lately, but with this primer my makeup doesn't budge at all. I've been using it for a few weeks now and I really found that my skin has gotten brighter. This stuff is insane, honestly, I don't even know what Too Faced did, but they really have outdone themselves this time. I would recommend this product to anyone and I think everyone should try it!…read more"
   },
   "ddlucic":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"23 Jun 2017",
      "title":"Good at first, then the peeling started.",
      "description":"When I first put on this primer, it was great, moisturizing, and made my skin feel soft. Then I put my foundation on and let it dry, and all of a sudden it started peeling and balling up like crazy. It completely ruined my makeup look.  I love too faced products, in facts, too faced is my favorite brand, but this one could've been a lot better."
   },
   "EllePalao":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"1 Nov 2017",
      "title":"this is a must have!!!",
      "description":"Omg! I completely recommend this primer! It feels so good when put on face. It’s smooth and drys Nicely. It’s now part of my everyday makeup routine. This is my new fav primer!!"
   },
   "SamanthaDksls":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"3 Jan 2017",
      "title":"The Only Primer That Works for Dry Skin",
      "description":"I suffer from sensitive combination skin that is severely dry during the winter months. I went into my local Sephora in search of a foundation that would make my skin look less dry and flakey, but the Sephora associate told me that my real problem was my primer. She recommended this primer, gave me a sample, and not even a week later I returned to the store to buy the full size. This primer is lightweight and moisturizing, smells great, and holds my makeup all day long without clinging to my dry spots or making me look dried out!…read more"
   },
   "lkb427":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"8 Aug 2014",
      "title":"Best primer - I wouldn't use another",
      "description":"I've had a hard time finding a primer that doesn't make my face feel oily and greasy and that doesn't break me out. This primer is amazing! I'm so glad I happened to be at the store when there was a too faced promotion going on for a bunch of their new products including this primer. It goes on so smoothly and is not greasy in the least bit. It smells great and has great stuff in it (probiotics?! Crazy but it's awesome!). I normally get extremely oily as the day goes on and this stuff makes a huge and very noticeable difference with that issue. It makes my makeup stay wonderfully all day long and has not irritated my skin at all. If you are looking for a great primer you need to try this!…read more"
   },
   "honeyb34":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"14 Jul 2018",
      "title":"Not a fan this primer does not help to make my makeup last. Very disappointing.",
      "description":""
   },
   "fallingtheresas":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"17 Jun 2016",
      "title":"Great primer",
      "description":"I really like this primer, it's very light and doesn't clog my pores or feel sticky. It literally feels like it is priming my skin, in the full sense of the word. It also doesn't make me break out which I have noticed other primers do. Provides really nice, lightweight moisturizing, absorbs into skin nicely. However, I don't know if it's \"replenishing\". I can DEFINITELY tell the difference when I don't wear it but I don't feel like it does all it is hyped up to do. Don't get me wrong I really love this product, just don't expect it to do everything it says it does.…read more"
   },
   "nancyxh94":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"1 Dec 2016",
      "title":"made me break out",
      "description":"when i first tried it, i got it as a sample first before i bought it and I instantly fell in love! i sure did see my skin brighten and look more refreshed and i also had a healthy glow to it. However, after taking into consideration and buying this product, in just a few uses i noticed it did not give me the same affect it did the first time anymore. I have oily and sometimes dry skin btw. This actually started to break me out really bad that i ended up returning it! I would not buy if you are acne-prone, oily, or have sensitive skin!…read more"
   },
   "goldhunter":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"1 star",
      "date":"22 Sep 2014",
      "title":"Not a primer. Just a Moisturizer",
      "description":"I love TF but this is sub par for them. It is a moisturizer, not a primer. It does seem to hold your makeup in place longer than nothing at all but it does NOT fill in lines. It does NOT fill in any pores. My skin felt moisturized but that was all. I know this has no silicone in it...but they need to tell it for what it is. It is not a primer."
   },
   "momoftwo89":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"15 Feb 2017",
      "title":"never again",
      "description":"This made me break out like crazy. It took me two weeks to repair the damage"
   },
   "ehanvik34":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"22 Sep 2015",
      "title":"A bit confused...",
      "description":"I really wanted to love this primer. I have pretty dry skin, and I thought this would be exactly what I needed. I have tried it many times, and no matter what foundation or bb cream I use, this always makes the foundation ball up. I have tried literally at least 5 different types of foundations/bb creams and it has happened with every single one. I love this product, it smells so good and does a nice job of moisturizing, but I just don't know why this is making my foundation ball up.…read more"
   },
   "cassie89":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"6 Jan 2015",
      "title":"best primer",
      "description":"this is hands down the best primer i have ever used. i have combination sensitive skin so it can get dry randomly. other primers always make me flake and this one didn't! its so smooth without having silicone and hydrating but never oily. it doesn't make me break out and it really makes makeup go on so nice and smooth. i love the coconuty smell and like that it is skin healthy. i use to never use a primer because nothing would ever work with my skin even with using moisturizer. i love this stuff and highly recommend it. oh and it'll last a long time. maybe the only thing i would change would be to make the bottle right side up not down.…read more"
   },
   "sheira18beauty":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"3 Jun 2015",
      "title":"I love this primer it smells so good! I use it on a daily basis for my naturals look i even wear it alone it is great.",
      "description":""
   },
   "amyea":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"7 Nov 2017",
      "title":"my ride or die",
      "description":"Definitely my favorite primer, hands down.  I hate silicone-based primers.  I love how this one is so hydrating and smells nice.  It doesn't do much (noticeably) for pore size, but I'm still obsessed."
   },
   "jakari60":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"12 Dec 2014",
      "title":"LUV♥LUV♥LUV",
      "description":"I have tried just about every primer out there from drug store to high end and to me this is the best. The only downfall is the amount of product as I go through a tube a month! If your on the fence jump over you won't be disappointed."
   },
   "EllieKay":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"5 Apr 2015",
      "title":"great, but...",
      "description":"This is a great moisturizer that smells divine. Very tropical and coconutty. But this does not serve as a primer for me. It does nothing to smooth my skin or hide pores, but again it doesn't claim to. It is very nice and hydrating. If your skin needs more TLC then this might not be for you"
   },
   "Riahbabe":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"4 stars",
      "date":"10 Sep 2017",
      "title":"Great Primer, But Can We Just Talk About The SMELL",
      "description":"Aright, so in general this is a good product. Kept my foundation on all day, and it never became spotty or patchy. BUT the one thing that HONESTLY is keeping me from repurchasing it.. is the god awful SMELL. Every single time I get a whiff of it, I think i'm smelling my cats litter box. It makes it so difficult to even want to put on my face. Given that the smell doesn't linger after the foundation is applied, I genuinely just feel like if the smell was improved this could be a million times better."
   },
   "soniaboyer":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"18 Jun 2016",
      "title":"Perfect Primer",
      "description":"Makes the perfect canvas for foundation. Especially useful for people with dry-skin. Doesn't feel oily."
   },
   "Sarahmainer14":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Aug 2016",
      "title":"By far my favorite primer. You need to use it on naked skin and wait for it to dry in order for it not to clump up.  It is so hydrating you don't even have to use moisturizer with it it also smells really nice not like chemicals I use it every day",
      "description":""
   },
   "snooozzzze":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"7 Jan 2017",
      "title":"I honestly don't know how I even did my makeup before I had this product. I have extreme combination skin (forehead is crazy oily, but the rest of my face is so dry it flakes up). This primer is able to moisturize my face enough so that everything goes on flawless, but it doesn't make my t-zone more oily, and for that I love it!! Plus it smells likes coconuts, I'm in love!",
      "description":""
   },
   "spaceangel":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"10 Jan 2018",
      "title":"Broke me out!! The scent is strong so I guess it’s not for sensitive skin.",
      "description":""
   },
   "Nperks":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"12 Mar 2015",
      "title":"Changed My Skin!!!",
      "description":"I had trouble with dry patches, so I couldn't even wear tinted moisturizer, now with this primer I can wear any foundation I have even though it is still winter. This product is a game changer. It feels amazing and does amazing things for your skin! Definitely worth the money."
   },
   "craycray":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"4 stars",
      "date":"1 Mar 2015",
      "title":"Feels like silk, Smells like heaven.",
      "description":"Here is the thing...I was a little skeptical of this stuff, only because I did not know if it would be one of those things where it can not decide if it is a primer or a moisturizer. Well, in my humble opinion it is a moisturizer. With that said, I do not notice that it is a awesome primer but then again I have never looked in the mirror and said \"I have never looked more primed\" with any of my primers so I might not be the expert you need in that arena.\nThe product itself is light, non greasy and absorbs into the skin with ease. My skin feels soft and wonderful, I use mainly during the day but have been known to mix it with my night cream because it is so soft. I can not get away without mentioning the smell, oh my goodness, the smell. It has a distinct non overpowering coconut scent that I personally love. If you do not like the smelly then this is not for you. I know it claims to do all sorts of magical things and maybe it does and maybe it doesn't but all I know is, is that I love it. One thing...The tube/pump thing. I don't like that. Either be a tube or be a pump. So check it out, it may not change your life but it will make it more happy."
   },
   "DP68":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"31 Dec 2014",
      "title":"Love!",
      "description":"This has a scent of coconuts and it is really moisturizing. I wouldn't recommended it for oily skin, I really love this! I will repurchase this once I run out."
   },
   "Valeria22":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"24 Oct 2014",
      "title":"Best Primer !",
      "description":"My skin is very dry so I decided to give this a shot since it is so moisturizing. And I do not regret it, it hydrates my skin, it smells nice and at the end of the day my makeup looks perfect. It's the first primer that I feel that really helps with the longevity of my makeup."
   },
   "jennifer918":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"17 Jan 2016",
      "title":"Love this",
      "description":"I have somewhat oily skin and I still love this stuff. I'm not sure if it gives my makeup the staying powder of a silicone based primer - however it does make my skin look and feel great. Even without makeup it seems to improve my complexion - this has become a part of my every day skincare routine. Not sure I'll be able to use something like this in the summer, but until them I am going to keep on enjoying it"
   },
   "babybellla":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"3 Dec 2014",
      "title":"So I decided to try this primer on a whim after seeing a picture of it on the Too Faced Instagram, and I am SO GLAD I DID. It's my new all-time favorite primer, and I've tried ALLLLL of them.\n\nTo begin with, I love that it's silicone-free, as I find silicone-heavy primers to be kind of creepy feeling, and they also sometimes change the texture of the makeup that goes over them. This one is super smooth and lightweight, but still smooths out my skin, and creates a perfect base for any of my foundations. I also like the fact that it doesn't have SPF, making it useful for flash photography. The texture is very light, similar to Laura Mercier moisturizing primer, but I find this does more for my skin as far as actual moisturizing than the Laura Mercier one does. It smells like coconut water, which I don't mind, though if you're sensitive to smells, you might consider a sample first to see if it will bother you. The tube/pump system works well, and so far, it's been easier to travel with than a glass bottle.\n\nI apply my actual moisturizer, wait for it to dry while drying my hair, then apply this primer. I let the primer dry while straightening or curling my hair, then apply my makeup. I do find a few minutes of wait time between applying different products is important, and this primer dries down quickly, allowing makeup to go on evenly, and without pilling or tugging. I've used it with a variety of liquid foundations, and it works well with all of them. Particularly, it makes Armani Luminous Silk look AMAZING. My skin seems to stay moisturized moreso with this than any other \"moisturizing\" primer, and I would def. re-purchase this. Price is on the lower end of the high-end primer spectrum, so that's nice..",
      "description":""
   },
   "betsybabe":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"23 Aug 2014",
      "title":"Everyone has given this 5 stars!",
      "description":"If you aren't into silicone primers than this is your must buy, it's good for your skin! Amazing!"
   },
   "makeupwish":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"2 Aug 2016",
      "title":"Fave Primer",
      "description":"I've tried quite a few primers and this one is by far the best. Many of the primers I've used haven't done much (or anything) for my skin. This primer, however, makes my skin feel much smoother and more hydrated. I absolutely recommend it for people with dry skin. I also love the coconut scent. I was a little apprehensive buying this product at first after reading about how it made some people break out (I have sensitive skin), but I haven't had any bad reaction to it."
   },
   "bookluvr23":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"1 Sep 2014",
      "title":"Best I've ever used!",
      "description":"I wanted to try this stuff after seeing it had so many good reviews but I was worried that since I have oily acne prone skin it would mess up my skin. I was way wrong! This stuff is amazing! It smells so nice and it keeps my make up put all day and since I get really dry in some places it makes my make up uncomfortable. This stuff eliminates that problem. I even started using it before bed and it's helped with my breakouts! I don't know what those people at too faced did but this stuff is going to be a staple in my make up routine from now on!"
   },
   "elvsbeauty":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"18 Jan 2017",
      "title":"I live for this",
      "description":"I love this product, I have very oily skin and this product goes very well with the cerave moisturizer. I pair these two together and I can go throughout the day without reapplying any powder."
   },
   "sassyspence":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"16 Sep 2017",
      "title":"I NO LIKEY THIS PRIMER",
      "description":"I got this as a free sample before I splurged on it and I'm so glad I didn't buy it!! I have combination skin, and I am not being dramatic when I say this stuff is so freaking oily, and it literally made my makeup look and feel SO blotchy. My foundation broke up badly all over my face. This product is definitely not for me. I'm searching for a primer that actually does what it says, so far no luck :("
   },
   "cynthiap16":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"15 Mar 2016",
      "title":"breaks me out",
      "description":"I really want to love this primer since it is one of the only \"good ones\" out there... It doesn't have that silicone feel to it and you can still feel like your skin is breathing with it on compared to other heavy duty primers. But, for 40$ you can buy yourself a much better quality moisturizer or face cream that will do the same job or better. I have more combo to oily skin which is quite prone to break outs and everytime I put this on... I get a HUGE BREAKOUT! I really wish this primer worked for me but unfortunately it doesn't. It would probably be great for dry skin"
   },
   "Delphined":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"26 Feb 2015",
      "title":"Love the product, hate the smell",
      "description":"Finally a primer I like! It feels really nice on the skin and make any foundation looks even nicer. The only thing I dislike about this product is the smell but I can work past that and it doesn't linger too long on the skin."
   },
   "xkatherineannex":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"15 Dec 2016",
      "title":"Worst primer I have used...",
      "description":"Not only did this primer cause horrible breakouts, it caused my concealer and foundation to pill up, and created the weirdest texture on my skin.  Really did a number on my skin, would definitely not recommend."
   },
   "Sunbum17":{ 
      "extra_info":"<b>Eye Color</b> Green",
      "stars":"1 star",
      "date":"22 Aug 2018",
      "title":"Pass on the Hangover",
      "description":"I would not use the word \"primer\" to describe this cream. It is more or less just a lotion. It does not have a matte finish and not good to apply powder on top. That aside, the smell is awful."
   },
   "Ickybella":{ 
      "extra_info":"<b>Skin Tone</b> Fair",
      "stars":"1 star",
      "date":"10 Nov 2015",
      "title":"Not for combination skin",
      "description":"I bought this primer when I ordered Born This Way, because they're supposed to be amazing together. I didn't like them together at all. The foundation kept sliding off my face. I tried it with Tarte Amazonian clay foundation as well, and the same thing happened. It also puts the pores in the cheek/nose area on display for the world to see. I have combination skin that is dry on my cheeks and forehead and oily on my nose. My nose becomes incredibly oily with this primer, andt the makeup on it becomes splotchy."
   },
   "MomoNeko":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"1 star",
      "date":"17 Jun 2015",
      "title":"More like a moisturizer.",
      "description":"Maybe I used it wrong...but this didn't do anything for my face other than making it feel oily and greasy. It seemed to separate my foundation (100% pure) so I had all these patches especially around my nose and the foundation would just not set. This was a no-go for me."
   },
   "katsreader":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"5 stars",
      "date":"1 Nov 2017",
      "title":"Makes my foundation flawless!",
      "description":"I love Too Faced Hangover Replenishing Face Primer! It goes on like a lotion, which I love and soothes my sensitive skin. Unlike with most of the silicone based primers, my foundation goes on looking natural and smooth and stays all day. I love the smell too!"
   },
   "kyc051":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"24 Jan 2015",
      "title":"This primer....omg",
      "description":"This was crafted by the skin gods. Seriously.\nI'm oily and i can still use this without being greasy. It's so hydrating, and it really does help your skin! I noticed a difference after a week of use! And now that I use it regularly it has seriously helped with the condition of my skin. I HIGHLY RECOMMEND IT. It has a light coconut scent which I love, but if you don't it's not over powering or anything. It's just amazing. Go buy it, it's totally worth the money."
   },
   "AeM816":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"18 Jan 2015",
      "title":"My new go-to primer",
      "description":"I'm a huge Too Faced fan, as far as their skin products go. I'm obsessed with their bronzers and mascara and used to use the Primed and Poreless primer. Then this came out. Hangover Rx is SO lightweight and moisturizing, a little goes a long way. It really evens out the tone of my skin so I feel like I'm glowing before I even put on any of my makeup. For just a dewy finish for running errands you could use this by itself. It smells great and has coconut water, which is GREAT for your skin. Compared to their other primers this is much thinner formula, I feel like it is more breathable and agree with others who say it is like a moisturizer instead of a primer....but I feel it does server its purpose as a primer. A little expensive for the size but it is high quality."
   },
   "celesteh":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"19 Feb 2017",
      "title":"amazing",
      "description":"Not one to write reviews but this stuff is incredible. It smells so good, hydrates my skin without feeling silicony like most primers, does get tacky in a few seconds but I take that as a good thing so my foundation can stick the primer to not come off and it really does last me all day. Bought the little size but will definatly buy the full size."
   },
   "PatriciaSardo":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"30 Jan 2017",
      "title":"Way better than I thought",
      "description":"A wile back, i received a sample of this and threw it in the back of my makeup drawer as soon as i read \"dewy and hydrates\". I have oily skin so normally that would not appeal to me. Recently, my skin has been very dry from the harsh winter and i decided to give this a try. Boy was I  impressed. Not only is this soothing and hydrating, it brought my skin back to life. Im not oily like i thought i would be and dewy looks dont scare me anymore. I actually prefer it over the matte look i am always trying to achieve. For the record, I have oily skin normally and have only tried this under Make Up For Ever Foundation Stick. My make up has lasted longer, it looks glowing and I have gotten lots of compliments. In Love!!"
   },
   "katte9206":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"9 Apr 2017",
      "title":"Terrible",
      "description":"This is one of the worst primers I have ever tried. It goes on easily but 'pills' as soon as I start to put makeup on. It is a complete wast of money and is going back."
   },
   "SarahSmiles89":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"22 Aug 2014",
      "title":"Amazing!",
      "description":"Just a quick recap of my skin: I'm one of those 25 year olds struggling with acne, acne scars, discolouration, all that jazz. So I'm constantly on the search for a product that will keep my makeup in place and not slide off by mid-day. I think I've finally found it in this product! Usually by mid morning my skin feels slick from oil and my makeup suffers, using this my makeup stayed in place and my skin never looked better! I definitely recommend it! It goes on easily, smells wonderful and improves how your skin looks. I can already feel some of my confidence that acne destroyed returning. What a wonderful product!!"
   },
   "HeatherTims":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"5 May 2015",
      "title":"My new HG primer",
      "description":"I love the way this primer glides on my skin, its very refreshing and soothing. It lays perfectly on top of any moisturizer, and leave a slight tacky feeling that helps my foundation grab into it. By far my fav. primer to use."
   },
   "katebenoit":{ 
      "extra_info":"<b>Eye Color</b> Green",
      "stars":"1 star",
      "date":"18 Oct 2018",
      "title":"Tried multiple samples of this product. I’ve never been impressed. It is definitely not a ‘primer’ but even thinking of it as more of a lotion, I do not see any changes in the texture of my skin.",
      "description":""
   },
   "nikkidip91":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"19 Nov 2017",
      "title":"Weird smell",
      "description":"I was not a huge fan of this. It's one of those sticky primers that I honestly can't stand. If you like your primers to have that tacky feeling, you might like it. \nBut, to top it off it smelled kind of bad. It has that \"expired product\" smell, but as soon as you open the tube. It's a no for me."
   },
   "Jleo7":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"19 Nov 2016",
      "title":"Skin looks great, makeup stays on a bit better",
      "description":"I purchased this hoping that my skin would end up brighter and and more moisturized, while keeping my makeup on for a full day of work. I would say this product met many of my objectives. I have very dry skin that is rather sensitive. I am not particularly acne prone, but have definitely had break outs when using the wrong products. \r\nSince purchasing this product, my skin looks less dull and more even toned. I haven't had any breakouts and my face feels less dry and irritated. \r\nIt makes my makeup go on smoother, but I am not sure that it makes it have longer \"staying power\".\r\nOverall, I would recommend this product if you want something gentle and wear more natural makeup, rather than a full face."
   },
   "odasl":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"19 Aug 2017",
      "title":"Love this stuff",
      "description":"Really wasn't sure I was going to even like this one but heard great things.  I absolutely love it.  Moisturizing, holds my makeup very well throughout the day and doesn't break me out.  Plus the scent is lovely."
   },
   "v0ltagekid":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"23 Feb 2015",
      "title":"The scent was not my favorite",
      "description":"This primer did a good job hydrating my face, but I couldn't stand the scent, it was like chemical/fruity. Not for me."
   },
   "musicinmyhe":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"20 Oct 2018",
      "title":"Makeup slides right off my face!",
      "description":"My makeup slides right off of my face. It does minimize pores but the moment I put on glasses or even touch my face my makeup moves. So glad I got a sample of this instead of spending my hard earned money on this crap."
   },
   "ceciliabuck":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"13 Sep 2014",
      "title":"Love !",
      "description":"I've tried many primers to help manage my combination skin. I bought this based on reviews & how dry my skin gets as the colder months come in. I love it! It smells so good! It comes out like a moisturizer, but when you apply it it feels like a primer! My favorite primer ever! Brightens and keeps makeup on all day without getting oily."
   },
   "okate115":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"21 Feb 2017",
      "title":"AMAZING!!!",
      "description":"I'm trying to let my skin clear right now and wanted something very light weight. I've heard so many good things about this primer and has tried it once before from a sample. I'Ve been using it for 2 days and I'm in love with it. It feels so nice and hydrating going on and I'm noticing my makeup stays longer and goes on more smoothly. It also smells like coconut (its infused with coconut water) overall amazing primer that wont clog your pores!!! (I have combination skin)."
   },
   "alexandracv":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"3 Oct 2016",
      "title":"Nothing Fantastic",
      "description":"I have oily/combo skin and got this product as a 100 point beauty reward. I found that it took a long time to absorb into my skin before I could apply my foundation (it was sticky). My foundation applied a bit splochy and I don't feel it enhanced the apperance of my skin with the foundation on. Because I have oily/combo skin, by the end of the work date my make-up was melting off and I looked oily. I gave three stars because I think people with dry skin would have a much better experience"
   },
   "badgalriah":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"5 stars",
      "date":"2 Mar 2017",
      "title":"Holy grail!",
      "description":"I have combo dehydrated kinda oily skin so it gives me that hydration I need without it being greasy or heavy. This saved me in the winter times & I'm really obsessed with the coconut scent being an island girl & all lol. I'm almost out of this so I'll definitely repurchase again."
   },
   "fitnessmodel":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"26 Mar 2016",
      "title":"Decent",
      "description":"Finally a primer that has no silicones, I believe primers with silicone or dimethicone makes skin too oily."
   },
   "Suyena":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"13 Dec 2015",
      "title":"Great for acne prone, combination skin",
      "description":"It does what it's supposed to: it hydrates your skin and preps it for dewy looking makeup like a heavy night cream would but with the added benefit of being as light as a day cream. I wear mine under sunscreen and it does a great job of holding my foundation in place. 4 stars only because I expected it to hold like silicone-added primers. This is a great substitute and the coconut water is super mild on acne-prone skin that is easily irritated by silicone and other chemicals. Will repurchase again, and soon; after 5 months of daily use my bottle is running dry."
   },
   "Tidewoddergirl":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"4 stars",
      "date":"20 Jun 2016",
      "title":"Smells great, light, feels wonderful!",
      "description":"The only drawback is that, I don't get a good \"primer\" feel from it. I use it as a stand alone \"shield?\" Could that be the right word. It acts as kind of a moisturizer and protector from the environment (except sun) when I am \"makeupless\". It does smell coconut, so if you read the description and think, \"Oh, well how coconut can it be?\" Think light coconut water, not Coco Loco."
   },
   "Sharsai":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"19 Jan 2016",
      "title":"Love it!",
      "description":"I have really dry skin especially around the colder months, so I searched high and low for a primer to wear under my foundation that wouldn't emphasize my dry patches, and this baby did the job. I've tried it with several foundations Nars All Day... and MUFE Ultra HD to name a few and it worked great with each of them. Very lightweight and product goes a long way. Very happy with this primer."
   },
   "bjayd":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"13 Nov 2016",
      "title":"perfect!",
      "description":"i went from using the make up forever 1 step hydrating primer, which i hate because it made my make up blotchy and greasy, to this and i love it!! i have super dry skin and this primer hydrates and gives me the perfect base for a beat face. totally recommend!"
   },
   "BlondeBabe12":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"14 Apr 2015",
      "title":"Very Moisturizing",
      "description":"I love Too Faced products, and when I saw this primer in Sephora I purchased it right away. The name is super cute, and I personally love the smell of the product (like floral coconuts? The scent is hard to describe haha). This product is very moisturizing, however, it doesn't act like a primer for your foundation. As well, I suggest waiting 5 or 10 minutes after using Hangover before putting on foundation. Otherwise, your foundation will slip all over the place and look splotchy. If you have dry skin like me, this is a good product for you. But if you are looking for a legitimate primer I would pass on this product!"
   },
   "aklm23":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"23 Aug 2015",
      "title":"I got a mini of this in the Too Faced \"Most Loved\" set. It smells amazing! and the texture is very light. My skin does feel moisturized after I apply it. If your skin is dry and needs a little extra 'pick-me-up', then this would be great for you. I didn't notice any 'smoothing' or 'brightening' effect on my skin. I don't think this product is all that special. If you have the $40 to spend on it then more power to you but I believe there's a chance you could get something comparable for cheaper, or something better for the same price.",
      "description":""
   },
   "puglover05":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"22 Sep 2014",
      "title":"wanted to love",
      "description":"I really liked this primer when I first put it on. Felt nice and gave a nice glow. However once I added foundation my makeup looked like I hadn't even used primer. It caused it to look cakey and flake. I know most want a primer to absorb in the skin, but you at least want to feel like you have something on to help your foundation. Was really hoping this would be my new go to but will be returning."
   },
   "shannon65":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"18 Oct 2016",
      "title":"So hydrating",
      "description":"Love this primer. I have sensitive skin too and no problems with this. Light coconut scent too, reminds me of being on vacation. Also keeps my foundation stay put and last longer."
   },
   "boogersmomma":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"18 Jan 2015",
      "title":"This stuff is great!",
      "description":"Way better than the silicone primers IMO. Feels great, virtually no smell and makes my skin actually look better without makeup. It takes out redness and makes my skin look smoother all on its own. Good stuff!"
   },
   "SkyeL":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"2 Sep 2016",
      "title":"favorite!",
      "description":"I have been eyeing this product for awhile, I just currently bought it after trying it out for a day. I love it, it smells great and it leaves my skin feeling smooth, I have not gotten any breakout from using this product :-) definitely worth the hype and the money!!"
   },
   "carollouise":{ 
      "extra_info":"<b>Age</b> over 54",
      "stars":"5 stars",
      "date":"27 Oct 2014",
      "title":"Skin feels like velvet",
      "description":"O.K. first of all I don't drink but I saw this product on another website talking about how you can make your skin look good even if you haven't gotten enough rest! I couldn't resist trying it. I put it on over a Origins moisturizer under my foundation and blush and I have been very pleased with the results. I am a make-up \"junkie\" and whichever foundation I have used this under has gone on very smoothly and stayed on well for me."
   },
   "Haneet":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"11 Aug 2014",
      "title":"Amazing!!",
      "description":"I was a little hesitant before purchasing this but now I refuse to leave the house without prepping my skin with this!\n\nI usually wash my face in the morning, put on sunscreen"
   },
   "godijah":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"13 Aug 2015",
      "title":"no go.",
      "description":"I don't ever write reviews. This is actually my first review ever. But this was just the most disappointing product I've ever encountered.\nThis product made me break out like never before. It was so bad that I didn't even want to go out in public because of the acne it blessed upon my face.\nAfter I stopped using it and switched back to my other primer (cover fx), my acne subsided. Will never use this product ever again. Was so disappointed. I wish I could give it zero stars."
   },
   "tina905":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"22 Jul 2017",
      "title":"Dry Skin must have",
      "description":"In the winter I have dry & flaky skin and in the summer it becomes normal. \r\n\r\nI absolutetly LOVE this primer as it also makes my face feel very moisturized and love the smell. I will keep repurchasing! :)"
   },
   "Neashie":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"2 Aug 2016",
      "title":"My New Staple Primer",
      "description":"I got a sample of this in an Ipsy package one day. Instead of trying it out I tossed it in a pile with my other samples. Months later I was in need of a primer and found this gem. Let's just say I'm kicking myself for not try if it sooner! This primer TRULY improves your skin. I live in incredibly dry Arizona and this primer gives me a boost of moisture and makes my skin look radiant. On top of that it smells great. It wasn't long before I went to Sephora and bought a full size tube. This will definitely be a staple going forward."
   },
   "sncmtl":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"12 Apr 2016",
      "title":"Amazing.",
      "description":"My skin has REALLY improved since I started using this product. I was a bit thrown off by the texture of this primer (I expected it to be more gel-like as opposed to a liquidy cream). It's absolutely hydrating, brightening, and it's a great base for liquid foundation. Sine I started using this product the texture of my skin is different too - WAY smoother. It smells great too! \r\nI use this product over my facial moisturizers and under my foundation."
   },
   "BearsIRL":{ 
      "extra_info":"<b>Eye Color</b> Green",
      "stars":"1 star",
      "date":"31 Mar 2019",
      "title":"Foundation ‘pilling’/rolling off face :(",
      "description":"I want to like this product, and there are parts of it I do like. For instance, the texture is lovely and it doesn’t clog my pores, and foundation does sit well on it........as long as it is the ONLY THING ON YOUR FACE. Like eye cream? Like moisturizer? Like ampoules and essences? FORGET THAT IF YOU WANT TO USE THIS PRODUCT. If there is one drop of anything on your skin besides this primer I can promise that your foundation will ‘pill’ and roll off your face. I’ve tried multiple times with different routines, different foundation finishes.... and each time end up with the same result. I even re-purchased this thinking I must be crazy BUT STILL THE SAME RESULT. Avoid."
   },
   "nikita2930":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"3 Jun 2017",
      "title":"Love Love Love",
      "description":"I have oily T zone and the rest of my face is dry. I have tried a lot of face primers and none of them work. Let me tell you about this stuff. It's amazing!!! Trust me! It makes my foundation look so good and makes my skin look awake. The best stuff I have ever used. And it makes my foundation last longer then any other stuff I've used. For my oily girl. Try this it's amazing?"
   },
   "lanacoleman":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"4 Sep 2015",
      "title":"smells good, works bad",
      "description":"because i have normal to oily skin, this primer wasn't for me. it smells great, (probably due to the coconut water) but is much too thin and watery for me (again, probably due to the coconut water). after i put it on my face, my face felt extremely wet; so this primer is probably best for those with very dry skin."
   },
   "jennymaks":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"8 Nov 2015",
      "title":"It's an absolute treat being able to put this on my face. The scent is absolutely marvelous, and not only does it help moisturize and even out my skin, but it definitely makes sure my foundation doesn't cling to any dry spots. I got this as a sample, and knew after the first application I needed the full size. As well, a little goes a long way with this product!",
      "description":""
   },
   "champagnecheeks":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"17 Jul 2016",
      "title":"a dry girl's bff",
      "description":"I get so dry around/on my nose, under my lip (???) and even sometimes on my cheeks if it gets bad enough; when I decided it was time to step up my makeup game and start battling dryness, a Sephora employee introduced me to this and it was a game-changer.  It smells incredible first off from the coconut water infused in it, it goes on like a lightweight moisturizer, and INSTANTLY hydrates! it makes my foundation look great, keeps my makeup from slipping, all while making my skin feel smooth. I have sensitive skin that literally flares up if I lightly rub any kind of product on it, but this did not do that in the slightest.  It's lightweight, hydrating, smells incredible, it's everything a dry girl could ask for in a primer 11/10"
   },
   "JeSs1233":{ 
      "extra_info":"<b>Eye Color</b> Green",
      "stars":"5 stars",
      "date":"17 Apr 2018",
      "title":"BUY 2 MINIS",
      "description":"Great product! I have extremely dry sensitive eczema skin and this primer helps soothe and help with dry patches before I layer my foundation on! It helps the foundation stay in place all day! 2 mini bottles is the same amount of product and cheaper than 1 big bottle!!!"
   },
   "FaceMonster":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"3 Mar 2015",
      "title":"This is such a great product! I have *very* oily skin so I usually stay away from \"nourishing\" face primers as they tend to make my already oily skin look even worse. However, I don't know what kind of magic is in primer but not only does it make my skin feel super soft and smooth, it also controls oil like no other primer I've ever used, and that's a lot of primers. Seriously love this primer! Totally worth the money IMO! The only reason I didn't give this 5 stars is because the scent. I can't put my finger on what it smells like but there are days im not really bothered by it, and others where I am almost gagging while I'm smoothing it on my face. Thankfully the smell goes away as it sinks into the skin. Also, this never seems to be in stock in the physical store, which frustrates me greatly. But if you go in store and schedule to have it shipped to you, then you wont have to pay for shipping",
      "description":""
   },
   "KarenWAR":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"1 star",
      "date":"5 Oct 2018",
      "title":"This primer is not my friend. It goes on well, but I honestly cannot tell a difference in how my makeup looks. By the end of the day, however, my face looks all splotchy and red. Definitely not a winner for me.",
      "description":""
   },
   "Jtaylor1226":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"10 Sep 2014",
      "title":"Great for oily skin!",
      "description":"I've been on the hunt for a great primer for the longest time...I finally found one! I have really oily skin and this primer is like magic. I love the smell and it feels so hydrating when you first put it on. My makeup stays put all day with this product."
   },
   "ilovebelle":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"20 Nov 2016",
      "title":"This is my holy grail primer, it's moisturizing without being heavy or greasy and my foundation and makeup wear better on it and blend better when I have it on. It's not a specialized primer that mattifies or makes you loon poreless or gives you a glow, it's just an excellent wearing primer that hydrates and when it comes to my ride or die primer, this is it.",
      "description":""
   },
   "RunningLate":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"2 Jun 2019",
      "title":"A skincare product above and beyond a primer!!!",
      "description":"First product review I’ve  ever done but it’s also  one product that I saw instant impact. I was skeptical when the TF rep recommended it but she after applied it to one side of me face, it was obvious that side of my face looked fresher, and just...better! My mom and I couldn’t say what the difference was, only that one side looked so good. My parentheses and marionette lines filled up and literally disappeared! The side with TF Hangover looked radiant and full while the other side looked dehydrated and tired. After the rep pointed It out, she applied it to the other side and what a change. (Needless to say, I bought the Primer and Setting Spray set on the spot.) \nSince I have a pore concern, I use another primer for my nose but will use TF H/O for the rest of my face. As I use this more as a skincare product than a primer I also apply some over my makeup during the day when I need a little boost of hydration and “lift” in my no go zone (parentheses and marionette lines). \nI use the setting spray after my toner in the AM for hydration and again over my makeup. \nI would def recommend both these products but if the kit is not available, go for the Hangover primer."
   },
   "ChelsB35":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"31 Aug 2014",
      "title":"Look no further.. seriously!!!",
      "description":"I have tried primers from Smashbox, Laura Mercier, Stila, Clinique, BareMinerals, etc and THIS is the absolute best primer I have used. I am excited to put my make up on every time I use it. First, I put my primer on, wait a minute, put my foundation on (Makeup Forever HD) Blend, and in a minute my face is absolutely flawless. It's like magic. HIGHLY RECOMMEND for all skin types!!"
   },
   "jujasen":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"13 Jan 2016",
      "title":"Works like a dream for my oily skin",
      "description":"For a long time, i used primers and other products with as much mattifying effect as possible because of my extremely oily skin. However, the problem just seemed to be getting worse. Then i noticed all the hype about the Too Faced Hangover primer and though i knew it was dewy, i wanted to test it. Let me tell you, this was a great desision. Immediately my makeup looked so much more fresh and healthy, and was much less oily than ever before! I realized that the moisture this primer gives to my skin actually balances the oilproduction. Would absolutely recommend oily girls to try this!"
   },
   "Jazzy2424":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"5 Nov 2014",
      "title":"I was nervous at first to use this product because I suffer from cystic acne around the chin area and dry skin. This primer does not irritate my skin and I feel hydrated all day. Best primer ever if you have dry skin!!",
      "description":""
   },
   "qwfka":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"1 star",
      "date":"2 Jan 2016",
      "title":"Not for oily skin",
      "description":"Meh. I have super oily skin so I don't know what made me think this would work for me, but it really does nothing. I see no difference in the way my skin looks/feels with this on. Fells like a waste of money. I HATE the smell of this so much. It smells like synthetic coconuts and I am not a fan at all. It bothered me a lot at first, but I am now a bit more used to it I guess. The pump is nice to have, but a lot of product can tend to gather around the part it comes out of, and it looks yellow and gross. Overall, its an ok product, and I am going to continue to use it up, but if you have oily skin you should definitely skip this, as it has nothing to offer. I don't understand all the hype surrounding this, at least in reference to its effect on oily skin. I see no difference in my makeup when I do and do not use this product."
   },
   "Saraaaaaaaaa":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"1 star",
      "date":"29 Nov 2015",
      "title":"it doesn't do much for oily skin or pores",
      "description":"I bought this because the lady at Sephora was raving about it and since it's paraben free I thought why not. But it did not work well for my oily t-zone and visible pores and so I had to give it to someone else."
   },
   "Roseevelyn":{ 
      "extra_info":"<b>Eye Color</b> Hazel",
      "stars":"1 star",
      "date":"4 Jan 2018",
      "title":"yucky",
      "description":"if you want your foundation to look like you blended it with wet toilet paper then i highly recommend"
   },
   "Smithpr2":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"15 Aug 2016",
      "title":"From a makeup artist..",
      "description":"This makeup is sticky as others have mentioned, but it is perfect for long wear. It does not feel \"sticky\" on the skin; it is only sticky in the sense that it will hold your makeup. I have very oily skin and have literally tried probably 12-15 other primers of all brands and price ranges. They are all \"velvety\" but slide off my skin and actually make it feel more oily. This is absolutely the only one I have found that will control my oil. I use it on my clients and time after time I get feedback that they are glad they didn't spend the extra money on airbrush makeup, because this looked and stayed just as long. It somehow even reduces some of the swelling I always wake up with around my eyes. The first time I used it I didn't see immediate results with the claims of a well rested look, but apparently I just needed a few minutes because by the time I left the house, my swelling was reduced and my eyes looked so much brighter and skin was smoother. I always am trying to find cheaper alternatives and prove to my clients that you don't have to pay outrageous prices for makeup, but this primer is one beauty product I am willing to pay more for."
   },
   "Kimbyrr":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"4 Jan 2016",
      "title":"Saved my skin!",
      "description":"This primer really helped moisturize my skin! It keeps my skin hydrated and it smells amazing! I really think this primer played a big part in helping clear up my skin! I haven't used another primer since discovering this one!"
   },
   "capulette":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"26 Oct 2016",
      "title":"Beautiful",
      "description":"I have oily but dehydrated skin and this has made such a difference in how my makeup wears and looks on my skin. I use the cocoa powder foundation, which can settle into lines after 10 hour work days. This primer stops that from happening. I don't get as oily throughout the day and it feels amazing on the skin. I did not expect to love this as much as I do. It's a beautiful product. My skin is sensitive and reactive, no issues. In fact, I think it calms my skin."
   },
   "anhellica2001":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"12 Jul 2015",
      "title":"Nice primer",
      "description":"I was curious to try this and purchased without reading reviews. My skin starts dry in the am, normal a few hours later after face cream and at the end of the day is very oily with or without makeup. This leaves a smooth finish very similar to my face lotion, nice smell and is absorbed quickly. If you are looking for something that hides your pores this is not for you."
   },
   "Cece13":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"27 Mar 2017",
      "title":"awful",
      "description":"This is the worst primer I have ever tried. It completely balled up on my skin and started to come off when I put foundation on. I had to completely wash my face and start over."
   },
   "havyn":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"3 Jul 2016",
      "title":"what happened",
      "description":"I loved this primer on my dry skin and used it every single day until I noticed that my skin had crumbles and felt extremely sticky, I tested out all the products I used to see if it was my foundation primer of what, and it was this primer, I was super dissappointed and then it came to a point where I couldn't use it."
   },
   "Dmbrown27":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"2 Dec 2016",
      "title":"YAS",
      "description":"I have VERY acne prone skin. one wrong move and i'm a pizza face. i got a sample of this and knew i had to have it. just purchased the full size. i use in the am after my SK-II Facial Essence and my skin is clear of acne, glowing, dewy, and hydrated. this is more than a primer. it's skin care and moisturizer all in the same tube. a great buy!!"
   },
   "rrrachel1594":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"12 Mar 2016",
      "title":"not good",
      "description":"I bought it because I heard it was the best primer and that it was hydrating it was the complete opposite for me it made me so dry it felt like I had nothing on and it made my makeup look disgusting wouldn't recommend"
   },
   "SamanthaMMT":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"6 Jul 2015",
      "title":"Felt great, but broke me out",
      "description":"I really, REALLY wanted to love this. In the couple of years, my skin has gotten quite sensitive, and with that, quite dehydrated. I had heard so much about this primer, did my research, and was really looking forward to using it.\nWhen I first tried it on, it felt great. It was cooling and hydrating, but applying my face makeup, I didn't see anything exceptionally different in the appearance of my face makeup. As the day went on, I still didn't really see much difference in appearance/longevity of my makeup.\nAs time went on with using this primer, I began to notice that my skin was getting bumps from irritation on my face. I thought because I had been trying new skin care, that that had been the reason. Between a lot of switching back and forth, and regulating my skincare, I realized that it might be this primer.\nSo, I stopped using this primer, waited for my skin to clear up, tried again, got the irritation, then stopped and tried again (because I desperately wanted this to work). But, unfortunately, it was he primer that caused me the allergic reactions strangely enough.\nWith all the probiotics included, and harmful ingredients left out, I think most people should not have the same reaction I had, but I thought I'd leave my experience here just in case.\n\nTLDR: Feels good, had a bad reaction (but may be an allergy), longevity for face makeup nothing exceptional."
   },
   "Moeblob666":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"20 Nov 2016",
      "title":"Essential",
      "description":"This primer is amazing! It smells great and keeps my makeup on all day.\r\nMy makeup goes on so much smoother when I use this, it just makes my skin look and feel great."
   },
   "Marfell":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"22 Aug 2016",
      "title":"New Favorite Primer",
      "description":"I have combo skin that is generally pretty easy to deal with. I hate the feel of thick primer/make up on my skin and generally just use a translucent powder as foundation. This stuff is super hydrating for me as well as very gentle on my sometimes sensitive skin. I now use this daily and love it."
   },
   "kaylee1118":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"24 Mar 2016",
      "title":"Nice and hydrating. I have combination skin, but this helps even out my complexion before I apply my makeup.",
      "description":""
   },
   "erinbeverley":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"7 Apr 2016",
      "title":"Love",
      "description":"First primer I've ever used and I love it. There's no need to even try any other brand it's bomb!"
   },
   "mallories22":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"12 Apr 2016",
      "title":"LOVE IT",
      "description":"Great product, deffanitly one of my favorite products. Holds your make up all day, long lasting and very hydrating for dry skin."
   },
   "Ameeraq":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"3 Apr 2018",
      "title":"NO",
      "description":"I hated this primer. It gave me the worst breakout. I was so disappointed because I’ve heard so many good things about this, but I guess it’s not for my sensitive skin."
   },
   "bumblebeaut":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"13 Jun 2019",
      "title":"Love this primer! Moisturizes my skin really well and doesn't clog my pores. I have oily/combination skin and my last primer broke my skin out, but I haven't had this issue with this product! Foundation sits really nicely on my face all day (and I work 12 hour shifts at the hospital)!",
      "description":""
   },
   "madhee":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"31 Dec 2014",
      "title":"If it has coconut.....its gotta be good!!!",
      "description":"I actually got this because i was looking for a better primer, to help me keep my foundation in place because my skin is oily and acne prone most of the time. for the past few months i had been getting little breakouts randomly all over.\nwith all the rating and everyone talking about this primer, i decided to try it out, and literally the first day i put it on my skin felt so soft and not oily. for the first time i had a matte face without having to powder it... with using this primer for about 3 weeks now i can say its helped me a lot, now my skin is super soft and so healthy. i know this is meant to be a primer but i actually use it as a moisturizer... my breakouts have cleared up and my skin looks flawless...honestly my favorite right now... i hope too faced comes up with a skin care line!! there is no product I have been unsatisfied with."
   },
   "lizrich92":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"8 Feb 2017",
      "title":"all time favorite primer",
      "description":"I love this primer so much. I've gone threw 2 tubes of this. I have combination oily skin and it holds up all day. Balances the skin my foundations look good all day long. Works well with different types of foundations. Has a slight smell but nothing offensive. Highly recommend!!!!!"
   },
   "di671":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"2 stars",
      "date":"29 Mar 2016",
      "title":"Pills",
      "description":"I liked the scent of this primer (reminds me of a pina colada), but it didn't work too well.  When I put it on, it just pilled all over my face.  My face was the opposite of dewy and healthy looking."
   },
   "MarthaVivian":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"15 Jul 2016",
      "title":"AWESOME!",
      "description":"I received a sample in my Ipsy & I love it so much,I'm getting a full sized tube! I used it under my Born This Way foundation,and the foundation went on like a dream! Several hours later, it still looks fresh and pretty! GREAT PRODUCT!"
   },
   "AmandaLeone":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"18 Apr 2015",
      "title":"I thought this would be hydrating for my dry skin. I noticed no change in my skin. Nothing special.",
      "description":""
   },
   "Jay17":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"21 Jan 2015",
      "title":"Love it",
      "description":"I randomly bought this primer because I saw it was supposed to be hydrating. I have very dry skin and this primer is perfectly hydrating where some others can be drying, it also does not show my pores and stayed on all day through 12 hours of activity and working out. New favorite!!!"
   },
   "HGreiner":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"2 Mar 2015",
      "title":"not for me",
      "description":"This product should be called a moisterizer instead of a primer. It smells wonderful, is lightweight, and feels nice on the skin. I have oily skin and it did not help my makeup last longer. It did hydrate my skin in the morning, though."
   },
   "itstashadoll":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"9 Jan 2017",
      "title":"Nope",
      "description":"Got a deluxe sample of this from Too Faced. I thought it looked a lot like Elmer's glue. It had a very weird consistency and was very runny. It was the complete opposite of what I'm used to with a primer. I love coconut though so I was excited to try this out and give it a shot.\n\nThe verdict: AWFUL. Completely awful. My makeup went on very patchy and looked really dry which was unusual. Once I was finished putting on my makeup entirely (which took a little more effort than usual) it didn't look too bad. But after only a few hours, my makeup looked just awful. It was patchy and dry and looked like it was 3 days old. My other primer keeps my foundation looking flawless even overnight through to the next day! This stuff just didn't hold up. I'm not sure how this is rated so high honestly as it is the worst primer I've ever tried. This stuff is always free in deluxe samples though so I would get my hands on one first if I were you to try it before you buy it."
   },
   "Beeloved":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"2 Aug 2016",
      "title":"WOW",
      "description":"Chose this at Sephora the other day while picking up my Kat foundation as a 100 point reward !!! Tried it today and I love it. Love it more than my Mac prep and prime. I will definitely be buying the full size of this. I have combination skin and it worked amazingly."
   },
   "pamber":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"4 Oct 2014",
      "title":"Coconut - YUM",
      "description":"I had color matched in a store for foundation, and the woman who helped me started with this primer when I told her that I have a tendency toward dry skin. I was planning to buy a full-sized Benefit Porefessional (which I also really like), but this is more breathable, and it was so hydrating. The coconut scent is wonderful, and it really does its job. Makes my skin look great!"
   },
   "beckyg67":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"12 Jun 2018",
      "title":"My favorite primer",
      "description":"I love this primer. I have dry skin and I find this hydrating, but not greasy. It does give my foundation a longer wear wear time. I love that it has a pump. This is great for travel. I have purchased this before and will do so again."
   },
   "scruffers15":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"2 stars",
      "date":"23 Dec 2017",
      "title":"O NO BBY WHAT IS U DOIN",
      "description":"TERRIBLE. It makes me break out and it makes my concealer sooo blochy. (I think i spelled that wrong lol). It smells funky and i would not recommend it!"
   },
   "Ali0130":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"8 Apr 2015",
      "title":"worth it but...",
      "description":"I absolutely love this. It hydrates my normal to dry skin, gives me a Dewey finish, and lasts all day. I apply the before I apply my makeup forever HD foundation and it holds it all day. The only downfall is that it makes my pores look huge so I have to add some benefit pore less to my skin. I like the coconut smell and it makes my skin look healthy and glow besides the pores. I would recommend this product."
   },
   "mikaylaw":{ 
      "extra_info":"<b>Skin Type</b> Dry",
      "stars":"5 stars",
      "date":"24 Nov 2016",
      "title":"Hydrating, not oily",
      "description":"Love this primer. I have very dry skin and it was hydrating and smoothed the skin as well. But, it didn't make my foundation go oily throughout the day. Absorbed fast. Didn't fill pores but that's not what its for. Great for dry skin!"
   },
   "JackieNicole":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"3 Mar 2015",
      "title":"dry skin saver!",
      "description":"I love this stuff! First off, the toasted coconut smell is so yummy. After applying this my skin feels baby soft and refreshed. I use it for more of a moisturizer than a primer so I can't say how well it holds up makeup but I will say I am definitely repurchasing!"
   },
   "courtlynn":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"12 Nov 2015",
      "title":"Feels awesome",
      "description":"I love how this primer smells and feels. It's a light coconut-y scent and has a light weight feel on the skin. I use it along with coconut oil on my skin and it makes my foundation and concealer look like it's a part of my skin rather than laying on top of. Along with my Urban Decay setting spray, my makeup lasts all day."
   },
   "JNa69":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"1 star",
      "date":"27 Jun 2017",
      "title":"Very Dissapointed",
      "description":"Buyer Beware!!! After reading the GREAT reviews on this product I decided to order the trial size. May I add.. that this is the first primer that I have ever tried. The first few times I used it I thought this stuff was EVERYTHING. So, I rushed over to Sephora and purchased the regular size. However, after a few days of using this I noticed that my skin started to get oily towards the end of the day.. and I also noticed that I was developing clogged pores (something I never have). Needless to say, I ended up with acne! It took me almost a week to get my skin back to normal. I returned the bigger size and still have the travel size. I definitely recommend that you try just a travel size and use it for at least a week before you go ahead and make a bigger purchase! Otherwise, you may find yourself in the same boat as me!"
   },
   "kawaiikai":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"10 Apr 2015",
      "title":"Good Alternative to dimethicone based primers",
      "description":"I have skin that is oily but dehydrated on the surface. I cannot use any \"cone\" based primer as they cause me to have cystic acne.\nI find this works very well in my constantly changing climate (typically humid but where I work is very drying to my skin).\nOne and a half pumps works for me and this is fast absorbing, I prefer to apply my liquid makeup when the primer is still damp. It does have a bit of stickiness to it, but that is what makes it work as a non-cone primer.\nI tried a liquid mineral based primer and found that it looked great at home, but at work my skin would become dry and my makeup looked cakey despite a light application of CC cream or sheer to medium build foundation.\nWhen I began to use this, the dryness and cake-ness stopped, so it's working well in hydrating my skin.\nI do like the scent of coconut, but even if I didn't I think that I would still like this as it's a subtle amount of scent."
   },
   "NYMakeUpLuvR":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"1 Mar 2015",
      "title":"Works very well",
      "description":"I really like how easily it goes on - a little goes a long way - great prep for liquid foundation, feels good even over the eyes (gently applied). will repurchase when ready."
   },
   "lunatone96":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"26 Feb 2016",
      "title":"Not for me",
      "description":"I used a full sample size of this until I ran out. It broke me out and just didnt match up with my foundation very well. It made my face patchy when I paired this with my foundation, so I tried another foundation I had and it did the same thing. Then after I stopped using it my breakouts were gone. I know it works for some people but I suppose the formula or ingredients just didn't agree with my skin. I have dry skin in winter and combination skin in summer."
   },
   "RachelG327":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"12 Nov 2016",
      "title":"This stuff is gold and anyone who says otherwise is lying to themselves. I never knew the value of using a primer until now. First it smells like little coconut scented cherub angels came down and butterfly-kissed my cheeks. It makes my skin plump and dewy like when I was a bright eyed college freshman and could still roll out of bed and look refreshed after partying for close to 36 hours over the weekend. No stickiness, no oiliness, no joke. A",
      "description":""
   },
   "martiangurll":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"4 stars",
      "date":"29 Aug 2014",
      "title":"Refreshing, great as moisturizer, primer fail",
      "description":"Love the smell & feel (faint coconut) & it makes my foundation go on quite smoothly but it did NOTHING for my t-zone, so it didn't work as a primer for me--make up lasted longer without it!!! BUT, I do like this as a moisturizer!. As a primer, it is a fail for me though. It did even out skin tone some and absorbed very quickly, & it didn't leave a greasy film. Sorry, Too Faced, my search for the HG primer continues..."
   },
   "sgords":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"4 stars",
      "date":"27 Feb 2018",
      "title":"works great... most of the time",
      "description":"I love this product, but for some reason it does not work with all concealers. It does not work at all with shape tape, and it can not be layered over sunscreen."
   },
   "Sofia07":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"4 Apr 2017",
      "title":"Not Worth The HYPE",
      "description":"Ive been using this for about 2 months. This product so so hyped on youtube, and I have no idea why. My skin is very dry. My skin soaks it up and its like it disappears! honestly you can't tell the difference between my foundation with or without it the primer. Will not purchase again."
   },
   "MillieMolly":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"28 Jun 2017",
      "title":"It's nothing special",
      "description":"I don't really get the hype around this primer; it doesn't do much. I mean, it's nice that it's water based, not silicone based, and I get that I wouldn't have as extreme of an effect as something silicone based, but I feel no difference in my skin after I put it on, and my foundation looks and feels the same with or without it. If anything, it makes it worse. I don't know if it only does this in combination with my moisturizer or foundation, but I've noticed (whether I use a beauty blender or a brush) that it starts pilling off my face when I try to blend my foundation with it. My foundation doesn't do that with any other primer except for this one. So unless you don't mind wasting 40 dollars or you just want to buy it so you can put it on your vanity, don't buy this primer. Not worth the price. It gets one star for the pretty packaging, and one star for the nice coconut smell. If it weren't for the packaging and the smell it would get 0 stars."
   },
   "Wenk":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"6 Aug 2016",
      "title":"Love it!",
      "description":"I have never really found a primer that I loved yet, until I received this in my ipsy bag. Love it! I love the texture and its really hydrating. I would make sure to let it dry completely before applying foundation. It hasn't caused any breakouts and it really evens out my skin tone."
   },
   "autumnjoymKeup":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"6 Sep 2018",
      "title":"so disappointed!! :(",
      "description":"I wanted to love this so badly! My makeup looked great the first day I used it. But it went downhill quickly. I loved the tackey-ness of it, but it irritated my skin so bad and gave me these little bumps all over."
   },
   "kallientemakeup":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"27 Apr 2017",
      "title":"I didn't notice my makeup staying on longer with this product. I would consider it more of a moisturizer than a primer.",
      "description":""
   },
   "nicolecharr":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"16 Nov 2014",
      "title":"surprised",
      "description":"I was definitely skeptical of this primer. I have oily skin and most primers I've tried are either too slick or I look greasy in an hour. This kept my foundation looking perfect all day. It wasn't a matte finish but it definitely wasn't oily. I would say a nice natural finish. Definitely will be repurchasing when I run out."
   },
   "ginaa1210":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"21 Dec 2016",
      "title":"Locked and Loaded!",
      "description":"This primer is fantastic!! It really keeps my makeup on and in place all day!  Even on extra long work days my makeup goes strong all day.  It is fairly hydrating on my dry skin (still need to use moisturizer)  and has a great scent."
   },
   "PeachesMakeup":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"12 Jan 2015",
      "title":"I personally do not like the texture of other primers but this one is by far my new favourite. It really does hydrate your skin. Fresh scent and light texture. If you do not like silicone based primers than give this one a try.",
      "description":""
   },
   "ILOVEMAKEUP682":{ 
      "extra_info":"<b>Eye Color</b> Blue",
      "stars":"5 stars",
      "date":"24 d ago",
      "title":"I am OBSESSED. I have extremely dry skin and this leaves my skin looking hydrated all day, no cracks, no creases just hydration. My favourite primer!!!!",
      "description":""
   },
   "heyitsbri":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"20 Jul 2016",
      "title":"LOVE this!",
      "description":"I just recently received this as a sample and I absolutely adore it! It has a great coconut smell, provides tons of moisturizer, and keeps my makeup on all day. Beyond happy with this product and plan to buy the full size as soon as my sample runs out!"
   },
   "je55makeup":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"15 Aug 2016",
      "title":"a little too light",
      "description":"A little too thin and light in texture for my preference in primer. Nice scent though."
   },
   "Abouzeenni":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"15 Oct 2016",
      "title":"Worst Product Ever",
      "description":"I thought this primer would be good for my skin but. When I tried it a couple of times I noticed it started to break me out BIG TIME !!! It was horrible my face looked awful for weeks !! Don't purchase !!!"
   },
   "LeneP45":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"13 Dec 2016",
      "title":"Seriously amazing",
      "description":"My skin never used to be dry and when I started dealing with intense dryness, this is what saved the day.  It is super hydrating but not oily at all.  I hate when products feel heavy or greasy but this just feels refreshing and replenishing.  It makes my foundation go on so smoothly."
   },
   "floggingmommy1":{ 
      "extra_info":"<b>Hair Condition</b> Chemically Treated (Colored, Relaxed, or Permed)",
      "stars":"1 star",
      "date":"23 Mar 2019",
      "title":"Not good",
      "description":"This doesn’t do anything really that it’s supposed to do.  It doesn’t make my face replenished, it’s not a good primer.  It makes make up go on uneven, if your make up doesn’t pill off first. It doesn’t matter how you apply it, you get the same results.  So if you’re looking for those things, you’ll enjoy it."
   },
   "amberruth":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"11 Aug 2016",
      "title":"too face hangover",
      "description":"I absolutely love this product. I have oily skin which finding a good product that works well with it can be frustrating. This product goes on well with my oily skin and stays in well only if I exfoliate and wash my face with a acne face wash otherwise my skin is a slip and slide with it on. Reseved a sample from my July ipsy glam bag and as soon as it was gone went and got a full size tube. Highly recommend for any skin use just if you have oily skin make sure to wash and exfoliate WELL before use and give it time for your skin to absorb the product for best results."
   },
   "lipstickjunkie3":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"12 May 2015",
      "title":"Love This!!",
      "description":"This is a awesome primer. I have oily combo skin and it works great for me. It moisturizes my dry patches. I works really well with my Nars all day luminous foundation."
   },
   "JessicaMarlene":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"16 Feb 2017",
      "title":"LOVE",
      "description":"I really like how my make up looks when I use this primer; all my products go on smooth over top. I have combination skin so I was worried this product would make me feel oily, but whenever I use this primer, my make up holds up really well throughout the day. Overall, this is a great product and the scent is really nice too!"
   },
   "Nadegeous":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"20 Nov 2018",
      "title":"The best for oily skin",
      "description":"I just tried a sample of this for the very first time - I love it! EVERYTHING gives me oily skin - from a setting spray to a matte primer. But this? It keeps the oil in check! It is really a lotion and not a cream - zero oil and truly hydrating. I’ll wait a few days and come back if it doesn’t do its magic - it often happens that something works well the first few days and then makes my skin oily after. So if I’m not back, then you know this is it for oily skin. Written on November 20th 2018."
   },
   "VictoriaGraceM":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"22 Aug 2016",
      "title":"Probably my favorite primer I've ever used. As someone with oily skin, I'm wary about most primers. While this one doesn't make my skin less oily, it doesn't make it more either. Also great to use on a simple day with just a translucent powder.",
      "description":""
   },
   "CarlitaMarie":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"1 star",
      "date":"15 Jan 2017",
      "title":"Breakouts...",
      "description":"I am breakout prone when it comes to primers, but I continue to search for the 'one' that will work effectively by smoothing my skin, locking in makeup and NOT make me breakout. \r\n\r\nUnfortunately, this primer caused some serious pore clogging, which in turn, became a full on breakout. Just made it through the other side and cleared up the mess on my face after two weeks. This was the only new product I had introduced in my regimen, so I know it was the culprit.  \r\n\r\nBeware, those who clog and breakout easily with primers!"
   },
   "DLaszlo":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"28 Dec 2014",
      "title":"Perfect",
      "description":"I don't often review products but wow, I just have to share how amazing this one is! It's feels so wonderful on my skin and absorbs so well. It's smooth and I find it to be quite hydrating. It also has a really wonderful smell. I would definitely recommend this to my friends :)"
   },
   "Kymille":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"12 Feb 2016",
      "title":"This primer is a must have for those with dry skin!! I've suffered with dry skin for years so its pretty hard to find that perfect foundation thats in-between dewy and matte. I use the hangover face primer on my cheeks, forehead and nose where I get the most dry patches. You can use another primer to cover your pores more if needed but this is a go to if you want a flawless finish without looking drying.",
      "description":""
   },
   "KrystenM":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"17 Dec 2015",
      "title":"SO IN LOVE!",
      "description":"I have dry, acne prone skin...and I loooove this primer so much. I use it a few minutes after I moisturize and it leaves my skin feeling light, fresh, and beautiful. I think it smells nice and doesn't irritate my skin at all! It makes my skin smooth and hydrated to prep for my foundation. I'm excited I purchased this primer, I love it!"
   },
   "ptlk":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"1 star",
      "date":"23 Dec 2017",
      "title":"I would give this 0 stars. When you put the foundation on and rub it, the primer peels off your skin (like erasers). AWFUL\nDO NOT GET!!!! I thought something was wrong with my skin, but nope, its the primer.",
      "description":""
   },
   "benzmom":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"5 stars",
      "date":"12 Jan 2016",
      "title":"My new go-to primer for winter.",
      "description":"This primer makes my skin feel so much more hydrated than my old one did. Lightweight and feels good and soothing. Makes my foundation last a good eight hours for work."
   },
   "moonzie":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"2 Aug 2016",
      "title":"Solid primer for dry skin",
      "description":"Been switching up my face products lately and like the way this primer feels/performs. Absorbs well and doesn't leave a weird, silicone-pumped film on my face. Does a great job of holding onto foundation/face makeup and keeps my dry skin looking hydrated without making my face super greasy and causing breakouts."
   },
   "juliasprayberry":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"1 Sep 2016",
      "title":"Disappointing",
      "description":"I'm not normally one to write reviews but I am so upset about this product that I felt it was necessary to write something up. I bought this after hearing raves about it on the Internet, I love and trust Too Faced as a brand but this product just did not work for me... I have (minor) combination skin and I have tried every way of applying this so that it works but it generally applies/dries in odd patches and completely pills up when you try to apply foundation.\nAgain, I really wanted to like this and I tried everything to make it stop pilling up with no luck. Definitely returning, very disappointed, would NOT recommend."
   },
   "Isabella3":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"25 Dec 2015",
      "title":"Great Primer",
      "description":"I like using this primer before doing my makeup mostly for the consistency. I would describe it as a gel-cream consistency with a slight cooling effect. It feels really nice on the skin and acts as a good base for my makeup. I wouldn't give it 5 stars, just because I don't think that it really helps my makeup stick on any more than it would without it, but I think it is worth the use just because it makes my skin feel smooth before applying my foundation. I would repurchase this primer."
   },
   "daisyynoemi":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"8 Jun 2017",
      "title":"Changed My Attitude On Primers",
      "description":"Im usually not a big fan of primers because with the ones that I had used, my makeup still didn't stay in place. I decided to grab this as a sample just because I had heard great things about the primer. Let me just say this changed my attitude towards primers. It's hydrating, smells super good, evens out my skin, and best of all, it holds my makeup in place yet doesn't make me feel sticky or overly dewy. I went back and bought the full size product and now use it religiously. I highly recommend this!!"
   },
   "spytech12001":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"12 May 2015",
      "title":"Love!!!",
      "description":"I love anything Too Faced. After seeing a few good reviews and looking for a new primer to give me that all-day hydrated look, I can truly sy I'm in love. Two pumps and your skin looks hydrated, but not oily. And I love the coconut smell."
   },
   "MariahhMae":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"21 Jul 2017",
      "title":"Sort of the Opposite/ Confusing",
      "description":"I bought this primer after a Sephora employee suggested it to me. I didn't really know much about this primer besides seeing it on Youtube here and there. I opened it up when I got in the vehicle and tried it on the back of my hand. I have pretty dry skin and this seemed to have hydrated a decent amount, plus the scent was a pretty large bonus as well. So I had pretty high hopes.\r\n\r\nHowever, when I tried it out for the first time, it seemed.. odd. I normally moisturize my skin prior to my makeup, and normally any hydrating primer just adds to it. This primer somehow had an opposite effect. It made my skin feel dryer and was very mattifying. Before I could even finish applying my foundation, I noticed that it was already beginning to separate and look cakey. Huge No Go. Took it off and scraped the bottom of my old primer. \r\n\r\nI tried it out a few more times after: with a different foundation, without/or different moisturizer, applying less product, testing it throughout the day, and just not trying to rage quit on the product in general. But it was all the same results. My skin looked extremely matte and cakey, my bronzer and contour now went on very patchy, the foundation and powder would settle in the fine lines under my eyes making me look older. Also after wearing it just a few times, I did manage to receive a small breakout.\r\n\r\nI really wanted to love this primer. I enjoy the pump and tube packaging, as well as it smelled very delightful, and felt lightweight on the skin. It'll probably work better for those who have normal - dry skin or enjoy the matte look. But this primer is a pass for me."
   },
   "jess1002":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"25 Jun 2016",
      "title":"AMAZING PRIMER",
      "description":"This primer is gorgeous. It's cheaper than most and comes with a ton of product.  The tackiness creates a nice canvas for foundations- especially Born this way. Recommended for dry skin, cause it's not oily"
   },
   "abcopes":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"9 Sep 2014",
      "title":"Love",
      "description":"This primer provides a nice base for my foundation. I haven't noticed it evening out my skin tone, but it's moisturizing without being greasy or slick like some silicone primers. There is a slight coconut smell that dissipates very soon after application."
   },
   "Danii003":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"2 Jan 2015",
      "title":"Moisturizing and light",
      "description":"If you like the Make Up Forever HD primer you'll love this one too. Very similar consistency but a lot more moisturizing. Almost feel like I don't need to use my moisturizer before using this primer. Brightening and soothing on the skin. Love it."
   },
   "JayJay24":{ 
      "extra_info":"error getting this field.",
      "stars":"3 stars",
      "date":"16 Aug 2016",
      "title":"It's okay....",
      "description":"I was so excited when I saw that my local Sephora was stocked with this primer. I had been wanting to get my hands on it for so long. I heard it did amazing this for people with dry skin like myself. When I tried it I didn't see anything amazing, it just felt like I was putting on another moisturizer. Nothing really special, my mom on the other hand really enjoys it, and she has dry skin too. So I guess it just works differently for different people."
   },
   "hburkexoxo":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"31 Mar 2015",
      "title":"EXCELLENT",
      "description":"I am on my 4th month of accutane so my skin is SUPER dry. I've tried smashbox primers, as well as benefit, and nothing compares. LOVE the mild coconut scent... This is the only primer that's made my foundation not stick to dry patches. YAY! Holy grail & well worth the price."
   },
   "elina72":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"4 Dec 2014",
      "title":"I love this primer, especially in the fall and winter time since it is so hydrating. I use it under foundation and it gives a very a dewy look. Makeup last the whole day without any touch up and I don't get any breakouts. It also has very pleasant smell. I just bought another one.",
      "description":""
   },
   "iloveheathl":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"5 Feb 2016",
      "title":"Didn't Work For Me",
      "description":"I bought this primer because I have dry skin and makeup tends to crack on my chin after hours of wear. Using this primer, my makeup went on smoother;however, after a few hours, it was cracking and much more than normal. I even noticed flakiness around my nose which never happens."
   },
   "ryeryee":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Jun 2017",
      "title":"love this!",
      "description":"I love this product...mainly because I'm trying to avoid silicone and this primer doesn't contain any. It has amazing ingredients and my skin feels soft and moisturized all day whenever I use it. This primer works well under a bb cream or literally any of my foundations. It prevents dry spots from happening and stops my foundations from breaking up and flaking off (I have super dry skin.) I always set my makeup with powder and use a setting spray and my makeup always stays nice... I think this primer is worth the money and I will continue to use it!"
   },
   "nlh22":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"1 star",
      "date":"21 Mar 2017",
      "title":"I really wanted to like this. The description sounded great and I have had a great experience with the primed and poreless Too Faced primer. However, it didnt do anything for me. It made my makeup look fake which is exactly the opposite look I was going for. Not crazy about the smell or texture either. Wish I would have returned it.",
      "description":""
   },
   "Anjav614":{ 
      "extra_info":"<b>Eye Color</b> Green",
      "stars":"1 star",
      "date":"25 Jan 2019",
      "title":"This primer ruins my foundation. It causes it to pill or ball up, making my face patchy and flaky looking. I need a hydrating primer but I do NOT recommend this primer. Will be throwing away.",
      "description":""
   },
   "Wondertwin":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"8 Aug 2014",
      "title":"Love it!!!",
      "description":"My favorite primer so far. I'm sooo happy it's silicone free, has a very refreshing coconut smell, glides on and absorbs quickly, doesn't leave a film and holds make up in place all day. Truly amazing!"
   },
   "shawnafaye":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"4 Aug 2016",
      "title":"Horrible pilling affect",
      "description":"This primer had a horrible pilling affect on my makeup. Very similar to the way over time your favourite article of clothing produces small balls of fluff from the fabric being worn down.\nI'd try to put on my foundation and the primer underneath would start balling up resulting in patchy uneven foundation application. Not a cute look. I'm thinking about passing it off to a friend, but I don't think this product is even worth passing along.\nI love Too Faced products but this is a definite flop for them."
   },
   "kendylll":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"3 Nov 2015",
      "title":"so disappointed...",
      "description":"I had such high expectations for this primer, I saw a bunch of good reviews and the smell is amazing.. If you like coconut water. When ever I use it, it balls up and crumbles when I apply foundation or powder. I have normally oily skin but recently it became dry so I went for a hydrating primer and I am not impressed at all:("
   },
   "Ginaa1234":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"11 Apr 2016",
      "title":"pimple face",
      "description":"After watching kathleenlights video on this primer, I really wanted to try it out so I went to sephora the next day to buy it. I was so excited to use this and expected my foundation to look amazing and my skin to feel moisturized but boy was I wrong. This product broke me out! I wouldn't say badly but I had like 4 whiteheads on my chin and also small little bumps all over my forehead. I knew it was this primer because it was the only thing I had changed in my makeup routine. Ended up giving it my friend was is not acne prone."
   },
   "leogirli6994":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"20 Jan 2015",
      "title":"No love for this primer",
      "description":"I take really good care of my skin inside and out but during the winter my skin needs a little extra help because it's so dry. I have combination oily but these days it's not so oily so I figured I would give this a try. After using it under my makeup, i absolutely hated it. My face felt tacky and gross by the end of the day and my makeup didn't stay in place hardly at all. I went straight home and got it off my face. I couldn't stand the way my face felt after a day. Just not for me"
   },
   "Belindajust":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"5 stars",
      "date":"9 Oct 2017",
      "title":"IT DOES what it says it does",
      "description":"Hydrating yes! I GOT this a sample when I ordered their mascara. The primer is great for hydrating I tell you. I wore it under my fenty foundation that is so drying(and I have combination oily skin) and this made my makeup look hydrated-You know, like I drink water everyday and have hydrated skin and all Plumpy..so cute! Doesn’t help with shine and all that matifying stuff though. Maybe you can put a matte primer first on yah skin and then mix this primer with your foundation if you have oily/ combination skin on top. So no oil peeks through but you look hydrated."
   },
   "queenkitty21":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"17 Apr 2017",
      "title":"If your skin hates silicone primers...",
      "description":"If your skin hates silicone primers, this is a great primer to use!  It's non-irritating  and doesn't cause me to breakout, which was a huge problem with other silicone-based primers like Smashbox.  The scent is incredible and refreshingly coconut without smelling like sunscreen.  I miss the smooth feeling of silicone primers, but this still creates a great canvas for my makeup and it keeps my makeup looking fresh and amazing all day even on my oily/combo skin!"
   },
   "Linzy1022":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"10 Sep 2014",
      "title":"LOVE LOVE LOVE",
      "description":"I have dry skin that starts to get oily by the end of the day especially in my \"T\" zone. This stuff makes me skin look flawless! I tried it based on other great reviews and it's AWESOME!!"
   },
   "CassBrazil":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"21 Jul 2016",
      "title":"my savior!!",
      "description":"This primer is awesome! I received it in my ipsy bag this month and it makes my skin stay matte all day! My skin is very oily and I've tried numerous primers....this one is the best. Smells yummy and goes on smooth. I actually think the coconut water base helped cleared up my skin as well, because my skin has been a lot smoother since I've used this product. Definitely going out to buy the larger size since my sample is already up :)"
   },
   "gfbates":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"5 stars",
      "date":"20 Jan 2017",
      "title":"holy grail!",
      "description":"I've only tried two primers before this (Smashbox Photo Finish and Bare Minerals Prime Time) and I really never saw any difference in my skin, etc. I picked this up because I was running low on my current primer and wanted to try something that wasn't silicone based. I am so happy! This is completely worth the risk. My skin feels so nice and doesn't get red when I put it on. My foundation doesn't even look like it's there, my skin is so glowy and wonderful!"
   },
   "ADxox":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"28 May 2017",
      "title":"pretty good",
      "description":"Great for dry skin. \nYou have to use a small amount and gradually add more because if you use too much at first then you start applying foundation it rolls off flakey-like and is not fun at alll."
   },
   "xashnic":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"12 Mar 2017",
      "title":"10/10 will repurchase this product. I love how light weight and refreshing it is. My makeup stays on all day with very little movement and my skin stays super moisturized and soft. the smell isn't very strong either which I enjoy.",
      "description":""
   },
   "MelanieLee":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"1 star",
      "date":"11 Nov 2016",
      "title":"What's everyone raving about?",
      "description":"I seen everyone from oily to dry skin hyping this up on YouTube and thought I would try it... First off, the smell is awful. Secondly, is this a primer or a moisturizer, or a hybrid of the two? Lastly, it is so sticky that I had to wash my hands after application. Yeah, that's gonna be a no for me, dawg."
   },
   "Daniellerobey":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"7 Apr 2017",
      "title":"LOVE",
      "description":"This primer is AMAZING for dry skin! It makes my skin smooth and soft and it's so hydrating! I originally had a sample but I loved it so much, I had to buy it! Best primer I've tried"
   },
   "sydb88":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Dec 2015",
      "title":"Finally!",
      "description":"Finally! Silicone free! I got a mini of this in a set. I love it! I have been looking for a good silicone free primer, but there are so few on the market. If I wear a silicone primer every day i break out. I also have oily skin, so silicone products dont work well for me. This is great! Makeup goes on smooth, less shine throughout the day, makes makeup last all day. And the smell is divine! Love it! Please never quit making this primer! Will definitely get full size when mini runs out."
   },
   "serenity505":{ 
      "extra_info":"<b>Age</b> 45-54",
      "stars":"2 stars",
      "date":"7 Sep 2014",
      "title":"Just okay.",
      "description":"I have not found that this primer does anything to refresh my skin in hydration or tone. Feels nice and melts into skin. I can't tell that my foundation lasts longer with it, so I will stay with my Hourglass primer which works better."
   },
   "jenny1203":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"14 Mar 2015",
      "title":"love this!!",
      "description":"I use this as an AM moisturizer not a primer and I absolutely love it, I have combo oily skin and it hydrates my skin without getting oily. Im in love with the coconut scent it has it's not heavy and doesn't linger. I think it's a bit pricey but I ran out and re-purchased it so that says a lot lol, I will continue to re-purchase."
   },
   "laliee":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"22 Jan 2017",
      "title":"BOMB AF",
      "description":"This primer is so freaking good! Hydrates your skin leaving it feeling fresh and the makeup goes on so smooth and last a long time! Def reccomend it"
   },
   "BabyBri":{ 
      "extra_info":"<b>Eye Color</b> Hazel",
      "stars":"4 stars",
      "date":"19 Aug 2019",
      "title":"I like it but im still looking for a primer that I love. This one smells good and feels good. I think it works great with my foundations but doesnt make me say “ you need to try this !”",
      "description":""
   },
   "Christinesmith3":{ 
      "extra_info":"error getting this field.",
      "stars":"2 stars",
      "date":"18 Aug 2016",
      "title":"acne prone",
      "description":"Oh my goodness. I was so excited to try this based on other reviews saying it didn't break them out, but I have been subject to 17 new blemishes over the past week of using this. It's lovely, smells like coconut, and it did a great job of holding my makeup in place, but not for my sensitive skin."
   },
   "Livingsingle65":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"11 Oct 2014",
      "title":"One Of The Best Primers",
      "description":"I pretty much like all Too Faced products so when I came across this it was a toss up between this and Tarte's new primer. Well Too Faced has never let me down with the exception of a sample of there other primer that was loaded with silicone so I choose this and I'm so glad I did! I have combo/oily skin and was a little concerned about if it would leave my face greasy after reading the reviews. Nope! I even use moisturizer underneath and still have no shine. I do use a foundation that helps with excess oil, Laura Mercier (the new one) for anyone that cares to know. It's perfect as well. I find that my makeup stays beautiful all day long as if I had just applied it. A good 8-10 hours. I love the fact this has no silicone in it. I hate the way that feels on my face. Smells wonderful but not over the top. So glad I made this purchase!"
   },
   "khub820":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"2 stars",
      "date":"28 Jun 2017",
      "title":"Not really meant for oily skin-AT ALL",
      "description":"***For dewy healthy looking Finish**** Dewy does not usually go with oily skin types. This primer is not meant to keep oil at bay therefore it does not keep my skin matte. Sure it moisturizes. Yes it smooths-that's what primers do, but nothing special to make this stand out in my opinion. I don't see any \"brightening\" on my face either. I see a lot of comments about the smell-I think it smells gross. However that smell goes away pretty quickly."
   },
   "lanweiowo":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"10 Dec 2016",
      "title":"Smells soooo chemical... i can't ... If ur picky with smells ... DONT ! Because u need to hold ur breath when u get this thing on ur face but after 13.25 sec you apply this on your face  you won't smell it.  I think it doesn't make my makeup last long and it's not really moisturizing.. Idk not really a fan? But the packaging is so cute ....",
      "description":""
   },
   "Becca95":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"27 Feb 2015",
      "title":"ehhh",
      "description":"I wanted to try this sooo bad after hearing such fantastic reviews I needed to see for myself. Once I got it I was so disappointed. It didn't hydrate, and definitely did not help my foundation go on easier. After I applied it, it literally started to like chunk up idk. I tried putting foundation on but elwkkkk. I took everything off and started again with something else! I returned it. Oh and the smell stinky cats not coconuts"
   },
   "teacherpants":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"11 Mar 2016",
      "title":"made my skin drier",
      "description":"I HATED this primer. It made my skin so dry and greasy. I have combination skin so maybe it's not the best choice anyway but I hated it so much."
   },
   "babygal786":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"8 Oct 2014",
      "title":"Great primer and smells amazing!",
      "description":"I bought this primer on a whim because I needed a break from my Porefessional. I wanted to try something different and more hydrating, and this did the trick! It's very lightweight and hydrating. It's almost like the consistancy of a thin moisturizer, but dries nicely on your skin. I find my foundation also goes over this nicely. There is also alot of product in this thing, so it'll definately last. And the smell? So nice but not over-powering which is great. Overall it's a great primer, but probably not for someone with oily skin."
   },
   "littleebetchh":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"9 Sep 2015",
      "title":"Smells Amazing",
      "description":"I love this primer. Im not too big of a fan of primers, so i like this one because it feels hydrating but doesnt feel siliconey like others. It has a reall good smell to it and keeps my makeup in place all day. I have combo skin, not to oily though and this primer hasnt affected the oil so far :)"
   },
   "cxgo":{ 
      "extra_info":"error getting this field.",
      "stars":"1 star",
      "date":"14 Jun 2017",
      "title":"nope.",
      "description":"Not worth the price or the hype. I did not find it to be hydrating at all, and my makeup moved around like crazy all day."
   },
   "paintmecrystal":{ 
      "extra_info":"<b>Skin Type</b> Normal",
      "stars":"5 stars",
      "date":"17 Mar 2015",
      "title":"Dewy Finish!",
      "description":"I love this face primer by Too Faced. This primer's job is supposed to hydrate, smooth, and brighten skin and it does just that. It really gives me that dewy, healthy looking finish, but not oily. I wore this the whole day and by the evening my skin still look refreshed and makeup was flawless.\n\nIt does have a brightening effect which is a plus if you have uneven skin tone. Also, I have normal skin and it did not make my skin oily whatsoever. Tip: You do not need a lot of product - apply a pea size for the whole face is all you need.\n\nIt is a silicone-free facial primer that boost skin’s radiance and moisture thanks to an infusion of coconut water. It would be perfect for those with dry or aging skin.\n\nThis does have a subtle coconut water scent. The formula is a thinner, creamy texture that applies with a bit of stickiness at first, but definitely sets to a dewy finish.\n\nWatch my video below - I applied the face primer before my makeup and you can see a dewy effect that it has on the skin."
   },
   "kirstensmith":{ 
      "extra_info":"<b>Skin Type</b> Dry",
      "stars":"3 stars",
      "date":"15 Feb 2017",
      "title":"This product is super hydrating which is great for my dry skin. It does have a pretty strange smell and I feel that it doesn't really act as a \"primer\" it's more of a light moisturizer.",
      "description":""
   },
   "kvalencia1":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"14 Nov 2016",
      "title":"Favorite primer!",
      "description":"I have combination skin (oily and dry) and I am mostly dry in my t-zone. This is great for parts of your face that are dry and need some moisture. It smells delicious (coconuts, yum!) and is silicon and paraben free! I use it as my moisturizer and face primer because its extremely moisturizing without feeling greasy, but also gets slightly tacky to be a great base for my foundation.I was hesitant at first to buy this product since I am oily and its extremely moisturizing, but I just avoid my t-zone when using this. I will continue to buy this product as my face primer/moisturizer, and I can't recommend it enough to family and friends."
   },
   "vvane":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"31 Mar 2017",
      "title":"Great",
      "description":"heads up about me, 25-30 asian girl with a combination skins. usually gets very shinny on T zones in summer times, and oily but also dry spots on T zone in winter time or whenever season change. \nI have sleep problems, so sometime i wouldn't fall a sleep the whole night. \n\ni use this primer when:\n1. can not sleep the whole night, and still need to wear makeup and go to work.  My make usually couldn't stay and may have peel off in this situation. But with this primar, my make up looks great! it do the job- for hang over skins. \n2. on t-zone only after FAB pad  used and when there is a dry spot. FAB pad will.peel off my dead skins, and this primer hydrate my skins right away and make my make up grows and stay. \n3. on my cheeks and chin coz those are my dry areas. this primer always make these areas grow and hydrared."
   },
   "savlove":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"1 Mar 2015",
      "title":"Great",
      "description":"If you dont like silicone based primers this is great for you! I have dehydrated skin and this is perfect. I like to pair this with the Josie Maran Argan Illuminizer! It works perfect together and both give me a healthy glow. When I do use this by itself it makes my skin look healthy and replenished."
   },
   "NicoleBoh":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"17 Mar 2016",
      "title":"My skin looks better with use!",
      "description":"I have always had issues with silicone based primers breaking my skin out. I bought a sample Too Faced kit, and this was primer was one of things to try.\r\n\r\nIt is absolutely fantastic. Lightweight, my skin feels hydrated, it smells good. I've worn both powdered and liquid foundations over this primer, and they both last all day.\r\n\r\nSince I started using this (~ week ago) I have had no new breakouts, and my skin looks healthier."
   },
   "KallieByfuglien":{ 
      "extra_info":"<b>Eye Color</b> Blue",
      "stars":"5 stars",
      "date":"8 Jan 2018",
      "title":"great primer",
      "description":"I love this primer! It has a great smell a great consistency and is very nourishing for the face. First of all the smell is phenomenal it is a coconuty rosey kinda smell. And the consistency is great because it’s not a silicone primer and it really moisturizes if you need that extra moisture."
   },
   "missebony2u":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"2 stars",
      "date":"11 Nov 2017",
      "title":"Hated it or it hated me",
      "description":"This was not moisturizing at all, very drying and I already have pretty dry skin. I don’t like the matte look especially with dry skin. Was cakey and kind of doughy unless I got a bad batch. I took t back ASAP."
   },
   "ohnoitsmary":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"14 Dec 2016",
      "title":"Sensitive skin review",
      "description":"I have super sensitive skin and just about any type of lotion makes me break out. This though is a miracle for me! It smells amazing. It's super lightweight and goes on easy just like lotion would. Makes makeup stay on all day. I love this primer out of the dozens I've tried. Definitely would recommend this!"
   },
   "M2Mami":{ 
      "extra_info":"<b>Age</b> 35-44",
      "stars":"5 stars",
      "date":"12 Sep 2016",
      "title":"Best Primer",
      "description":"This is the best primer I have used thus far. It especially works well for me working nights and then heading to internship right after...so thats at least 15 hours!!!"
   },
   "whitwood":{ 
      "extra_info":"<b>Eye Color</b> Brown",
      "stars":"4 stars",
      "date":"21 Dec 2017",
      "title":"be aware of what foundation you use..",
      "description":"People that claim this primer balls up with their foundation: this primer is silicone free and silicone or oil foundations will not work well with this as a base. If you use a water-based foundation on top of this primer, you are set. Beautiful. It’s very hydrating. Holy grail for my makeup while I am on accutane!"
   },
   "Egonzzz":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"27 Nov 2016",
      "title":"I have oily skin &amp; this stuff allows my makeup to stay on all day! It's extremely refreshing on the skin &amp; smells great. I like that it feels more like a moisturizer &amp; not so much like most silicon based primers.10/10, do recommend, A  work",
      "description":""
   },
   "WJStar":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"23 Nov 2015",
      "title":"I bought this based on the many positive reviews and because I wanted something to hydrate my face. I have combination/oily (T-Zone) skin but after flying recently for over 24 hours my face was super dry and flaky, which is not usual for me. So I purchased this to help hydrate and I love it! I have used it with liquid and powder foundation and with both my foundations have been flawless. Also it did not make me get oily and I didn't have to retouch at all. I did use a setting spray but by far this is becoming a staple in my routine. Also I love the smell.",
      "description":""
   },
   "Ladytron82":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"20 Apr 2016",
      "title":"Awesome",
      "description":"This is my favorite primer ever. I have very dry skin and it completely nourishes it and makes makeup application flawless. I also LOVE how it smells."
   },
   "vintagequeen1":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"29 May 2015",
      "title":"Keeps things moisturized",
      "description":"I was worried at first when I bought this because I did not think it would really help with my dry face skin. However, this has done the best job at keeping my foundation flake free all day! This product worked better for me than the hourglass primer. I am not sure how it helps keep your makeup on, but it is great for an after moisturizer primer."
   },
   "mermaidcurves":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"28 Jun 2015",
      "title":"Perfect",
      "description":"This primer smells nice and goes on smooth. It keeps my make up in place all night. I do think this brings out extra oils but I have oily skin to begin with. Blotting papers always!"
   },
   "Aceammo":{ 
      "extra_info":"<b>Age</b> 13-17",
      "stars":"2 stars",
      "date":"24 Feb 2017",
      "title":"does a weird thing",
      "description":"when I put this on and then put my foundation on it will do this weird thing that if I touch my face in anyway my it will roll off into a bead but it does smell amazing and feels good other than that"
   },
   "MossyMoss":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"30 Jan 2017",
      "title":"Fresh, Out of the Shower Feeling",
      "description":"I LOVE THIS STUFF!\r\n\r\nWhen I put this on, my face feels like I just got out of the shower. I feel refreshed, and my skin looks and feels smoother! The only primer I've used that doesn't feel like it is suffocating my pores!\r\n\r\nPlus the coconut smell is wonderful!"
   },
   "sarahlevv":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"4 stars",
      "date":"20 Mar 2015",
      "title":"Amazing for Dry Skin",
      "description":"For the harsh winter months, this has been so helpful for my skin and it really felt hydrating. It also felt refreshing and brightening, will definitely buy more in the future!"
   },
   "haley2021":{ 
      "extra_info":"<b>Eye Color</b> Hazel",
      "stars":"5 stars",
      "date":"9 Nov 2017",
      "title":"amazing",
      "description":"The best primer I have ever used. Super hydrating but does not make your skin oily. Makes my makeup stay on all day and does not crease"
   },
   "Nikol1":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"9 Apr 2015",
      "title":"this is a must buy!",
      "description":"Saw this on a popular YouTube channel and just had to try it. I'm glad I did because me and primer have a love hate relationship. This product is amazing and smells great! Wakes you up in the morning and helps everything stay out during the day. Very hydrating without being overly so!"
   },
   "nerdio":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"12 Oct 2016",
      "title":"AMAZING",
      "description":"Best primer for dry skin, EVER! The smell is just amazing and makes my skin feel so smooth and moisturized! My make up sits super well on top and helps A LOT with making my make up stay in place, and not cling to my dry patches."
   },
   "jesshuynh":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"4 Jan 2017",
      "title":"Better for dry skin",
      "description":"I have oily, acne prone skin w/ dry patches. This primer is ultra hydrating and it DOES make my makeup last longer throughout the day! Overall I had a good experience w/ it, it didn't break me out but made me oilier on my t-zone than usual but touch ups and blotting sheets help a lot!"
   },
   "zoeeeeeo":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"2 stars",
      "date":"22 Dec 2016",
      "title":"eh",
      "description":"I have dry skin in the winter and really wanted to love this but it didn't do anything to make my makeup last and it pilled horribly. Will be returning."
   },
   "MadisenL11":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"27 Jun 2017",
      "title":"pretty good",
      "description":"My go to primer. Very moisturizing. Keeps makeup on and radiant. Not matte but natural looking."
   },
   "ifuseekalex":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"16 Aug 2016",
      "title":"Love!",
      "description":"This is hands down one of the best primers I've ever used! It's so hydrating and it makes my skin glow! I'm in love."
   },
   "DMakeUpNS":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"12 Oct 2016",
      "title":"Great primer",
      "description":"It's really one of the best! It's sooo lightweight, so hydrating, so easy to apply and with beautiful smell. It's deffinitelly better than other silicone and heavy primers. It's better than MUFE smoothing primer (it's more like MUFE's hydrating primer-white one). It's great for every skin type, especially dry, but it's great for normal skin also. It's like a hydrating lightweight cream with primer abilities. It will be pleasant for oily skin also, which I do have."
   },
   "beandiprocks":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"9 Sep 2014",
      "title":"Like but have to return",
      "description":"I think that this would be great for someone whose skin doesn't get oily during the day. My biggest complaint was that it left my skin looking shinny after 4 hours. However, I do use a tinted moisturizer (I didn't have the shine problem before) so maybe it'll be fine if you use a matte foundation. Also, I found that it takes a while to fully absorb. It has the consistency of a lotion, not like the super light-weight primers (e.g. Hourglass). It is hydrating though and has a faint pina colada smell (that doesn't linger and isn't perfumey)."
   },
   "sammi98b":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"1 Sep 2016",
      "title":"Fresh Faced",
      "description":"Now, I have very dry skin personally, and this primer completely moisturizes my face whenever I put it on.  It also smells amazing!!"
   },
   "QueenMarceline":{ 
      "extra_info":"<b>Eye Color</b> Hazel",
      "stars":"3 stars",
      "date":"28 Aug 2018",
      "title":"Didn’t Blow Me Away...",
      "description":"Don’t get me wrong I still reach for this primer from time to time but I’ve somehow become a primer hoarder over the years and this just doesn’t stack up. I love this primer when I’m feeling extra oily and just want something very light underneath my makeup. I sometimes even use this on its own when I go makeup free. Although I must say I’m not a huge fan of the scent because it smells like very artificial coconuts. It’s not completely off putting to the point where I can’t stand the scent but I much prefer the scent of their peach primer. I tend to reach for the spray version of this primer (the 3-in-1) way more often because it leaves my face feeling refreshed and I can spritz it on while on the go. All in all, it’s a decent primer but it’s definitely not in my top picks."
   },
   "GardensGirl":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"4 stars",
      "date":"25 Feb 2015",
      "title":"Great Primer",
      "description":"Love this primer to hydrate my skin before applying my foundation. I don't think it evens out my skin tone, but I do think it keeps my foundation (Diorskin Forever Flawless) from settling in my pores."
   },
   "hellovanni":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"7 Dec 2016",
      "title":"Meh",
      "description":"I love how this feels on my face, and I feel really moisturized after. However, I didn't really feel like it was like a primer. My makeup didn't seem to last any longer than normal. Love the smell and the feel but probably won't repurchase."
   },
   "ChaHen":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"3 stars",
      "date":"21 Jan 2015",
      "title":"The Smell &gt;",
      "description":"This primer is a great product. For me, since I have combo/oily skin, I use this when I am having a light makeup day. I have used this multiple times in warmer situations where I wanted my makeup to stay satin finished and not oily. However this didn't keep my makeup lasting as long as I needed it to. This is why I only gave this product 3 stars. On the bright side, the smell of this is amazing!"
   },
   "kenzeebh":{ 
      "extra_info":"error getting this field.",
      "stars":"4 stars",
      "date":"15 Feb 2017",
      "title":"Comparable to Marc Jacobs",
      "description":"I really like this primer. It smells really good, and is light. You have to let it dry to your skin before applying your makeup or it won't hold as well. Not enough people let their primers dry before applying makeup onto it."
   },
   "kimnguye14":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"9 Mar 2015",
      "title":"I was hoping I'd really love this product and I actually do!!! It's the first and only primer I can see myself using again and again. It does help my foundation stay on longer, and smooths everything out. I only have good things to say about this.",
      "description":""
   },
   "amandaa19":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"24 Dec 2016",
      "title":"My skin gets flakey and has dry patches on my face during the winter. Last winter I was so irritated because I couldnt put foundation on without looking cakey. I purchased this primer in Nov and have used it almost everyday since, my skin looks and feels GREAT, putting make up on everyday is not a problem anymore. My skin feels as hydrated as it does in the summer. I am so so impressed with this primer and would reccommend it to anyone dealing with really dry skin.",
      "description":""
   },
   "bbyshortie":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"4 Nov 2016",
      "title":"Great Choice",
      "description":"I have combination skin and am always looking for silicone free anything. I was recommended by a Sephora employee to try this and let's just say it was the best recommendation ever. First, the quaint scent of coconut makes me already fall in love. It may feel a bit too sticky but it dries up quickly and doesn't disrupt your foundation process (I use the Lancôme Teint Idole Ultra). I'm not sure why some people claim that their make up practically melts off but mine stays great. I've even gone 15 hours with this primer and my foundation without having to redo or fix anything. My skin hasn't gotten clogged nor have I noticed any negative changes in my skin since starting this in the early summer."
   },
   "Trachellebelle":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"3 Nov 2016",
      "title":"IN L.O.V.E",
      "description":"I hate primers for the most part. I have never used a silicone based primer that i have fallen in love with. \r\n\r\nThis is silicone free and leaves skin feeling hydrated and fresh. I love that my foundation sets so well on this as a base. \r\n\r\nI use a face oil underneath and this is the perfect match."
   },
   "AlyssaCruz":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"17 Feb 2016",
      "title":"Love this stuff!",
      "description":"This product is great! Kind of similar to the Hourglass primer but for a lot less. My skin is little red around my cheeks-I wore this alone one day and there was barely any redness. My skin definitely felt hydrated but not heavy. When I wore it under make up, my make up looked even better than before-and it lasted for a long time too. I would definitely recommend this to anyone looking for a primer!"
   },
   "XtineB":{ 
      "extra_info":"<b>Age</b> 18-24",
      "stars":"5 stars",
      "date":"6 May 2015",
      "title":"Liquid Gold!",
      "description":"I love love love this product! It feels so good on my skin and makes a clear difference. I am a mother and I am always tired but now my face doesn't have to be. As soon as I apply it, my face brightens up. It's like coffee for my face. I can't say enough good things about it."
   },
   "JenniPerez":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"2 stars",
      "date":"20 Dec 2016",
      "title":"Did not work for me. Its hard to find a good primer as somebody with dry skin so I tried this one and it did not do it. My skin felt hydrated and dewy for the first 2 minutes then its like I didn't apply anything",
      "description":""
   },
   "rosieroseg":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"5 stars",
      "date":"8 Jul 2017",
      "title":"YES",
      "description":"This stuff is so good. Instant refresher; brighter, smoother, healthier looking. Lasts all day. There are a number of products claiming to do similar things on the market but this one works the best for me and without any harsh ingredients or an irritating smell. It's super light-weight but works instantly. I use it over skin care, before makeup. Also appreciate that the packaging keeps it fresh and easy to use on the go. No need to dip fingers into it. I will definitely repurchase!"
   },
   "ginamariapizza":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"20 Nov 2014",
      "title":"Love!!!",
      "description":"This primer is great for winter! If you have dry skin this is the primer to try. Some days I am even able to use without a moisturizer underneath! Not to mention it has several ingredients that help promote healthy skin. If you are skeptical, buy it to try it! You won't be disappointed."
   },
   "angnjax":{ 
      "extra_info":"<b>Age</b> 25-34",
      "stars":"3 stars",
      "date":"27 Apr 2015",
      "title":"I'm not sure...",
      "description":"I really wanted to love this but I think it is breaking me out, sadly. It feels great on the skin, and def hydrates but after using this consistently for a few weeks my face is broken out and I never break out. It feels and looks great under makeup tho. I don't love the smell, its not bad but a bit artificial. I've heard people say it smells like coconuts but I don't smell that. Not a bad product, but maybe not right for my skin."
   },
   "MimiM3":{ 
      "extra_info":"error getting this field.",
      "stars":"5 stars",
      "date":"26 Dec 2016",
      "title":"Facial Gatorade",
      "description":"The lady at the store described this as \"Gatorade\" for your face! She was not lying, completely hydrating and makes my makeup look smooth and flawless! I have gotten so many compliments since using this by my friends who have noticed a difference! Love it!!!!"
   }
}}