{ 
   "product_name":"Stay All Day® Waterproof Liquid Eye Liner",
   "product_type":"Liquid Eyeliner",
   "brand":"Stila",
   "url":"https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818",
   "reviews":{ 
      "1234556789":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"11 Apr 2016",
         "title":"Not so waterproof",
         "description":"I love the look of liquid eyeliner so I was excited to try these from Stila. My eyes water, so I really needed something waterproof. For me, this wasn't the product. It was smeared and running within 30 minutes."
      },
      "ajlinski":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"2 Feb 2014",
         "title":"Overall: Good",
         "description":"I am incredibly picky when it comes to my makeup products, and I'm even more particular when it comes to my eyeliner. I had been searching for ages for just the right applicator and I have to say, the Stila pen is a great brush. It's the felt marker-kind of applicator and is super easy to use. Put it where you want it and it draws the line for you perfectly.\n\nThat being said, I have to critique it honestly. It's great for the first handful of uses, but I have noticed (after many repeat buys, mind you) that the tip of the brush dries out pretty quickly and then requires you to snip it off. It seems like a small complaint, but when the whole purpose of this eyeliner is the accuracy and easy of use of the precise point of the pen- it's kind of a hard problem to ignore. The middle of the pen continues to moisten and apply smoothy, but the dry tip is really annoying (I know: that's what she said).\n\nThe color is great and it does stay on pretty well, as long as you use eye primer. If you don't use primer, it does tend to smear if you apply it too close to where your lower lid comes into contact with your upper lid- resulting in that infuriating smear on your crease.\n\nI wish I could choose 3.5 stars, because it is slightly better than average and is still in the top 3 eyeliners I've ever used. However, with how quickly the tip dries and crumbles as well as its tendency to smear- I must rate this a 3/5. If you do not care about the slight smearing or the applicator dryness, go ahead and just buy this eyeliner. It really is a good product, just not exactly what I'm looking for at the moment.…read more"
      },
      "Emmy8228":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"2 Aug 2013",
         "title":"AMAZING",
         "description":"Okay, I normally never review products due to my laziness, but this is my favorite product on Earth! I have bought this countless times and although I have tried other liquid eyeliners, this is my favorite one and I always end up going back to it. It's my holy grail liner! I cannot stress how durable this is. I'm Asian and have literally no eyelids, there is a crease going right where my eyeliner goes, so you can safely assume that any other eyeliner would crease and smudge all over the place, but this eyeliner stays put through everything. I've cried in this eyeliner and my mascara has gone everywhere, but this stayed put. I use this product almost every single day and it's so easy to do a nice, clean, crisp wing with it. The tip is pointy, although it frays after a while, and very precise, and the color pay off is amazing. The only thing that I could complain about is that it runs out kind of quickly, or maybe I just use it too much. Using it about 5-6 days a week, sometimes 7, it runs out in about 2 months. I don't mind repurchasing it every time but I wish it lasted longer. For people who use less product and less frequently than I do, it will probably last a lot longer. There are no flakes, no smudging, and it comes off easily with make up remover or wipes. It doesn't irritate my eyes or anything bad I really just think it's perfect. I've used other liquid liners that take forever to dry, but this one dries very quickly and you don't have to worry about smudges. Anyway, I highly recommend this for beginners or anyone who just wants a good liquid liner.…read more"
      },
      "redsoxgirl89":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Jul 2010",
         "title":"RIDICULOUS...but in the best way possible.",
         "description":"Doesn't smudge, doesn't flake, dries super fast, thin line, thick line, the blackest pigment ever, and shaped like a pen so that anyone--beginner or not--can easily maneuver it.\n\nStop even thinking about other eyeliners, this is the only one that matters. GO BUY IT!\n\nP.S. Here is a pic of me wearing this eyeliner... 10 hours after I put it on. AMAZING!!"
      },
      "rahxrah":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 May 2011",
         "title":"great for monolids",
         "description":"I have monolids / very Asian eyes and I have been searching for years for an eye liner that does not end up all over my eye. Gels, pencils, other liquids... I think I've tried just about everything and this one wins! I recommend it to any monolid person or anyone looking for a long wearing eye liner."
      },
      "catsandcoffee":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"25 Apr 2013",
         "title":"Moss is the PERFECT green.",
         "description":"Obsessed with this liner. I've gotten several compliments, makes my green eyes pop, and I just want to wear it every day! This shade of green is so wearable, and JUST the right amount of green. Not too bright, not too dark... It's beautiful. Not to mention the product itself is ridiculously easy to apply - I can't wait till my current black liner runs out so I can purchase this one in black. MUST HAVE ALL THE COLORS. <3…read more"
      },
      "SarahSzo":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Oct 2012",
         "title":"Fantastic!",
         "description":"This is the best eyeliner I have ever owned. It lasts all day. I have oily eyelids and I have a lot of trouble finding eyeliners that will stay put and not give me raccoon eyes after two hours! I hate to say that I have slept in this eyeliner, but I have after a long night with friends and I still look normal in the morning! I will definitely be buying it again."
      },
      "tken7":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"28 Jun 2013",
         "title":"Hire more older women!!",
         "description":"I appreciate that Sephora hires some women over 50 who know what works for older women. It's intimidating to approach a beauty counter staffed by only 20-somethings. My salesperson understood my need for an eyeliner that's easy to use and does not smudge on older skin. To be honest, I'd been in twice before asking for waterproof liner and had been guided to make two purchases that did not live up to their claims. I guess I tried again at Sephora because generally I've been pleased with your service, and because there was a salesperson who looked closer to my age on the third try!\nWhy don't you cater as much to we beautiful older women in our 60's, 70's and 80's. Hire more older women please!!"
      },
      "mimig":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"22 Feb 2010",
         "title":"INCREDIBLE",
         "description":"I have been a Sephora shopper for many years, and I spend a lot (too much) on makeup. I have never thought so highly of a product that I made time to write a review. This product is worth the time.\n\nI have been looking for a truly long-wearing liquid eyeliner since high school. I've tried drug store brands and high-end lines; pretty much everything out there. All of the products either feathered, or flaked, or wore off, or had some other deficiency that made me continue my search.\n\nWell, I'm done searching, because this stuff is really incredible. Not only does it not smudge off or flake, it looks as perfect 10 hours after you apply it as it did the moment you put it on.\n\nWe had a ridiculous snowstorm in NYC the other day, and I was stuck walking about 15 blocks into the wind. I was being pelted with snow, and my face was soaked. This eyeliner remained flawless. I couldn't believe it.\n\nI am not the hugest Stila fan out there, but this product rocks. I'm never bothering with anything else."
      },
      "birdsbeesntrees":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"1 Feb 2012",
         "title":"Bold, Long Lasting Liner",
         "description":"I gave up on liquid liners years ago because they would always flake or peel off, and I would have half of my liner gone two hours into the day. This liquid liner was suggested to me by a Sephora associate, and although I was skeptical, I decided to try it out. I am SO glad I did.\n\nThis liner is AMAZING! It glides on smooth, and is easy to fix if your hand wiggles upon application. It does not fade or flake throughout the day. I've even fallen asleep a few times without removing my eye makeup, and when I woke up the next morning my eye liner was still nearly perfect.\n\nI bought this liner about a month ago and it's still in great condition. The tip is slightly dry, but it doesn't really affect the application, and it doesn't seem to be running out yet.\n\nOne word of advice: after applying the liner above the lashline, use the thin tip to line inbetween your lashes. It makes your eyelashes look full and thick, and your eyes will instantly pop."
      },
      "frenchie048":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"4 stars",
         "date":"1 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"not my favorite"
      },
      "MMN220":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 Dec 2012",
         "title":"So far it's my favorite!!",
         "description":"I bought this when it first came out, LOVED it instantly... and I loved the $15 price on it!! It lasted me 6 months of using it practically every day. I didn't need to reapply it, I didn't need to touch it up, it stays where I apply and doesn't flake off. I have only used the black... I tried the blue in the store on my hand and it immediately smeared. The black has a nice finish, it's not super shiny nor is it matte black. It makes nice clean lines.... the only problem is after using it for a while the felt tip needed a couple fibers pulled off of it. Nothing extreme, it didn't cause any problems but I didn't want an accident fuzz/fiber/hair to mess up my crisp line."
      },
      "StephCastorani":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 May 2013",
         "title":"Stila Periwinkle Demo",
         "description":"I can't get enough of this eyeliner! The pigmentation is phenomenal and the color is out of this world. I used it in a recent tutorial so check it out and see it in action!"
      },
      "Princic23":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"28 Oct 2013",
         "title":"Ok",
         "description":"I bought this two weeks ago and LOVED it! But, now it barely comes out. It's like it's already empty after two weeks. The color is great, the tip is super easy to apply and it stays on great too. But, I can't afford $40 a month for eyeliner. I even shook it several times and left it upside down and still it barely comes out. Dissappointed because I love the color and the applicator. :-("
      },
      "Citygal87":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"16 Jun 2015",
         "title":"Meh",
         "description":"Pretty good product for those with non-oily, non-monolid, non-teary eyes, but mediocre for those without.\n\nPROS:\n-super pigmented formula; very black\n-crisp lines, nice texture to formula\n-felt tip firm but non-abrasive\n-beautiful look/feel upon first application\n\nCONS: [oily, mono, teary eyes]\n-teary/oily outer corners melt, leave residue/transfer\n-inner-to-mid section of eyelid fades noticeably with wear [monolids]\n-transfer to undereyes\n-NOT waterproof"
      },
      "VinaBabe":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 Mar 2014",
         "title":"Absolutely Love it.",
         "description":"If only my applying eyeliner skill was as good as my cooking, my life would be so much easier haha Thanks to Stila Stay All Day I am now can cook and apply this on at the same time lol.\n\nAll joking aside, I love this product. It's like love at first line for us and I have been a loyal customer since. It's super easy to apply!\nThank you Thank you!!\n\nXoXo"
      },
      "CassManzano":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Dec 2015",
         "title":"Bomb",
         "description":"This eyeliner is Bomb af, This liner Hunty will not budge and it truly is Waterproof and Smudgeproof . One day I was crying mad hard because there's too many F Boys in life, and guess what? My Liner was still Slaying and cutting people"
      },
      "krissykay":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"10 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Great!!"
      },
      "lovewish":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Aug 2011",
         "title":"Love it !",
         "description":"I love this eyeliner ! It dries quickly and doesn't smudge. Definitely a wear-all-day liner. Very easy to apply and very good for its price."
      },
      "MashaMich":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"13 Oct 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1312719+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Dark Brown",
         "description":"ACTUALLY STAYS ALL DAY"
      },
      "agigid":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"18 Sep 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1579275+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Midnight",
         "description":"great color selection"
      },
      "KKabob":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Oct 2013",
         "title":"The Best Eyeliner You Will Ever Own",
         "description":"This eyeliner literally is the best liquid liner you will ever use. It's ridiculously easy to use and is perfect for any kind of look. It glides perfectly and lasts forever without smudging (unless you seriously rub it). It literally will never move and will give you the most perfect wings you could ever ask for. Buy this liner. It is worth it."
      },
      "samola":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Dec 2009",
         "title":"The BEST!",
         "description":"This is the BEST eyeliner of all time. It's so easy to get a perfect line, thick or thin and it's super black. I am obsessed and it's amazing."
      },
      "snowqueen14":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"26 Mar 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"simply the best"
      },
      "hersecretworld":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"23 Oct 2013",
         "title":"really will stay ALL day",
         "description":"I was looking for a long lasting eyeliner, because mine tends to start fading and smudging by mid-morning. This has stood up to every test: exercise, humid weather, watery eyes, tears, napping, etc! There is only one problem with this eyeliner: if I don't let it dry enough, it will start sticking to the skin just above my eyelid crease, which is not only annoying but leads to smudging. I've never had to specifically let an eyeliner dry before, so it's kind of odd. But I just use that time to carefully do my brows and eyelashes, so it's not a big deal to me."
      },
      "hotmama83":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Feb 2014",
         "title":"Perfect point",
         "description":"Love this liner & shades it comes in. The black is a very true black even over light or glitter that might lighten it! I definitely suggest buying multiple shades like the dark navy blue & the forest green to spice up your liner collection without goin really out there!"
      },
      "yeahshelbyk":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Jan 2015",
         "title":"Holy Grail",
         "description":"I've been using this product for close to two years now and I can absolutely say that this is one of my HOLY GRAIL beauty items. I wear a wing literally EVERYDAY, and I'm always up to trying all different kinds of eyeliner whether it be gel, liquid or felt. I've gone through about ten of these in the past two years and I know I can always count on it to produce flawless results.\n\nI work in a grooming salon where it gets hot, dogs splash water on my face and this does NOT budge. I've even worn this swimming, and to Firefly Music Festival where the weather is ridiculously hot and it does not transfer or come off! I definitely recommend this eyeliner to everyone!"
      },
      "SkyyeNYC":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"30 Dec 2014",
         "title":"Love!",
         "description":"Great liner!! Hard to find one that does not irritate my eyes and have them red by end of day but not this one! My eyes are still white and liner still in place-stays put really well."
      },
      "Sammybaar":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"14 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"FANTASTIC"
      },
      "Staceypearl":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"11 Mar 2014",
         "title":"The worst!!",
         "description":"How did this eyeliner get so many good reviews. Maybe people don't know what good eyeliner actually is.\nI tried this today and it was transferring on to my lid! On top of that it was sticky. my eyed are kind of hooded and I could feel it sticking every time I blinked. The sephora collection Eyeliner is way better plus its matte while this one isn't completely matte."
      },
      "AubreyK20":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"1 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Best liquid liner I’ve ever used"
      },
      "soe2":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"6 Apr 2012",
         "title":"Everything BUT long lasting",
         "description":"The first several uses are great, but the color intensity fades after two weeks of regular use. Not a great value if you need to replenish every two weeks."
      },
      "flash":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"12 Nov 2015",
         "title":"Stays on all day",
         "description":"I use this over a pencil liner. You should dab it on and not run it in a straight line. Get as close to the lash line as possible and you will have a terrific liner all day long."
      },
      "Birdsgottaflyy":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"1 star",
         "date":"22 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Thought I’d love this. Wore it once for a few hours and it was alright. Wore it the next day to Disneyland and by early evening it was everywhere. Do not recommend."
      },
      "Sandoval":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Feb 2015",
         "title":"BEST F****** EYELINER",
         "description":"I've literally been buying this eyeliner for like 5 years and it's the best one out there. Forget that Lancôme bulls***, or those gel eyeliners, or whatever else kinda eyeliners there are. I put this eyeliner on in the morning and it will stay until i wipe it off. It's the best! Def worth the money!"
      },
      "crybaby38":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 Apr 2012",
         "title":"20 min of crying and it DID NOT COME OFF!",
         "description":"So I got into an arguement with my boss today, I cried for about 20 min, AND NONE OF THE EYE LINER CAME OFF. I have used countless liquid eye liners, but this is by far the best thing that has happened to me. I have used: Bobby Brown, Shu Uemura, Lancome, Yves Saint Laurent, Benefit, Sephora brand, EVERYTHING! For $20, this is totally worth it, and I highly recommend it."
      },
      "cleesl":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"1 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Holy Grail for now"
      },
      "lovelivelaugh":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Aug 2013",
         "title":"I tried posting this review before but it didnt upload.\n\nI purchased this in Indigo and believed the color would be brighter due to the brighter blue packaging but honestly, the color is exactly as it's name suggests. It's Indigo; a very, very dark blue. More midnight blue than Cobalt. Below is a swatch of it along side Lancome's Artliner in Navy. Navy is more cobalt.\n\nOverall, I actually really like my indigo eye liner, It's a great alternative to my daily black cat eye. The blue is very subtle. You can tell it's blue mostly in a close range. From a distant it looks black on my complexion",
         "description":""
      },
      "elindsay95":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Mar 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Best eyeliner"
      },
      "amosner":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Jul 2013",
         "title":"old faithful",
         "description":"i have SEVERE hyperhidrosis, so no matter the weather, no matter what i'm doing, i'm sweating. as a makeup enthusiast (and human being), this is very unpleasant. before i discovered this product, whenever i would wear eyeliner, it would smudge. granted, i might have just not been using the right kind, but still. i have gone to all-day summer concerts outside and danced my butt off while doing a little day drinking, and this stuff has stayed on for 12+ hours looking FLAWLESS. ON ME. which is saying something, because of the sweating thing.\n\ni recommend this eyeliner to everyone, and they always thank me after they finally try it. this thing is unbelievable, i don't have enough amazing things to say about it. not only is it super waterproof but super black, which can be difficult with eyeliners - you know what i mean, trying to get a dark, black line and getting a sort of lighter colored layer of...something on your skin. not with this. furthermore, the felt tip makes the application very very easy, although when you start running out of the actual eyeliner liquid, it becomes harder to use said felt tip. whatever...just buy a new one!\n\nanyways, buy this. end of story."
      },
      "magicalgirl":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Feb 2014",
         "title":"Worth every penny!",
         "description":"This stuff is the best. Long lasting, doesn't come off until you take it off. It is waterproof to the point where you can wear it on a rainy day, I've even cried before while wearing it and it doesn't run (though it will it your face gets soaked, like in a pool or something). I usually buy the black and one tube will last me about 3-4 months of daily application. This time I also bought the turquoise and the periwinkle. The periwinkle really impressed me it looks amazing, but the turquoise didn't really show up. I think the turquoise would look better on a darker skinned person so the color will really pop."
      },
      "poundpuppy":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"12 Apr 2017",
         "title":"This is the only liner that stays on my extremely oily lids. I've tried all primers but none of them work. The way I keep mine from budging is using milk of magnesium. Just pat a tiny amount on a cotton pad, let it dry good, and line away!",
         "description":""
      },
      "yen13":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"25 Dec 2016",
         "title":"New formulation?",
         "description":"I received the Stila eyeliner in new packaging (gold lettering) and I think they switched the quality of the formula. I have been using this since I was 15 and I had always been my go to, unfortunately the one I just bought is watery and has little to no pigment even thought it is labeled as \"intense black.\" Totally returning this and buying some other liquid eyeliner."
      },
      "Sarahskin":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Apr 2015",
         "title":"Best.Liner.Ever.",
         "description":"I never write reviews, but I feel compelled to let people know that this liner is AMAZING! I have tried, unsuccessfully, to use more liquid liners than I can count. Expensive ones, drug store brands, all of them. I don't have the steadiest hand, which makes drawing on a perfect cat-eye especially difficult. This one's different. It's so easy to apply, dries quickly, and stays put until you remove it with makeup remover. I'm so happy I finally decided to try this.\nI'm able to create a subtle cat-eye, with thinner lines, or a dramatic look with thicker lines. Nearly foolproof. If I need to clean up the wing a bit, I just use a qtip (damp with water or makeup remover, or dry) to perfect it. I use the dark brown, which basically appears black on my fair skin.\nSeriously, if you find it impossible to use liquid liner, try this one by Stila! Total game changer."
      },
      "fashun":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Jan 2011",
         "title":"I'm addicted to the cat-eye look, but my eyes are so watery that I have a hard time managing it. I had been looking for a good waterproof, felt-tip, liquid eyeliner for a long time so I'm ecstatic that I stumbled across this little gem. I use it every day and it lasts indefinitely until I decide to take it off. It's a fantastic investment considering how inexpensive it is. I will continue to use this until I grow out of this little phase of mine...if I ever do. I completely recommend this product!",
         "description":""
      },
      "daisylove03":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"19 Apr 2011",
         "title":"Amazing liquid eyeliner",
         "description":"I have a slight monolid with a small crease in the eyes sometimes, so it has always been a problem finding the perfect eyeliner that will not crease or smudge when I blink. I have never used a liquid eye liner before, but after hearing all the rave about this product I decided to try it out.\n\nTo my surprised it works beautifully, it does not crease, it glides on really well with the applicator, it is water/smudge proof, comes of very easily with make up remover wipes (you would think it being a waterproof product that it would be hard to get off, but nope! =) )\n\nI would have to give it 4 stars instead of 5 because during the application it can sometimes give a cracked look, but all you have to do is wait for it to dry a little and reapply over and it will be fine.\n\nI have a video review on this product for further information\n\nHope this was helpful, thanks!"
      },
      "rubymay":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"25 Jun 2011",
         "title":"Best Eyeliner Ever!",
         "description":"I have tried almost every eyeliner out there and this one really lasts all day. It doesn't flake either. Many of the pencil ones wear off and smudge throughout the day. This one goes on and stays. I highly recommend it."
      },
      "MoMerrell":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Sep 2015",
         "title":"LONG Lasting and Lasted Long",
         "description":"I purchased this on 1/6/2015 and today 9/16/15 I realized that it is at its end. That's an entire 9 months with this liner!! I wore it almost every day, literally. I cleaned the tip off every couple of week and always kept it stored vertical.\n\nI was nervous about the felt tip at first but when I got used to it's fluidity I fell in love! Did it last ALL day? NO\nI wear contacts and have dry eyes so I do rub my eyes on those dry days and of course no matter how much I try to NOT rub off make-up, I do anyway BUT I've gone days where I can go from work to happy hour and not need to apply more liner so it does have some staying power!! I may try Kat Von D's one but when I find something and like it, I see no reason to switch and I don't need two liners.\n\nI am definitely purchasing another one and I'd tell a friend about this one if they asked about a good liner."
      },
      "jewelsnoel1977":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"5 May 2013",
         "title":"My favorite eye liner!",
         "description":"I have tried all kinds of eye liners and have had the problem of the line sticking to my upper lid, or just not lasting. This eye liner is the best I've found yet! It goes on and stays on! If you're teary eyed or cry, it still stays put. Love it! Thank you Stila!!"
      },
      "Mogget":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Jan 2016",
         "title":"Lasts for DAAAAAYS",
         "description":"I was a bit skeptical when I bought this, but nothing ventured, nothing gained, right?\nI have slightly hooded eyes, which has made finding an eyeliner that lasts through the day, EXTREMELY hard. I've tried gels, pencils, and MANY liquids, but they all smudge beneath the awesome might of my hooded lids, or else crack off during the day.\nTried Stila on a whim, and ooooohhhhh my gosh. Not only stayed all day, but stayed looking fresh all day. But it's easy enough to wash off at the end of the day too.\n\nTL;DR - If you have hooded lids, you should try this liner. It works great."
      },
      "kjh96":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"3 stars",
         "date":"27 Dec 2013",
         "title":"Favorite liquid liner",
         "description":"This liquid liner isn't magic but it's pretty darn good. I wear this through my school days and it stays on the entire time without budging. For oily lids, it does transfer the tiniest amount onto an overlapping part of the eyelid.\n\nThe main reason I am giving it 3 stars though is because of the tip applicator. After 20 to 25 uses, it starts to deteriorate and it's harder to made defined ends.\n\nThe claim that it is waterproof is true up to a point. It does stay on my lash line all day and some of it will still remain on the original line after washing my face with my cleanser. However, at the outer corner of your eye where it may water, I have seen that it's usually gone by the first 2 hours of the day."
      },
      "SSC1":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"15 Jul 2016",
         "title":"ehh",
         "description":"I honestly love love LOVE this eyeliner. This has been my go too for years and I can say I've probably bought around 8-9 of them in total. Sadly my favorite eyeliner has changed. Although I can appreciate Stila making the liner have a thinner point to help make a shaper wing it also means the tip dries out ALOT sooner. Why must you hurt me like this Stila? Why?!"
      },
      "pamy92":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"29 Mar 2011",
         "title":"stila eyeliner black waterproof",
         "description":"Since summer is coming up, I decided to get a waterproof eyeliner. When I visited the store, I tried the dior eyeliner but it wore out after a second so the employee referred me to this stila waterproof eyeliner.\nSo far it has been the best one...it stays all day and I even can go swimming without worrying about my eyes to smear all out.\nThe brush is very thin and precise, and it is incredibly easy to apply."
      },
      "Teyz2":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"3 Dec 2012",
         "title":"Perfection",
         "description":"I must say at of all of the eyeliners this will have to my all time favourite. Very easy to use for anyone who has trouble with using liquid liner. smudge proof and sharp!\n\ncheck my video between 4:00 - 4:20 to see how I use this amaaaazing product"
      },
      "mmtorres":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"6 Feb 2013",
         "title":"Excellent staying power",
         "description":"This is the best waterproof liquid liner on the market. It makes a smooth, thin line with ease. Drawing a cat's eye is a breeze with the tip. It never smudges and dries quickly. Plus, it doesn't irritate my sensitive eyes. It's worth every penny."
      },
      "strawberrykk":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Nov 2013",
         "title":"This is the only eyeliner I've tried that doesn't smear for my monolid eyes. Love it!",
         "description":""
      },
      "madeupworld7":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Apr 2016",
         "title":"holy grail liner",
         "description":"This eyeliner is a true black. The applicator is sharp so it is good at making those sharp wings. A lot of people are complaining about it drying out quickly. This happened to my 1st one too but I realized that it was because it wasn't getting closed all the way. When you close it MAKE SURE IT CLICKS SHUT. If not it can look closed and really be open still so watch out for that. Other than that this eyeliner is perfect and the staying power is amazing."
      },
      "kimbox":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Nov 2014",
         "title":"best liquid liner!",
         "description":"This is easily the best liquid liner I've tried and is worth every penny. I love this because it comes in multiple colors. I like to wear dark brown for an every day look, and I'm happy to see they have various colors. Out of the box, the liner applies very sharply. I have used this product every day for the past 5 months. The tip has frayed a bit, but I still get a very precise line. It's also very easy to make do winged tip eyeliner!\n\nThis also has amazing staying power. I do wear my UD primer potion under every day. After a long day of work, a splash of water on the face, and a long workout, the liner is still on! It does come off easily with eye make-up remover though :)"
      },
      "kelbad":{ 
         "extra_info":"<b>Hair color</b> Brunette",
         "stars":"2 stars",
         "date":"31 Oct 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"New formula is horrible"
      },
      "sofia678":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"12 Apr 2014",
         "title":"Tip wears after a few uses",
         "description":"I was rather disappointed by this product and won't purchase it again. The formula itself is great as well as the colors -I have the chocolate brown and dark green and they are both gorgeous. The main problem is that the tip wears/frays after only a few uses so it becomes very hard to draw a precise line. Such a shame because I wanted to invest in more colors!"
      },
      "nash21":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"8 May 2014",
         "title":"Best best best by far",
         "description":"My review is more about how easy this is to use than how long it lasts. ( it lasts all day and evening and night on me!!!) I have tried all manner of liquid, cream, gel liners with all types of brushes, skinny, fat, curved , angled etc. I also have quite hooded lids so the flick always looks stupid on me. Not with this. I still cannot believe how ridiculously great this pen is. I guess the key is in the point. It's sharp and unwavering. No bristles come apart, it doesn't go soft and wobbly. It allows you to do amazing liner looks and keeps the line sharp and clean. I know it's not me, because I've tried over the years with no success. And the colour is consistent throughout the line, dispenses the perfect amount......what else can I say? This pen is perfect."
      },
      "becky93":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"18 Aug 2012",
         "title":"I got this about a month ago and when I tried it out in the store I was blown away. It was dark, velvety-matte, and dried instantly. When I brought it home however it didn't seem AS dark but still good enough to keep because the brush and the instant drying was great. I think I need to shake it up a bit more than I already do and it'll be fine. When it does fade, it just fades instead of flaking off or anything like that. Overall I still haven't decided if I will repurchase since I am more of a gel/cream liner girl, but as far as liquid liners good, this would be one of my top favorites. It doesn't burn like some cheaper liners do.",
         "description":""
      },
      "PassionPit":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"6 Oct 2012",
         "title":"THE BEST",
         "description":"I have monolids where my fold meets my lashline. This means my eyelids constantly have skin rubbing against skin and smudging is almost always inevitable. I've tried all the waterproof smudgeproof pencil and gel liners out there but none were successful in giving me a long lasting line through the entire day. Mac's gel eyeliner came close but would eventually start smudging.\n\nThis was the first liquid eyeliner I've ever tried but I don't see any reason to switch to another after trying it since it's PERFECT. It NEVER smudges. I recently wore it to a rock concert where I was dripping in sweat and constantly having hands and hair in my face. After the concert was over it was pouring rain outside and I got soaked. Once I returned home my eyeliner still looked PERFECT. I was amazed that the eyeliner could withstand all this and not smudge. It's seriously amazing. I also like the thin tip for a nice clean application since I usually go with a winged eyeliner look. If you have problems with smudging I definitely recommend this one!!!\n\nnote: I usually use Too Faced shadow insurance primer as well which helps with the smudging."
      },
      "caitlingt":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Feb 2014",
         "title":"Hands. Down. Best Liquid Liner.",
         "description":"This is my go-to and all-time favorite eyeliner. I SWEAR by this stuff! I have tried so many other liquid liners (drugstore, name brand) and this one is still #1. I use it in Black, which is a beautiful rich, jet black. Super pigmented. This liner lasts all day and even into the next morning (totally guilty of sleeping with makeup on) and it doesn't budge. I love how easy the application is with the felt-tip… I can get some pretty amazing lines with this baby. Formula doesn't run or bleed. After time the tip tends to dry out, so I just very quickly dip the tip in a bit of water. Just my little cheat to get the last few applications out of the tube. Can't tell you how many tubes I've burned through, and I will continue to religiously."
      },
      "ilikepho":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"13 Jul 2015",
         "title":"Best of the best!",
         "description":"After putting it on and waiting 10 ten seconds for it to dry, no smudges, and it will last all day. Great for Asian eye, I used to have a problem with eyeliner always ending up on the lower part of my eyes. This solves the problem!"
      },
      "ChrisW1":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"10 Jul 2010",
         "title":"FANTABULOUS!",
         "description":"Ok, I never write reviews, so obviously it must be something really special! I think I've tried EVERY eyeliner there is on the market, spent 100s of dollars, and have NEVER been satisfied. I wear eyeliner everyday and this is hands down the BEST! I put it on this morning, hung out by the pool, took a nap and guess what, it hasn't smudged a bit! I am going to buy more colors of this product because it does exactly what it says it does. Easy to use, long wearing and waterproof!"
      },
      "amberrn":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"20 May 2012",
         "title":"I just recently purchased my 2nd tube of this stuff. Best liquid liner out there. I love the applicator, goes on smoothly, &amp; doesn't smudge until you want it to!",
         "description":""
      },
      "Lara19":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 May 2014",
         "title":"Best Invension Ever",
         "description":"I own the Black and White Liquid Eye Liner . This product is the best that i have ever experienced TRUST me!! It is sleek and applies smooth stays on all day even through night and comes off when you need it easy. A MUST BUY!"
      },
      "luvtraveling":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Aug 2014",
         "title":"Very waterproof",
         "description":"I was caught in a summer downpour in Atlanta in July. The rain was cascading down my face. I ran inside and straight to the bathroom mirror to see the eyeliner disaster. To my surprise, my eyeliner was perfect. No streaks, no running. It was a miracle. Granted, I avoided touching my eyes at all during the rain because I thought it would make things worse. So don't touch and you'll be fine.\n\nI've tried Lorac, Lancôme, 24 hr., Shiseido, Chanel, and Shu Uemura. This is the best for its sharpness, dark black pigment, and staying power. Lorac is very fine but not as pigmented. Lancôme is better for dry lids. Shiseido and Chanel are dark and thick but they flake off. (My husband asked me why my eyeliner line just stopped. It had flaked off. )\n\nThe tip is between a brush and a felt tip. You just shake it before you open it. I feel it goes on evenly and always me to touch it up or go over lines without it flaking.\n\nI bought an extra Stila so that I won't ever be without one. I'm not sure how long it will last but this is it for me."
      },
      "meaganmichelle":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Mar 2014",
         "title":"Love Love Love",
         "description":"I'm always one to bounce between different brands when I run out of a product because I love trying new things. But these liquid liners may be my new go to. I used to use MUFE's liquid liner, but I switched to these when it started getting clumpy towards the end of the bottle. These don't clump, they go on so smooth, they come in crazy cool colours, they aren't streaky. I own Black and Midnight and they are both so great. 10/10 would recommend!"
      },
      "Annaes88":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"15 Jun 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"The best eyeliner!!!!"
      },
      "AshVapor":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"17 Jul 2012",
         "title":"This Was GREAT :)",
         "description":"I bought this, knowing I'd be satisfied after already\nsampling at the store.\nMy entire body is sensitive, so I had to be REAL careful\n& pic something that wouldn't cause my skin to break out\nor make me teary eyed(like past liquid eyeliners)\nThis one REALLY worked out for me, no cons at all!\n\nI posted an image here to show y'all how it resulted my\nfirst time wearing it. :)"
      },
      "katmarko":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"30 Oct 2014",
         "title":"Did Stila change their formula?",
         "description":"Don't get me wrong, I love this eyeliner. I've used for for 3 years straight and it was my holy grail! But the last two pens I've bought seem like they aren't as great anymore. This eyeliner used to be SO black and make a very opaque solid line. Now I feel like it's watery and transparent and I need a couple layers. It's still a great eyeliner, but not as good as it use to be (unless I've managed to get a couple bad pens)."
      },
      "cgroves":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"23 Jul 2011",
         "title":"Fantastic",
         "description":"Great for eyelids with some lines. Stays on well and easy to use"
      },
      "mirsward":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"7 Nov 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Holy Grail Eye Liner"
      },
      "HHGMP":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"1 star",
         "date":"30 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1312719+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Dark Brown",
         "description":"Not waterproof"
      },
      "divamsm":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 Apr 2016",
         "title":"spectacular!",
         "description":"I really love these Stila liquid eye liners.  The go on easily, and don't move!  I use the black or grey ones.  I am disappointed that it doesn't come in any shade of purple though.....really?\n :("
      },
      "hiyahayah":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"21 Nov 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"This is the first liquid eyeliner I ever bought and I really do like it a lot. The brush tip is very precise and easy to manage. The black color actually comes out sharp, bold and, most importantly not like a watered down gray. Also, once it's applied and has dried, it stays on. As someone who touches her eyelids subconsciously I don't have to worry about it flaking off. I have never really worn it an entire day but for the hours that I have, it never faded or chipped. Granted, I'm pretty sure my eyelids are quite dry. The only issue with this eyeliner is that it isn't waterproof AT ALL (which is sort of a big problem because waterproof is part of the product's name but whateva...) If you have oilier eyelids, are going out in the rain, or cry a lot, this is NOT the eyeliner for you. I found that when I messed up my wings or something I could literally take a wet Kleenex and wipe it off. With all this in mind, I do think the price could go down a little bit but overall I am pretty satisfied."
      },
      "luxque":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"26 Apr 2015",
         "title":"AMAZING",
         "description":"I tried all kinds of eyeliner. My eyes are really sensitive and i my eyes randomly start crying through out the day. This is the only eyeliner that lasts for a while along with giving me a precise application. it literally takes me a minute to do my eyeliner. But obviously, if you intentionally rub it, it will come off"
      },
      "jecies":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Jun 2016",
         "title":"Long Wear",
         "description":"This eyeliner is the only one that works for me. I have hooded eyes and this is the only eyeliner that stays on my lash line and not on the middle of my eyelids. If you have hooded eyes, and prefer the look of lined lash line, please try this, you won't be disappointed."
      },
      "h3llc4t":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"25 Aug 2014",
         "title":"Be sure to manage your expectations.",
         "description":"I was in need of a good liquid liner for my daily thick wings, and asked my SA for recommendations for a matte, opaque product. Like many others I'd heard great things about this liner so it seemed like a safe bet. Unfortunately the hype worked to my disadvantage, as I expected more from this liner than it really could deliver.\n\nAll things considered it's not a bad product, but opaque and matte it is not. I used it on bare lids as well as over UDPP and UDPP/shadow. Every time it had a glossy finish and needed a couple of passes to be truly opaque. Strangely enough it's easy to get opacity from swatching but it streaked on the eyelid itself.\n\nThe wearability is acceptable but didn't really fall into the \"stay all day\" category for me; on my non-oily lids I could get about 10 hours of wear before it looked faded and patchy. Set with shadow, the liner lasted 12-14 hours with reasonable coverage. Application was easy, although the felt tip began to disintegrate by my 5th or 6th use.\n\nThis is a decent product for some uses. It would be good for subtle or natural looks and I hear that the colored versions of this liner are exceptional. You can get some respectable weartime after setting with a shadow, but for this price point that's a bit disappointing. For dramatic or matte looks there are other products that perform much better."
      },
      "sumie":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"8 Jun 2013",
         "title":"Favorite liner",
         "description":"I love this liner! It's not too watery and easy to draw with. I've tried the Makeup Forever pot and Kat Von Dee's tattoo liner. The first is too thick and the other too watery. I love the fact that this liner stays put until the remover is applied."
      },
      "Erika1999":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"13 Jul 2016",
         "title":"great!",
         "description":"for some reason I think this is either really great or just good every time I use it, the tip is very soft and makes it easy to glide on the eyeliner, and how ever sometimes I find it more difficult than others to apply. Usually it really does stay all day and I have accidentally slept with it on (yikes!) and I'm a face sleeper but my eyeliner looked great, or i'll accidentally rub my eyes and it'll stay on, but sometimes it kind of chips off a little for no appearant reason, but overall this is the best eyeliner I have been able to find, I just feel like there has got to be something better out there, but I do love it"
      },
      "TLM5":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"12 Apr 2013",
         "title":"Great for Oily Eyelids!",
         "description":"I'm on my 3rd \"pen\" of this eye liner and it never fails to impress me. I have oily eyelids and every other eye liner I've tried (even so called waterproof ones) did not last more than a couple of hours. I can put this on in the morning before work and it's still there by 10:00 at night when I wash my face. The tip allows you to draw a very thin line or a wide one. At my age, I go for a thin line at the outer corners of my eyes. The Dark Brown color is just dark enough without looking harsh. Great product that I hope Stila never changes!"
      },
      "sephora88":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"2 Jan 2015",
         "title":"No longer waterproof, smudgeproof and long wearing",
         "description":"I have a super oily eyelid and after trying so many products, I found Stila. It has been almost 3 years now that I use the waterproof Stila eye liner every single day. I fell in love with the product. However, my recent purchases disappointed me so much. I think the company has change its ingredients or something. The eye liner is no longer waterproof :( It smudges after an hour. I bought another one hoping that the new one would be better, but it's the same. Looks like it's time for me to try other brands."
      },
      "ciprianna":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Dec 2014",
         "title":"This eyeliner was obviously sent down by Jesus Christ himself, because this eyeliner is PERFECT. There's literally not ONE bad thing I can say about this product.",
         "description":""
      },
      "MsUnnatural":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Aug 2013",
         "title":"Weathers the Storm",
         "description":"I'm deployed on a ship in the middle east. I woke up with this still on from last night, some small patches were missing. Instead of cleaning it off, I just re-applied lower lid only. Went and ran 4 miles on a treadmill in 85 deg 100% humidity gym. I sweat like a horse by the way. Then the rowing machine for 1/2 hr in a space that can only be described as a steam oven. Then back in my room, I started feeling bad about the email I got earlier from my guy-finally accepting it's not what I thought it was--and had a really good cry. I looked in the mirror after all this and my eyeliner was perfect. You decide."
      },
      "hag666666":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 Apr 2017",
         "title":"Best eyeliner on the market",
         "description":"Easy application - consistent flow and the tip makes for thin precision or building thicker lines. Also great for the perfect cat eye look. Pair this with smashbox 24 hour shadow primer and this eyeline ain't leaving your face. I've slept it in and woken up pretty much looking like it was pretty fresh."
      },
      "pachangko":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"31 May 2014",
         "title":"The aren't all the same",
         "description":"I have the black and it is amazing very pigmented and it lasts all day. I bought the teal, but it was very dry and so when I took it back to the store I realized that some of the darker colors have a ball bearing in them to shake the color down and some of the lighter more bold shades do not. I returned the teal for the emerald, because it contained the ball bearing. My advice would be to shake the tester to see it it has one and don't buy the ones that don't cause they are dry."
      },
      "kblu":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"28 Jul 2013",
         "title":"Stilla keep buying it!!",
         "description":"This is a great product- it does not clump or smudge. Not exactly waterproof i.e.;if you swim, you need to reapply it when you are done. The blue/grey is very light but perfect for hot days when you don't want to look so fussed over and made up. Also love the brown- the colors have changed recently and I cannot find some of the ones I liked from 6 ms ago- maybe because the Sephora in my town is very, very small, so selections. I think you won't be disappointed! Also- I have VERY sensitive eyes, and this product has not caused any problems!!"
      },
      "Tartbeauty":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"13 Dec 2013",
         "title":"Not worth it",
         "description":"I am a Beauty advisor at a drug store, and got to try this for free. The first few times I used it it was awesome. It glided on like a dream and stayed on. Then the next time I used it, it was dry and the product was barely coming out. It went on my lid only in certain parts, not gliding along in one line. Someone said to store it pointing down so the product would flow down, which I tried, and didn't improve it. If I was a customer I would return it. Don't waste your money!"
      },
      "jills18":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Jul 2016",
         "title":"in love with this!!!",
         "description":"I love love this eyeliner!!! I've been using this eye liner for a couple of years now and I am never using anything else except there is something better. So easy to use and if you want a perfect winged eyeliner then this is the one! I use this for work and I'm a cocktail server I usually work for about 12-16 hours on a weekends and this eyeliner stays on!! Try this one and you'll never go back. I would say it's so much better than the Kat Von D tattoo liner."
      },
      "nyx90":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"3 Aug 2013",
         "title":"Great Eyeliner, Doesn't Last Long",
         "description":"I bought this eyeliner in black and I loved it when I first got it. It's certainly long wearing. I don't know how waterproof it is because I usually removed all my makeup with a waterproof makeup remover. It also dries in a satin finish with a sheen that I wasn't a fan of. I prefer matte.\n\nI was definitely impressed by its staying power. I work long days and nights and in the morning, my eyeliner would be perfectly intact, which is exactly what I want from an eyeliner.\n\nI give it 4 stars because it didn't last that long! I only used it on weekends because I don't wear makeup during the week and it dried out pretty quickly. I also used another pen product like that from Stila and the same thing happened so I just don't buy Stila pen products anymore."
      },
      "mayarc87":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"30 Oct 2014",
         "title":"good formula for 1 month",
         "description":"I loved it for the first month. On the second month the tip stopped getting \"color\". Only the sides work now.\nI love the formula, long lasting and smudge proof. Hard to take off though.\nBut I cannot keep buying a $20 eyeliner every month. There others out there."
      },
      "scesear":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Oct 2013",
         "title":"Favorite!",
         "description":"Best eye-liner I've ever used! I'm very loyal to this product.\n\nThe felt tip is great for getting the precise line you want, and the liquid dries quickly (but not too quickly in case you need to redo). The color is bold and definitely makes your eyes pop.\n\nSomewhat long-wearing, may need some touchup at the end of the day.\n\nIt's great for cat-eye, a bold look, or just everyday liner, and I always get compliments on it :)"
      },
      "krystald":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"27 Dec 2012",
         "title":"Perfect liner",
         "description":"Best eyeliner I've used. It does come off easily with my AmorePacific facewash, but doesn't budge during the day... even through the times when I'm outside in the snow and my eyes start to tear from the cold. As for those who claim it isn't very black, I'm certain they just aren't shaking it before use. So give it a little shake and you're golden!"
      },
      "MsMandiPandi2u":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Apr 2016",
         "title":"can't find anything to compare too",
         "description":"The best cat eyeliner I've ever had. I've tried many other products but nothing compares to this."
      },
      "CrimsonRed":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"23 Apr 2014",
         "title":"Not a beginner tool",
         "description":"I don't know about easy application - seems pretty impossible to me. Definitely stays on - if you smudge it, requires makeup remover :) I think for those who know what they are doing with the eye liner it maybe a good product, but I have not achieved that level of expertise."
      },
      "goodgoodthings":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Jan 2010",
         "title":"It took me a really long time to find a good waterproof eyeliner. I finally found one at MAC, (liquidlast) but the application brush It came with is really hard to handle unless you are really good at applying eyeliner. Now I’ve been doing the same black cat eye since I was 18, So I’m pretty good at it, but the brush allows the liner to clump easily and doesn’t really allow for precise lines unless you are using an angled eyeliner brush. Here comes the Stila waterproof eyeliner, probably one of the best waterproof eyeliners I’ve used. With the pen like tip, it makes for a really easy application and has lasted me all day while other waterproof eyeliners have failed. The Stila waterproof just replaced the MAC as my favorite eyeliner.",
         "description":""
      },
      "BeautyImpaired":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Apr 2015",
         "title":"Great easy-to-use liquid eyeliner",
         "description":"Easy to apply, precise, goes on opaque and stays where you put it until you wash it off. Also easy to wash off with just soap and water."
      },
      "sacsac":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Jul 2013",
         "title":"THE BEST EVER!!",
         "description":"This has been the best eyeliner I have tried. I have very oily eye lids and there is absolutely no transfer, no smudging, no wearing off. Definitely the best!!! Love it!!!!"
      },
      "rpyang":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"28 Nov 2012",
         "title":"After reading all the great reviews, this eyeliner is disappointing. The tip is way too soft, and not enough color comes out of the tip. The color isn't very saturated, and I spend 10 minutes more than I usually do on my eyeliner because the line isn't consistent enough. Not the worst eyeliner I've used, but definitely far from the best.",
         "description":""
      },
      "luvfran13":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Feb 2016",
         "title":"best liquid eyeliner",
         "description":"It's easy enough for everyday use. it has a good control because of the felt tip applicator. Since the felt tip is firm, it is easier to create a winged liner look and has less room to make a mistake. I find that the product doesn't transfer to under my eyes(I have semi oily eyelids). It lasts all day just the name suggests."
      },
      "bostonienne":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"6 Jun 2014",
         "title":"Not liquid-y enough",
         "description":"Mixed feelings on this product. Once you get it on, it is very long-wearing and smudge-resistant, though not waterproof. However, the applicator dip dries out very easily, and there's no way to force more product up into it, which can be frustrating. It tends to catch on my eyelid, making the line uneven, and sometimes sputters out in the middle of doing a cat eye, which is a real problem. Probably wouldn't buy it again unless they changed the packaging to make the applicator re-wet-able."
      },
      "annieroo1":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"26 Jun 2011",
         "title":"Worth buying",
         "description":"Much better than Smudge Pots. Easy liner to handle, stays on well. I would of given it 5 stars, but some times I feel that it may dry out a little too fast. Not consistent as it flows out. But I;ll keep on buying it."
      },
      "Fawning":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Dec 2013",
         "title":"best and easiest liquid liner!",
         "description":"I have been wearing liquid liner since I started wearing makeup, and there has never been an eyeliner that I've loved more than this one. I've repurchased it probably five or six times. It is true to it's name for the most part, with minimal to no smudging or disappearing. The pen applicator makes it very, very easy to use and practically fool-proof. With the black liner (the only one I purchase) the color pay-off is very intense, just how you would hope!\nAlso, if you want to prevent it from drying out quickly, store it upside-down. This was recommended to me when I first purchased it and I've found it to be helpful!"
      },
      "mhf206":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Oct 2016",
         "title":"Easy to apply, goes on super smooth and is very pigmented. Long wearing.",
         "description":""
      },
      "aertooth":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"3 stars",
         "date":"27 Jul 2014",
         "title":"Relatively easy to apply eyeliner",
         "description":"This eyeliner has a thin point and if you buy a very dark color, it goes on easily. For some reason, the lighter colors are dryer and you have to push hard to see the color. It stays on well, but not great."
      },
      "Maddy2594":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"13 Aug 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"I love that it's a felt tip liner. It's fully opaque in one swipe. It works best after you put a base on like set foundation or set concealer. I don't reccomend it straight on the skin. Especially if you have oily lids like I do."
      },
      "Angel2Faced":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"14 Jan 2013",
         "title":"Disppointing to say at the least..",
         "description":"I purchased this product convinced by the specialist that it was the best liquid waterproof liner on the market... Tried it, LOVED it for a few days.. And then it started to smudge! I don't get it.. I guess it's not oil proof because after a few hours of wearing the liner, it would start to smudge and get on my upper lids! Looked so ugly and embarrassing.. Using primer helped a little bit with it lasting, however it's very frustrating to do and would STILL smudge after a few hours of wear! Easy to apply, and difficult to take off.. But SMUDGES WAY TOO MUCH!! I just don't get it.."
      },
      "missham2001":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"19 Feb 2013",
         "title":"Easy for non-make users",
         "description":"I have avoided eye-liner because it was never easy to get a straight line. This is perfect for unsteady hands and it really is waterproof/resistant."
      },
      "hopeful313":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"12 Mar 2012",
         "title":"Great product",
         "description":"I love the waterproof liquid eye liner. It's so easy to use - goes on well and then it's dry till I take it off at night. Doesn't smudge or show up other places."
      },
      "wooahthatshot":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"13 Jan 2012",
         "title":"4.5 stars! Pretty good liquid eyeliner!",
         "description":"The reason why this product earned 4.5 stars instead of 5, in my opinion, is because of these few reasons: (pro's and con's) The first reason is its claim of being \"waterproof\" is not entirely true - if you were to splash water onto your face or to rub your eye with wet hands, some of the product WILL come off.. But keyword: some. Some of the eyeliner will still be on, just not as intense as it was before, looking a bit faded. What I do like about the eyeliner is that I have oily eyelids, and I have to use an eye primer to ensure that my eye makeup will endure throughout the day But this eyeliner will stay on my eyelid with and without eye primer no problem. Another pro is that this eyeliner has a felt-tip liner, which is PERFECT for people that have problems applying liquid eyeliner or are just beginners. It is very easy to use and I love that you have alot of control when using this product. I would recommend buying this liquid eyeliner because it's definitely better then the rest that I've used so far (drugstore and high-end) and $20 is not as expensive as other liquid eyeliners out there."
      },
      "LydsNYC":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Apr 2014",
         "title":"BEST EYELINER EVER",
         "description":"I first tried this eyeliner when my sister bought it for her wedding day makeup. I am an every day eyeliner wearer (but not in the overly-made-up way, promise) and this is the greatest liner I have ever used. It goes on like a sharpie -- not wet or thick like other liquid liners, just a clean, super saturated line. It's incredible for creating cat eyes or getting a super skinny line just along your lashline for some extra definition. I regularly wear it without mascara for a super clean look.\n\nIt does dry out after a couple months of daily use, but it's well worth the $20 to replace it a few times a year. LOVE IT!\n\nI have brown eyes and wear the black one every day, but I've tried the navy and it's gorgeous if you want some extra color!"
      },
      "Michellehjj":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Jul 2013",
         "title":"It's just perfect!",
         "description":"I have tried many different brands of waterproof eyeliners for many years and all of them smeared on my eyes. I was very frustrated and had given up wearing it. My friend recommended me using Stila liquid eyeliner and I just loved it!! It's easy to draw, it stays all day long and it doens't smear even with no primer on. I am very grateful for Stila making such a good product. It's a life saver!"
      },
      "LynnL62":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"29 Jul 2013",
         "title":"Love it!",
         "description":"Used to wear Art Liner from Lancôme, this is easier to apply and the colour stay true all day."
      },
      "wyin":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Dec 2013",
         "title":"The best ever",
         "description":"I have really oily eyes, and never find any eyeliner that long-wearing. However, I got the black one in a gift set from my mum, otherwise I will not purchase it by myself. When the first time I use it, I fell in love with it. I put on the makeup at 8am in the morning, and back home until 5 pm. The eyeliner did mot smudge for 10 hours!! This save the eyeliner smudging problem for me!"
      },
      "CP33":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Sep 2016",
         "title":"Not the same!",
         "description":"It is not the same. Came here and saw some of the other reviewers noticed that too. I still have my old tube and it hasn't run out yet, so I compared them both. They are very different. The new one, still in the intense black, is not intense and is not very black. It is extremely watery and sheer! And takes forever to dry. It's so sheer that it's laughable as an eyeliner to do a cat eye (my go to every day look). The photo on here with the silver grey is of the old tube, which says made in Japan packaged in Korea. The new tube is gold and only says made it Korea. I literally wear this eyeliner every day and it lasts so well that if I forget to wash it off it is still intact and flawless in the morning! The new tube- no way. Smudged and transfered immediately. So disappointed because I am very picky and dislike literally every single other liquid liner I've ever tried. Will return. If this is your go-to then I would warn against re-ordering. Or test it out in store before you purchase."
      },
      "KarenMH":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Jan 2013",
         "title":"Lovely Liner!!!",
         "description":"The felt tip of this liner gives you a lot of control in creating the exact line that you want...thin or thick. Stays on all day and NEVER smudges. Best eyeliner that I've ever used!"
      },
      "jacqqquie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"30 May 2014",
         "title":"the perfect everyday liner",
         "description":"As a die-hard fan of Stila's \"In the Know\" palette, I was crushed when the matte charcoal liner ran out before the shadows. After trying \"Alloy,\" I'm in love...the line quality is excellent, it lasts forever but rinses gently with a mild cleanser, and the matte grey color is perfect for a subtle everyday line without being too dramatic or heavy-looking (for fair skin/blue eyes).\n\nWould def recommend, and suspect that the other colors are excellent as well!"
      },
      "JuJuBeanez":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"11 Apr 2014",
         "title":"Great Liner Except the Brown Color",
         "description":"Love the black and navy blue liner but when I got the Brown Liner it completely transferred on the top of my lid and was very sticky ...it might be a fluke i'm not sure"
      },
      "Nicolified":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"6 Mar 2014",
         "title":"110% honest review",
         "description":"If your not sure whether this liner is right for you, read this review. This eyeliner does exactly what it says: stays all day. This eyeliner runs out or starts drying out in about 2 weeks of daily usage, which for 26 dollars isnt worth it in my opinion. If you can afford buying a new one every 2-3 weeks, go for it. Besides this, the tip tends to flake off so make sure not to touch or pull on the tip as it could further damage it. This liner is absolutely amazing with the pigment, staying power, waterproof ability and the applicator."
      },
      "mdyabut":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"27 Sep 2014",
         "title":"I've always been hesitant with liquid eyeliners as my eye area tends to be sweaty and I feel that towards the end of the day, its either smudged or gone. After recieving this as a recommendation from someone who worked at sephora (SQ1 location) I am hooked. It really does live up to its name \"all day stay\". All though it comes to a point that I have to buy a waterproof eye make up remover as it *really* stays, I'd rather have that! It also last me enough that I only buy 2-3 a year. Definitely worth it and have been recommending it to whoever would ask.",
         "description":""
      },
      "rachelmorganc":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Sep 2013",
         "title":"AMAZING!!!",
         "description":"I can wear this eyeliner all day and it won't smudge (this includes going to the gym after a nine hour work day). I only applied it once in the morning and it stayed on for over 16 hours with a flawless look. I have oily lids and was very surprised it didn't come off after a few hours. I don't think I will be buying any other eyeliner besides this one! Love it!"
      },
      "lady77":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"13 Nov 2011",
         "title":"This eyeliner is the ONE!",
         "description":"I adore this eyeliner so much! I use this to do my wing. And it is so easily to use. It lasts the whole day! I don't struggle with it at all! I never have to worry how it looks hours later because it's just as good as how I applied many hours ago! The description here is not lying to you."
      },
      "PIPhiAngel13":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 May 2014",
         "title":"In LOVE!!!",
         "description":"I was looking for a liquid eyeliner to try because I was getting bored with pencil lining. After searching around a bit I read the reviews for this and everyone was raving about it, so I gave it s a shot. It did not disappoint!!! It goes on super smooth, doesn't smudge, dries quickly, and holds its color all day (and even into the next day).\n\nI'm telling you this is like a magic liner. Nothing I've ever worn has stayed on this well. The only thing that removes it is makeup remover. I've rubbed my eyes, washes my face, and even slept in it...and the liner was still perfect in the morning.\n\nI wish I could buy this in every color!"
      },
      "samxmalone":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Nov 2016",
         "title":"My absolute fave",
         "description":"I've been buying this product for a few years now and I have no reason to try any other. I had a friend ask me what I use and she is now a lifer, too! It's so easy to use and gives me exactly the look I'm going for."
      },
      "nrlr27":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"31 Aug 2011",
         "title":"Great for OILY LIDS",
         "description":"I've actually found a liquid liner that stays put even with my oily lids. I use primer, of course, but liners I've used in the past usually fade by the end of the day. This stood the test of time and against the summer heat. It's pretty easy to maneuver as far as creating a thick or thin line. I was able to clean up my lines with a q-tip and face lotion easy, no problem. And when it came time to wash my face at the end of the day, this stuff didn't come off. I used a cold cream to wipe it off. Overall, my new favorite liquid liner!"
      },
      "cutiecourtxo":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"11 May 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Amazing! Lasts all day and night! Great pigment, waterproof, smudge proof, easy application with felt tip"
      },
      "Sundown21":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Apr 2015",
         "title":"The BEST eyeliner!",
         "description":"This is the only eyeliner I buy. It lasts forever!!! I don't have to worry about it smudging or rubbing off on my lids. It stays perfect all year round. Hands down--it's the best there is!!!"
      },
      "Twelsea":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Sep 2014",
         "title":"Must Have!",
         "description":"I LOVE this eyeliner. I like to try new products, but always come back to an old favourite. It doesn't dry out in the tube, it makes a very precise lines, and stays black (not the faded dark grey that a lot of cheap liquid liners have). I will never buy a different liquid liner again!"
      },
      "BeekieSuzie":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Aug 2014",
         "title":"Does what it says - Stays All Day",
         "description":"Not only does it stay all day I really loved how easily it went on. I have never used a pen eyeliner with as much success as this one. Plus the colors are vibrant!"
      },
      "chloechloetx":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"23 Jun 2016",
         "title":"not good",
         "description":"This review is for the dark navy blue color - I can't speak for the other colors. \r\nThe applicator was totally dry right from the start, I had to work to build up the color but the tip was so rough that it created uneven lines.\r\nIt was a total mess, so I returned it. SAD"
      },
      "mg215":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"18 Feb 2013",
         "title":"love the straight lines",
         "description":"I started off with a black one and now am going to venture with color. I love the clean lines that I get when using it. If I don't want it to be so sharp, I just smudge it a little with my finger before it dries. I hope they come out with more colors."
      },
      "sunshinny":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"4 Sep 2015",
         "title":"Disappointing",
         "description":"Loved this at first, but then found it not to be so stable in the summer. Did not last the day, it started to smudge into my crease and then became sticky. My lash line would stick to my lid and it was a gross feeling. Plus, it ran out very fast."
      },
      "kloz90":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"22 Oct 2016",
         "title":"kind of disappointed",
         "description":"I bought this liquid eyeliner based on the number of good reviews. The first few times it worked great, glided on smooth. But, after a short time it started to go on in globs and it dried out unbelievably fast.  For this price, I won't be re-purchasing"
      },
      "y00nik":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"24 Nov 2014",
         "title":"The best",
         "description":"This is the only eyeliner i use. You might need practice since it's liquid liner, but it draws a very clean a precise line. I do not like smudgy eyeliners so this is perfect for me. Unless you are spending the whole day at the pool, it will not budge either. The only issue is that you probably don't get as much product for the price, but I'm willing to pay extra for this. I suggest you store it upside down so the product gets to the tip easily."
      },
      "jacseamit":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"7 Sep 2012",
         "title":"disappointing",
         "description":"Wow, I could not disagree more with the other reviewers. The first time I used this, yes, it went on easy and lasted all day. But the pen itself became useless within a few weeks, like it ran out of ink after just a few uses."
      },
      "idaMjau":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"5 Aug 2015",
         "title":"Awful pigmentation (turquoise)",
         "description":"If you are buying this because it has a gorgeous color (in theory) to apply like a bold color on your eye - you are in for a dissapointment.\n\nIm sure the black one is okay, I had no trouble with the application and the product's \"feel\" is okay. It's also longwearing and not really smudgeable, based on the test on my arm. I really have to work to get it off.\n\nThe coloring however is awful. I bought the turquoise one, and it really turns up more green on my arm. Like really weak blue/green. I'm really fair, it will probably turn out even worse on darker skin. Maybe you wont even see the coloring at all.\n\nAdding a picture so you can see for yourself. A definite return."
      },
      "DindyMae":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"17 Jul 2013",
         "title":"Easy to Apply",
         "description":"I have tried so many eyeliners and never have any luck with application - until now. This product was recommended to me and I love it - it is easy to apply and stays all day without smudging. I also love you can apply a thin line or a thicker line for a more dramatic look."
      },
      "drea88":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"10 Mar 2016",
         "title":"boo.",
         "description":"This used to be my holy grail eyeliner. Very fine tip, really dark, dries out a matte finish and very easy to use however, I feel like they may have changed the formulation because now after a few weeks of usage, it dries out and applies very patchy. I thought I may have gotten an old eyeliner but since then I have purchased it 3 more times and had stayed the same. I will no longer purchase this, not worth $20+ for less than a month usage."
      },
      "JenniferW24":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"28 Feb 2017",
         "title":"Sticky...?",
         "description":"I was excited to try this product based on the reviews. I purchased the liner in brown. I typically wear liquid eye liners. This one goes on smoothly, is easy to apply, but I had to put on several coats to get the darker brown I wanted. It was just too watery. And once I had a few layers on the eyeliner was so sticky! This was the first time in my life that I was actually aware that I was wearing an eyeliner when out. I was really self-concience as well because it felt as if the eye liner was sticking to the tops of my eyelids. Every time I blinked I put in extra effort because of the unusual feeling. I looked crazy. This feeling continued for hours. I lost the receipt or I would have returned it. Extremely disappointed and confused as to why I'm not seeing any other reviews discussing this problem."
      },
      "schmillie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"9 Dec 2015",
         "title":"What happened to this liner?!",
         "description":"This used to be my HG eyeliner. It taught me to do wings, it was the first liquid liner I ever used. I recommended it to countless people and always repurchased. It used to last me at least a few months with everyday use.\n\nThe last few pens I've purchased have dried up SUPER quick and no longer deliver an intense saturated black. I've had my most recent tube for a little over a month and can no longer do even one eye without putting the cap back on to re-wet it 5 times.\n\nNot repurchasing."
      },
      "jerilyn":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"3 stars",
         "date":"23 Jan 2015",
         "title":"Getting really frustrated with Stila",
         "description":"I love Stila liquid eyeliner in Dark Brown. I really do. I've used the same color for several years. The color is a soft, doe-y brown, not harsh at all, and I have lo problem with using the flexible brush. The problem is that the product dries out in less than two weeks. I noticed last year that I was replacing it more and more frequently. I've had just ONE good tube in the past 12 months that lasted more than 30 days. I no longer feel like I'm getting my money's worth. This may be a quality control issue, and I plan to contact Stila directly."
      },
      "misty3":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"22 Jan 2011",
         "title":"Stila liquid eye liner",
         "description":"Love it. Tip is very small to make a good line. Stays where you put it - lasts all day. Liquid is easy to put on."
      },
      "oopocahontasoo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Dec 2011",
         "title":"pretty darn good",
         "description":"this is one of the best liquid eye liner. this is long lasting. when i say long lasting, it lasted a 12hr shift with oily eyelids. i love the tip! its expensive, but worth every penny!"
      },
      "tans":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 Jul 2013",
         "title":"First time for everything!",
         "description":"I am a brand loyalist, and Stila was always on my black-balled list. Whether it's because I am not into lip gloss (and that seems to be Stila's biggest seller) or because, in my experience, their eyeshadows are pretty mediocre (and eyeshadow is of utmost importance to me), I never really felt the need to spend relatively large amounts of money on products that I just didn't need or want when there was something better available. This eyeliner is a total exception to the rule, however.\n\nI used to use liquid liner a lot in college because it was so humid that regular kohl/crayon liner would melt off my face within 2 hours. After I moved back home, the need for the liquid dissipated, but with the recent heat wave we've been getting, I needed to reconnect with the trusty liquid alternative, and I really didn't feel like getting something gross at the drug store. Sephora had a $10 promotional sale on the mini Stila, so I figured it was worth a shot.\n\nI am blown away by how precise, easy, clean, and long-wearing this liner is. The brush is the perfect size (drugstore brushes are often too thick or too thin), the perfect firmness (nothing worse than a flimsy tip!), and the ink goes on smoothly. The stuff dries instantly and provides the perfect line. For the first time in ages, I was actually able to do a clean 60s wing look without looking like a vampy retro vintage pinup derby girl (not that there's anything wrong with that, but I'm a professional and can't show up to work looking all edgy and alternative with my makeup). This stuff stays put in 90 degree heat and 180% humidity, so I will DEFINITELY be repurchasing this gem, and recommending it to all my friends! I might even try a Stila mascara someday! :) Thank you, Sephora, for a fabulous little promo!"
      },
      "misterey":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"7 Feb 2013",
         "title":"Nice thin lines",
         "description":"This is perfect for creating thin lines. It's not exactly as smudgeproof as it states because on occasion I'll do a quick brush of my eye and part of the eyelines comes off.\n\nOverall I love it for the precision and ease."
      },
      "sweetkarrie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"8 Mar 2014",
         "title":"Love the colors",
         "description":"I love the liner don't get me wrong. The colors they offer are great; however It is far from waterproof. Near the corners of my eyes this always seems to run or smudge. A lot of times I have to re-apply throughout the day when I use this liner."
      },
      "leeloram":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"11 May 2015",
         "title":"While I loved the long lasting color of this liquid eyeliner I was a bit disappointed at how the tip started fraying out after a few weeks. I would try other eyeliners before calling this my go to eyeliner.",
         "description":""
      },
      "zlovesjazz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Sep 2013",
         "title":"The Best of the BEST",
         "description":"I am not very experienced with liquid eyeliner so I tried this and it ROCKS. I can create thin or thick lines, its felt tip so its not flimsy and super easy to use. Long-lasting too: ive had 12-hour days and it does not budge!!!"
      },
      "altinay":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Apr 2014",
         "title":"Hands down best liquid eyeliner",
         "description":"Tried the tester on the back of my hand... Went home, washed dishes, took a shower, next day i noticed it was still on my hand same color and intensity, i was thinking \"wow!!! I mean \"woww! I have to buy this\"\nExcellent for oily eyelids such as mine"
      },
      "astami":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"30 Jan 2015",
         "title":"rocked my lids",
         "description":"i'm asian, with small eyes, and the winged eyeliner look is all i've got. my eyelids are oily and anything and everything i've tried tends to smudge at the end of the day.... except for this eyeliner. truly amazing, easy to use, and the black is a nice rich black. definitely going to be my go to liquid eye liner."
      },
      "kathymai":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"26 Nov 2013",
         "title":"favorite eyeliner.",
         "description":"this is my favorite eyeliner, no doubt. it's perfect and lasts me for a good 3-5 months, and I wear this everyday. Its so easy to apply and comes off easily even with nonwaterproof makeup remover. This is not waterproof, I don't mind though but if you're looking for a good waterproof eyeliner this isn't one. This is a good one for everyday uses which is perfect for me."
      },
      "emmycottonball":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Sep 2014",
         "title":"Flawless eyeliner!",
         "description":"I've been religiously using this product for over two years now and I will never go back to other eyeliners again! This stuff is AMAZING, and the fact that it's only $20 is incredible to me as I used to buy products that didn't give me the same results for over $50!! I found this product from Suzy Hanson (Mortemer) on YouTube and absolutely love this product. I recommend anyone who likes perfect eyeliner to use this product!"
      },
      "xSydMox":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"28 Feb 2015",
         "title":"Good, Not HG!!",
         "description":"For the price, I really expected this to be completely waterproof. My right eye is watery around the outer corner and everyone kept suggesting this eyeliner. I love that it's incredibly easy to use (especially for wings) and doesn't flake, fade or transfer, but I really wish this was as waterproof as I was told. After a half hour of my mildly watery eye, the eyeliner disintegrates."
      },
      "buhfly":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 May 2014",
         "title":"Excellent.",
         "description":"Very good liquid liner. Felt pen tip, superior glide, and AMAZING staying power. Comes out very wet, so maybe not good for beginners, but once it dries, it's on for the whole day. Black is BLACK."
      },
      "cassiesthetic":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Jul 2016",
         "title":"I'M A LIQUID GIRL NOW",
         "description":"i usually only use gel liners bc i always see youtubers using that, but i wanted to venture out to the liquid eyeliner scene and OMG THIS EYELINER HAS CHANGED MY WING GAME. it is so easy to apply, and you can get perfect wings in seconds. my hands are shaky at times and can be heavy, but this pen is so easy to use. the black is super pigmented and dark. i'm obsessed! highly recommend!!"
      },
      "pouter":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"6 Feb 2014",
         "title":"Solid liner",
         "description":"This is a great solid liquid eyeliner.\nI'm Asian & have a monolid so I have to draw my eye line fairly thick or it won't show; then there's also a problem with the amount of oil I tend to develop on my lid, so the liquid liner I use/choose, has to have some major staying power. I'm super picky with liners.\nThe Stila liquid eyeliner is amazing for what I want out of an eyeliner. As long as a eye primer is used, it doesn't crease or flake. Skip the primer & you'll notice it flake off. I tried Kat Von D's liquid eyeliner (which is a decent liner itself) & I'd pick the Stila formula over that one, cause it's more opaque than Kat's.\nHowever, I'm giving the Stila liquid eyeliner a 4-star rating cause (has a lot to do with me being a tough rater), I prefer Kat's brush tip than the felt tip used for Stila. I feel that brush tips give me a finer handle on the lines. But that's just me."
      },
      "byrnes":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"20 Feb 2014",
         "title":"Love the colors",
         "description":"They stay put and colors are fabulous. No smearing and long lasting."
      },
      "DrVee":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"9 Jul 2016",
         "title":"oh my golly wow",
         "description":"This has been my go to liner. I've tried so many brands and I always come back to stila. I decided to have a Grey's Anatomy marathon and watched 12 seasons and oh my gaaaaawd. It stayed on. No joke. My eyeliner is still on fleek even when Cristina Yang left. I would really recommend this eyeliner to anyone, especially those who get a lil emotional from time to time ;) <3"
      },
      "bluupp":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Dec 2012",
         "title":"Best Eyeliner EVER!",
         "description":"I have Asian double / oily eyelids. So pretty much all the gel or pencil eyeliners that I've tried smudges within an hour. I literally look like a ghost after. I swear by this eyeliner, it's my life savoir. It doesn't smudge on me, it's waterproof, last from day to night, intense colour and dries quickly. Don't worry though, you can make little corrections easily with a q-tip and a little bit of water. I used this to draw cat-eye and for tight lining. I would recommend to anyone that has oily double eyelids, love the intense look and beginners."
      },
      "Cynderlou":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"11 Jan 2016",
         "title":"Love !! Easy application",
         "description":"I have the absolute hardest time putting liquid eyeliner on, I have bought and returned them over and over because I simply can't get a straight line and make it look good...until now. I was shocked at just how easy this is to put on, and even with my shaky hands and naturally curly eyelashes that always get in the way of the pencil of all other eyeliners I have tried - this one went on with a nice even, dark, perfectly straight line.\n\nThe difference I found with this one, compared to all other liquid eyeliners, is that the colour comes out from the tip in even saturation, so I can literally use the tip (which is very small and sturdy - doesn't bend when gliding along the eye) to draw the line all the way across in one go rather than having to dot it and try to join it up - which never comes out straight for me. Other liners do not have the colour come out as evenly just from the tip as this one does - so either you dot and join the line, or lay it flat and try to draw across, which never works for me because my eyelashes get in the way and the pencil bumps around making an uneven line that I have to try to fill in with eye shadow.\n\nI had almost given up and thought I would never be able to use liquid eyeliner and get that nice sharp line I always coveted on other ladies...but eureka, with this, I finally can.\n\nAnd it stays on, all day. No crumbly fall out or smudges. It was actually a bit hard to get off at night, but I just used a bit of moisturiser and it wiped off cleanly.\n\nI have it in Alloy, and will be picking it up in other colours as well."
      },
      "sachi4u":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"2 Feb 2010",
         "title":"Stila All Day Waterproof Liquid Eye Liner",
         "description":"This is the absolute BEST eyeliner I have ever used! I am Asian...it's hard to use an eyeliner that doesn't smear...but this one is DA BOMB!!! Not only doesnt it smear..it's long wearing, waterproof and SMUDGEPROOF!!! I bought 2 and I will continue to buy more!!!"
      },
      "1957mama":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"1 Sep 2013",
         "title":"Apply liner as thin as possible",
         "description":"Finest tip on eyeliner I have ever seen. Definitely work the money!"
      },
      "jujubee1566":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"16 Nov 2016",
         "title":"I think they changed the formula",
         "description":"I LOOOOVE this eyeliner. It's the only eyeliner I've been using for about 8 months. I just repurchased 2 yesterday and omg they were terrible! I put some on my hand and it sort of seeped in and leaked. I used it on my eye and it was sorta runny and diluted. I thought maybe it was just the one but the other one was just like it :( very disappointed because I absolutely love this liner:,(((("
      },
      "beautydali":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Apr 2016",
         "title":"Loving it",
         "description":"This is my 3rd Stila eye liner. It is so easy to apply and it lasts 24 hours! I apply my make up at 7am and I know I shouldnt but sometimes I go to bed without taking off my make up, and the liner is right there where I put it the morning before. Amazing!!"
      },
      "fullfigurelove":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Feb 2013",
         "title":"Love!",
         "description":"Finally, an actual waterproof liner that really does last all day! The line can be either very fine or heavy, it dries quickly and works great with any eye shadow. I work 12 hour shifts and it still looks nearly flawless at the end of the day..."
      },
      "laurenypace":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"9 Mar 2017",
         "title":"changed formula",
         "description":"So disappointed this used to be my favorite and it's clearly different. I hate when a product gets popular and they decide to cut costs by changing what makes it great."
      },
      "Jadxia":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"7 Apr 2013",
         "title":"Great Beginner Eyeliner",
         "description":"Pros: I've never been good at handling liquid eyeliner, but this applicator tip made it easy. Held at a straight 90-degrees to the skin, it made a very precise line. I used it to draw a spiderweb design for a costume that turned out great on the first try. It dried fairly quickly (10-15 seconds), after which it didn't smudge at all, and it stayed on all night, even after sweating up a storm dancing (see the pic below). Afterward, it came off cleanly with a little cold cream, soap and water. No raccoon eyes in the morning!\n\nCons: It had a very matte finish after drying, to get it very black I had to go over parts twice, and it might have benefited from a third pass. Just not as shiny as some other liquid or cream eyeliners. Also, angling the tip doesn't give you an even, wide line as suggested, or maybe that's just my lack of skill showing.\n\nOverall, I was very pleased with this product and its incredible staying power. I will definitely keep this around even as I get better with liquid eyeliner designs, as I think this will still be useful for more delicate details."
      },
      "anniealv9":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"30 May 2014",
         "title":"It's good but not great",
         "description":"This is a really weird eyeliner, it goes on pretty well and easily but it's not very dark and it's pretty watery. It stays on all day but it is smudge-able but if you don't ever touch your eyes you're fine. It also does that weird thing that happens with markers, if you try to go over it, it kinda just cancels out and doesn't work. I bought it (in black) because I heard really good things about it but that also might be why I'm judging it so harshly. Plus for 20 dollars I think you can find something better."
      },
      "margie777":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"9 Jun 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Will last longer than your man"
      },
      "mahsmm":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Oct 2014",
         "title":"Best of the best",
         "description":"I was never a liquid eye-liner person until I was introduced to this lovely pen....\nit's the ultimate eye-liner\nin love with it <3"
      },
      "hvg13":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"13 Aug 2012",
         "title":"not too shabby at all!",
         "description":"i bought this to replace my Smashbox pen, which was a disappointment. the problems I was having with that pen (jagged lines, dries out, line over line removes the liner that's on the lid) are not at all evident with this Stila product.\n\nthe pen tip stays moist, the pigment is rich and deep (i have black), and it continually goes on smoothly with no jagged lines or light spots. it never flakes off or smudges, even when it's on for my 12 hour work days. it's wonderfully waterproof, but comes off easily with eye makeup remover.\n\nmy only issue (not really a complaint) is i find the pen tips on these types of liquid eyeliners not quite as easy to control as a brush. i only wish the tip was a tad more flexible.\n\nsummary: great liner, long lasting, deep pigment, excellent line and application. i will definitely be buying this again."
      },
      "Wondy":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"27 Nov 2012",
         "title":"Great, not Perfect",
         "description":"The \"Great\": It is very long lasting, non-creasing, smudge-proof (even without a primer underneath), and the tip is thin for precision and multiple strokes.\n\nThe \"not Perfect\": I found myself having to recap the pen and shaking it way too many times to get more color. I'd use it, and after a few strokes it started to dry out. I had to shake it a couple more times, go back to my eye, then shake it at least one more time. When I'm in a rush in the morning, those are precious wasted seconds shaking it. Ain't nobody got time for that!\n\nIn the end, I kept the product and I do genuinely like it, but I'm going to look for a different liner after this one is done. I prefer a pen you dip into the liquid so you know exact how much color is on your pen every time."
      },
      "sgail":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"5 Feb 2012",
         "title":"It stays put",
         "description":"This liner is pretty cool. It goes on like a skinny marker with a firm tip, is pretty easy to draw a thin line, or to make a bit thicker.\nIt stays once it's on. My only qualifier is that while you are learning to get it perfectly applied, it is difficult to fix should you put it on a bit too thick. Gotta take it off and start again."
      },
      "CamillaSejling":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"10 Oct 2013",
         "title":"The best liquid eyeliner I've ever had!",
         "description":"This eyeliner is the best and in all kinds of wether! Seriously! It had its test when I went to Niagara Falls and took the \"maid of the mist\" and \"cave of the winds\" tours, believe me or not - it stayed on all day, even when I jumped in the hotel pool in the evening.. It was a hot day too, so it also stands the test in that kind of weather.. I would recommend this to everybody, also because it's so super easy to apply, even if you never tried liquid eyeliner before! Buy it, it's worth every penny :D"
      },
      "spartygirl02":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"19 Apr 2015",
         "title":"Fabulous liner",
         "description":"I purchased the black and I love it! I've been paying more for liners that don't go on as easy or stay on as long. Requires a light touch, but gives the perfect look."
      },
      "Skishi831":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Aug 2016",
         "title":"on POINT",
         "description":"The only eyeliner I've found so far that stays put under my puffy and hooded Asian eyelids. The felt tip applicator also makes it easy to execute clean winged liner looks. Absolutely LOVE."
      },
      "RoseKov":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Apr 2014",
         "title":"LOVE",
         "description":"I am awful at putting on liner, but I actually do a good job with this one! Easy application, lasts all day (sometimes it is still on when I wake up in the morning), and looks fantastic!"
      },
      "psrisung":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Oct 2014",
         "title":"By the best waterproof eyeliner I have ever used!",
         "description":"Love this product because it stays on all day. The felt tip pen allows easy application and the formula combats OILY eyelids."
      },
      "kellyb26":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"15 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"best eyeliner ever even better than Kat von d it is worth the price"
      },
      "mdsum3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Jun 2013",
         "title":"Still the best liquid liner.",
         "description":"I've been using this liner for years. I've always been partial to the black, but I recently purchased the slate and the moss and LOVE them. The slate is really subtle, but still defines very well and makes your eyes pop. The moss color is to die for. It's not quite as harsh or intense as the black, but still gives a lot of definition. It doesn't really even look all that green, but still makes my eyes look greener. I will continue to use this liner and nothing else. It's simply the best."
      },
      "mapgurl":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"5 Jul 2013",
         "title":"Goes on great, but not waterproof",
         "description":"I love the way this product goes on, and it will indeed last all day for me.\n\nHOWEVER...mid-day I will have smudges imprinted on the tops of my eye sockets. Maybe it is the gross NYC/NJ humidity in June/July, but at the moment this eyeliner is not for me."
      },
      "PerryGingie":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"8 May 2016",
         "title":"Doesn't Work For Me",
         "description":"I've been seeking for the perfect liquid eyeliner for the longest time ever, and with the reviews I thought this would be the one. Unfortunately the color is not pigmented at all and the felt tip doesn't carry the ink either, even after multiple shakes. I place the eyeliner downwards hoping that the ink would dispense better, but doesn't work either. Good staying power, but really hard to apply. After one swipe I could barely do the second layer. It just removes off the first layer like an eraser. Really wanted to love it, but doesn't work for me. Had it returned."
      },
      "ineedu":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"8 Aug 2015",
         "title":"Short-Lived",
         "description":"This is great for everday makeup - it's quick and easy to use. The formula is light, so you can apply multiple layers to get the pigment you want. For a more natural look, I usually just apply a quick swipe. If you don't live in humid weather or work in an office all day, this definitely lasts all day without budge. However, it will not last if you're wearing it all day and sweating - it will smudge and wear off. What's more disappointing about this is that it gets worn out very quickly - by that, I mean the tip dries out within maybe 2 weeks of continuous use. Then the product isn't able to reach the tip to create the sharp lines. For $22, it's kind of a lot to continuously purchase."
      },
      "sanaa87":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Aug 2015",
         "title":"Best of the best",
         "description":"Hands down the best eyeliner on the market. I'm an eyeliner junkie n this one in black color is the best ever. Def more black than Kat's Von D Trooper in case any is wondering."
      },
      "slimchalet":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"28 Oct 2014",
         "title":"Perfect product",
         "description":"I have middle aged sagging upper lids so soft pencils were smudging and creasing. I live in Florida too so it's very hot and I perspire a lot even on my face. I have been using this product for over a year now and it is excellent. Goes on smooth and has amazing staying power with no smudging or creasing. Lasts all day with no reapplying and even does great in water. Love it!"
      },
      "MerPaige":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Apr 2014",
         "title":"Long lasting, but...",
         "description":"I have hooded eyes, so eyeliner usually leaves me with panda eyes. This one came highly recommended, so I gave it a shot, and I can say that it is definitely long lasting and doesn't smudge onto my upper lid! It dries almost immediately and doesn't fade! BUT, it leaves my lids feeling really sticky (despite trying applying this liner alone, with primer, with primer and shadow, etc.) and that's a deal breaker for me. My eyelids get stuck open and it makes it hard to blink. I don't have naturally \"sticky\" eyelids, and I've never had this problem with any other liner, so there must just be something in the formula that my body reacts to. I haven't read any other reviews mentioning this problem, so I assume that I'm the weird one here.\n\nSo to sum it up, this is a fantastic product that works exactly as advertised... my body just had a weird reaction to it."
      },
      "Delany":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Apr 2015",
         "title":"I'm being 100% honest here",
         "description":"Seriously impressed, the precision with the felt tip is super close to lashing and make my everyday cat eyes and winged eyeliner things that I do really easier especially for a perfectionist like me. I would say eyeliner runs out relatively quickly compared to gel liners but last by far longer than most liquid and consistent quality."
      },
      "emily1231":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Nov 2014",
         "title":"GREAT MATTE WATERPROOF LIQUID EYELINER",
         "description":"I've been using this eyeliner for many years now and it is still my favorite to this day. I love how it's waterproof (seriously). When I go work out and play sports and am drenched in sweat, this eyeliner still stays put and does not smudge. I use the black eyeliner and the color is very black and matte. It does not flake."
      },
      "KatlynP":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Dec 2012",
         "title":"Easy Liquid Liner",
         "description":"This liquid liner is great for someone new to liquid (like myself). It is so easy to apply, stays put all day long, is waterproof so it doesn't run/smudge but comes off easily with makeup remover wipes at the end of the day."
      },
      "shopper2012":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"17 Feb 2014",
         "title":"Love the Stila eyeliners!",
         "description":"The liquid eye liners by Stila are my favorite. They work great, last all day, don't smudge, and never need sharpened (like eyeliner pencils do). Worth the money!"
      },
      "Xtinaluv":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Feb 2014",
         "title":"Does everything that it claims! No fading, fast drying and no smudging! Also waterproof! Just lay it down instead of up in cups that way it won't dry as quick! Love it want all the colors!",
         "description":""
      },
      "choup":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Sep 2013",
         "title":"THE best eyeliner",
         "description":"I’m in love with this eyeliner ! It’s really easy to use : glide nicely on the eyelid and the tip of the eyeliner being very narrow, you can create a lot of style of cat eyes. It stays in place all day, and is also easily removable. I’ve try a lot of different brand of eyeliner and this one is definitely the one I would recommend !"
      },
      "lyntran":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 Apr 2015",
         "title":"Good eyeliner that doesn't smudge and lasts all day. However, after about a month-ish of use, it dried out.",
         "description":""
      },
      "vickie56":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"21 Apr 2010",
         "title":"I'm a fan again.",
         "description":"I never met a liquid eyeliner I liked....until now. I was looking for a waterproof eyeliner because I wear contacts and the moistening drops sometimes make a mess of my eye makeup. This little gem is the perfect eye liner. It makes the tiniest, straightest line right next to my lashes. The control I have is amazing using this liner. I have now found an eyeliner I love. And, it is truly waterproof!!!"
      },
      "themarionette":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Feb 2014",
         "title":"I apply eyeliner like a child, but I could apply this. Buy it!",
         "description":""
      },
      "MRBonham":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"17 Feb 2014",
         "title":"The Best",
         "description":"This is the best liquid eyeliner I have ever used hands down! It does on well with a felt tip pen.. the felt doesn't loose its shape over time. It is the blackest black, it glides on well and has great even precision and application. Not to mention it lasts forever. I will and have recommended this eyeliner. I have absolute no complaints about it and it is worth every penny!"
      },
      "asumom":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"30 Mar 2015",
         "title":"Easy to apply",
         "description":"I'm 60 years old with crepe-y eyelids so eyeliner is difficult to apply and often doesn't look smooth. The Stila liquid eyeliner goes on easier than any gel or cream eyeliner I've tried and it doesn't smudge. Very pleased with this product."
      },
      "KTHJ":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"4 Sep 2014",
         "title":"Great! But not what I was looking for",
         "description":"I'm a liquid eyeliner addict and when I look for a good liquid liner I have 2 requirements: long wearing and very pigmented.\n\nI bought this eyeliner in 4 different colors: green, dark blue, brown, and black. The green and dark blue had less than exceptional pigmentation and only lasted through half my day. The brown and black were amazingly long wearing but the pigment wasn't on par. Also there is not that much product in the pen. Most eyeliners last me at least 10 months but this only lasted me about 5 or 6."
      },
      "Suseh":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Apr 2016",
         "title":"Love this eyeliner! Wayyy better than KVD one",
         "description":""
      },
      "cindyyrellaa":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Nov 2013",
         "title":"Amazing for Beginners",
         "description":"This product is really easy to use and is especially good for beginners. The brush allows for easy application."
      },
      "boomin":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"26 Oct 2010",
         "title":"Finally LONG LASTING, every which way",
         "description":"Yes lasts long, thin line, EZ to get between lashes without a mess, go fancy or go one fine line.. it obeys your command! And yes overnite or 16 hour day. No itching either. Container lasts a long time too. OH YEAH-its all that."
      },
      "BlissfillBeauty":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"11 Oct 2014",
         "title":"Best Eyeliner Ever",
         "description":"I love this eyeliner. It goes on in a solid, perfectly dark black, smoothly, and evenly. I've tried many others, this one is the best eyeliner I've ever found. Others look more dark gray, this one is super black."
      },
      "AlolaDarlene":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Feb 2017",
         "title":"Fave eyeliner",
         "description":"I work in a kitchen all day so I'm constantly sweating and a lot of eyeliners that claim to be waterproof smudge after 5 hrs. This one doesnt. I start work at 5am and I can go to parties in the evening without having to retouch it. It's very pigmented for the first couple of months but after a while, you need to swipe a little more to get the color intensity you want which is my only qualm but I do use this often so that's understandable. It doesnt sting if it does get into your eye and the tip makes it easier to wing my eyeliner. so far my favorite eyeliner."
      },
      "windupbirdie":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"3 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Hands down the best eye liner. Glides on easily with precision, lasts forever, and no smudge even after all day wear. This is my go to, I've been using it for years and have never found a better one!"
      },
      "graphicpaint":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"2 stars",
         "date":"21 Jan 2015",
         "title":"something is different...",
         "description":"this is about the 4th time i've purchased this liner and i've always LOVED it - but this time it's not so great - has the formula changed? it's not applying the way it used to - it used to be precise and super black with total coverage and now it wipes itself off when i try to build up the line and just won't make a sharp line. not happy."
      },
      "hberry":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"14 Feb 2013",
         "title":"My Only Liquid Liner",
         "description":"I can't believe how great this eye liner is. I use it every day, and it is always fantastic. I was nervous to get a \"Liquid\" but it is so actuate and looks amazing. I am so glad I purchased it and I have made several friends fans of the product as well. It is the best in the all day liner department."
      },
      "Shannonwolfy":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Jul 2016",
         "title":"my one and only",
         "description":"This is the best eyeliner I've ever used. Eyeliner is my thing. The big dramatic wings, heavy and bold. This eyeliner is the only stuff I will use. I am a vocalist In a rock band. When I'm up on stage sweating and running around at the end of the set this eyeliner does not budge and stays perfect through the day and a whole show. I'm not even going to lie I would marry this eyeliner if I could."
      },
      "jeannemarie05":{ 
         "extra_info":"<b>Skin Tone</b> Olive",
         "stars":"5 stars",
         "date":"2 Jul 2016",
         "title":"Buying eyeliner has always been a struggle since my eyellidsare very oily, but this eyeliner is like a godsend, especially with primer underneath. Ever since I've purchased this, I almost never want to go a day without it on. I love how easy it is to apply and how fast it dries. Totally recommend!",
         "description":""
      },
      "justmejo":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Sep 2013",
         "title":"Great Eyeliner",
         "description":"I got the black & brown. I like the brown better on me. This is great eyeliner, easy to put on, stays on all day, rich color. For me, I noticed my eye makeup remover doesn't take it off so well. Ironically warm \"water\" on a q tip takes it off easier, lol."
      },
      "dahliaanhthu":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Oct 2010",
         "title":"Perfection in an eyeliner.",
         "description":"I would like to say that I've tried on SO MANY eyeliners before buying the Stila waterproof liquid liner. I have the Asian double eyelid that directly touches the inner corners of my lash line, so when I go throughout the day with my eyes fully lined, by the time it hits mid-day, my eyeliner in my inner corners are GONE. Instead, I have this weird smudgy mess. Stila's eyeliner is the most amazing eyeliner ever. Not only does it not do that weird smudging business on me, but it also keeps its PERFECTLY straight line. I don't know why I didn't hear about this eyeliner before now, but I will spend all my money on this eyeliner from now on. :)"
      },
      "ardezzzay":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"22 Jun 2012",
         "title":"Favorite Eyeliner",
         "description":"By far my one and only favorite eyeliner! I've purchased this item more than twice, and they last long. I love these, I've tried so many different liquid eyeliners and I keep coming back for this. So easy to apply :)"
      },
      "Keatie":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Mar 2016",
         "title":"This eyeliner stays on as long as you want it too, it does not smudge and is fairly easy to use.",
         "description":""
      },
      "veekee":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"12 Apr 2016",
         "title":"Something has changed :(",
         "description":"This used to be my Holy Grail of eyeliners, but something has changed and NOT in a good way! Not only is it more expensive than it used to be, but it dries out so fast! My last purchase was returned for a new one thinking maybe I purchased a lemon, but after 2 weeks of using both pens, the tips dried out and the only way to use the pen was to clean it across a makeup wipe to loosen up the felt tip. For a $30 eyeliner, seems ridiculous that I have to start with a makeup remover to get it going.\nCan't tell you how disappointed I am, because I have yet to find anything that measures up to the old formula."
      },
      "TawnyaL":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"24 Oct 2014",
         "title":"LOVE IT!!!!",
         "description":"I have been on the hunt for eyeliner that would last all day and not smudge. This is the one! It lasts all day!"
      },
      "Lyliam":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"4 Jun 2015",
         "title":"Starts off great, ends in sticky runny mess",
         "description":"I have mixed feelings about this eyeliner - the black one I have is fantastic. The brown one, on the other hand, is TERRIBLE! AWFUL!!! It glides on easily and looks perfect right after applying it. However, after a couple of hours I start to feel my lids getting stuck to my crease. As it turns out, this eyeliners turns into a sticky mess that smears all over my crease, ruins my makeup, and makes me quite irritable. I've tried using it with and without an eye primer, with powder shadows, pigment, cream shadows, a top layer of finishing powder, and nothing works. Can't understand how the black can be perfect and the brown one an utter mess."
      },
      "CynthiaMarie":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"10 Feb 2014",
         "title":"I wanted to fall in love...",
         "description":"The cat-eye is my trademark.\nThat being said, my liquid liner has to be perfect. Sadly I'm still on the hunt for an eyeliner that is BOTH waterproof and easy to apply.\nThis eyeliner is waterproof in all shape and form. It isn't rub proof though-just be aware. It has lasted me 12-18 hour days.\nI spent 20 minutes in Sephora trying to pick the BEST waterproof eyeliner.\nI got this one. First few applications were great! It's been 2 weeks now and the liquid doesn't flow making it so hard to flick out that I have to restart 2-3 times. Waste of time in the morning rush. I can't tell if the felt dried out already or if it just doesn't apply well over eyeshadow or both.\nI wanted to love it but now I'm trying to decide whether to return it or tough it out because the staying power is so good.\n*sigh*"
      },
      "sugarandspice":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"8 Nov 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Conflicted-Did they change the formula?!"
      },
      "Relly95":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"5 Dec 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Phenom.com"
      },
      "lilyjr":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"3 Apr 2015",
         "title":"Doesn't last",
         "description":"Great liner!!! Too bad it completey went dry on me after what it felt like only a month (and not like I used it everyday either). My girlfriend swears off this eyeliner so I decided to try it in brown since Kat Von D does not make the tattoo liner in brown. When it went dry on me, I told her what happened and she said the same thing happens to her all the time.... it doesnt last!! But she continues to be faithful to the product. I myself am going to explore what else I can use.... unless KAT VON D - please bring back your brown TATTOO LINER!!"
      },
      "GabrielleD":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Jun 2013",
         "title":"FAVORITE",
         "description":"I have been looking for the perfect eyeliner for YEARS and this is definitely it. It is very easy to put on, it looks good, and most importantly to me, it stays on without needing to re-apply, for hours. It's worth the money and it lasted me a whole semester before it ran out (which was awesome, because I wear eye-liner constantly- and lots of it.)"
      },
      "townbound":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"3 stars",
         "date":"19 May 2014",
         "title":"Okay, but Kat von D's is better",
         "description":"I bought this because they were out of the Kat von D Tattoo eye liner when I was at the Sephora store in Ala Moana. I was only on O'ahu for the day so didn't have the option of going back at a later date. I must say, the Kat von D product is MUCH better. The Stila seems to be less waterproof, even though the KvD doesn't bill itself as such it stays on better and longer. I also prefer the brush as opposed to the marker, so maybe I'm applying this wrong. I put some on just a few hours ago and already it's wearing off around the corners of my eyes. Granted, I live in a very humid, tropical climate, but that didn't deter the Kat von D. I'm going to return the Stila when I'm back in Honolulu at the end of this month and hope against hope that the Tattoo liner is back in stock. The fact that it was sold out should have told me something..."
      },
      "dej52427":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"1 Apr 2016",
         "title":"Disappointing",
         "description":"I don't like to give bad reviews and I very rarely do, but this eyeliner is awful. It smudged after only about an hour of wear. I even put a shadow primer on and it still smudged. I won't be sending it back, but I will definitely try something else."
      },
      "maiaorozco":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"18 Feb 2014",
         "title":"Best eyeliner ever",
         "description":"It doesn't smudge, stays all day. Love it."
      },
      "kg90":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"1 Oct 2011",
         "title":"AMAZINGLY LONG LASTING",
         "description":"This eyeliner seemed to stay on no matter what. I was on vacation, went swimming, went in a sauna and a jacuzzi, and my eyeliner stayed strong from morning to night without having to reapply it. This is by far the best eyeliner I ever had. I highly recommend it for anyone who is looking for an eyeliner to last through anything."
      },
      "Buerkett":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 Sep 2012",
         "title":"Best ever",
         "description":"This is such a great alternative to those who like the pods of eyeliner with separate pens. You have the ease of the pen, but the opacity and weight as if you were \"refilling\" the pen every time. Each stroke is smooth and continuous and it has lasted me a long time. This is perfect for the cat-eye look!"
      },
      "morswagthnurbf":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"29 Jan 2012",
         "title":"24/7 wear!",
         "description":"I absolutely love this eyeliner. I recommend it to everybody! The design has changed over the few months, but I still am a satisfied customer and buy it every now & then when I run out. I have to say I miss the original design tip though.. The new one is kind of difficult to use at first. Oh well, this product has great staying power. It can go all day without it coming off. Even the sweat, dirt, and heat of my drill team practice can not take this stuff off.\n\nOne of my \"Must-Haves\" :D"
      },
      "pbkup":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"7 Sep 2013",
         "title":"Perfect liner",
         "description":"I so love this eyeliner pencil It goes on so smoothly with great coverage and I can do my winged look with such ease. It the best eyeliner I have found"
      },
      "sizza":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Nov 2012",
         "title":"Best liquid eyeliner",
         "description":"Easily the best eyeliner. Works like a pen. Solid black. Doesn't flake or peel throughout the day."
      },
      "ehyaehya":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Mar 2013",
         "title":"Love love love",
         "description":"I am very picky when it comes to my eyeliner but I fell in love with the products first time I used it. The felt tip is very easy to use and so pigmented."
      },
      "ligal":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"15 Dec 2011",
         "title":"um- sticky!!",
         "description":"I put on eyeliner and it stuck my lower eyelid to my upper eyelid...for hours. everytime I blinked - stick - blink - stick\nSo wierd."
      },
      "ginnjuice":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Jan 2015",
         "title":"stays on all day and night",
         "description":"This is the wonder liquid eyeliner. It stays put and lasts forever. The fine tip is easy to use and glides on the eyelid well. I've had this for almost a year now and really am unsure as to when it'll run out and how i'll find out if it's becoming low. Great eyeliner. Worth purchasing!"
      },
      "carrieyoung":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"11 Apr 2013",
         "title":"love it",
         "description":"I have a blocked tear duct and my eye runs a lot! I was looking for an eye liner that would last so that I don't look like I have make up on one eye only! This works great! Would definitely recommend it!"
      },
      "blessedmum":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"1 Dec 2016",
         "title":"used to be better",
         "description":"I think they changed the formula.  Over the last year or so, I've noticed a difference in staying power and how much use I would get out of it.  I have since moved on to Clinique pretty easy."
      },
      "Cara97":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Feb 2017",
         "title":"HOLY GRAIL!!!",
         "description":"This liner is the absolute best! I have oily lids and hooded eyes so I'm always scared my liner will transfer to my upper lid, however this liner has never smudged, feathered, transferred, or ANYTHING. I've worn this once to bed (I know a big no no) and it looked the exact same 24 hours later! Very happy with this liner."
      },
      "MariaJane":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 Sep 2013",
         "title":"Changed my life!",
         "description":"This little number completely changed my relationship with eyeliner! Originally I had been buying drugstore eyeliners thinking that it wasn't something worth splurging on, but after having this demo-d on me during a recent visit to Sephora I vowed to never go back to drugstore liner. The tip is amazing, always well saturated with product and still producing a fine line after weeks of use! The waterproof formula stayed even when the rest of my makeup dripped off in the rain!\nAnyone wondering what new eyeliner to buy? Your search is over."
      },
      "gaberiella":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"2 stars",
         "date":"18 Apr 2013",
         "title":"not for beginners",
         "description":"I bought this because I read that liquid liners are easier to use. Well, not this one. It dries so quickly that if you make a mistake anad try to go over the line, or just go over it to make the line thicker, it removes the previous lline and it's almost impossible to draw a new line without leaving a blan space in its wake. I finally gave up and used a pencil over everything."
      },
      "ACK86":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"22 Jun 2015",
         "title":"Best liquid eyeliner",
         "description":"So easy to apply. Long lasting. I have literally been using the same eyeliner that I bought a year ago, almost everyday and it still isnt dried out. Worth the price!"
      },
      "AubBot":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Feb 2014",
         "title":"Invincible Eyeliner",
         "description":"This is the ONLY eyeliner I have ever found that ACTUALLY stays on through ANYTHING. I am in a sport called Brazilian Jiu Jitsu and it stays on all through practice (which seriously blows my mind). Late night activities (*wink*wink*)? You bet, stays on and in place. Despite this, it comes off easily with any eye makeup remover."
      },
      "calimom":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"13 Mar 2017",
         "title":"The black one is perfect",
         "description":"This liner IN BLACK is amazing--- it's one of my can't-live-without-it products. The BROWN, however, must contain some different ingredient which affects its staying power. The black stays put until I take it off, no matter what. But the brown rubs off and smudges. If it's a humid day forget it- the brown disappears. Weird. I'm going to try the blue to see if it sticks."
      },
      "broooklynashley":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Feb 2013",
         "title":"Amazing!",
         "description":"Super easy to apply and stays on the entire day!"
      },
      "christien":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Apr 2012",
         "title":"Best pen liner",
         "description":"I've been looking for a great pen liner and this is it! The pen is easy to control and provides plenty of color. It dries quickly on the skin so I recommend using a thinner line first then building up because smudging won't happen. I can't believe how precise my shaky hand can be with this great tip. Easy cat eye with this pen, and it doesn't bother my sensitive eyes!!! Will repurchase this great black pen!"
      },
      "emharris":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"4 stars",
         "date":"28 Jul 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"My Go To"
      },
      "shannon24":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"19 Sep 2014",
         "title":"Great coverage, so easy to use!",
         "description":"I've tried pretty much every type of eyeliner out there. Pencils leave too thick a line. The cake liners either don't give an opaque coverage or depend too much on finding the perfect application brush. Gel, again, leave too thick a line and are hard to spread evenly. And finally, the liquid liners in the inkwell-style packaging get the liner all over my lashes, causing me to have to use a lash comb to remove everything before I can curl my lashes. This, however, is different. I've tried plenty of marker-style liners, but they either skipped, dragged, or were too sheer. This one by Stila is perfect. It applies easily with a very thin line and gives an opaque, dark, glossy finish. Especially good is that it doesn't get caught in my lashes, which eliminates all of the combing I'd been doing. It stays on all day without budging and is even truly waterproof, but it's not difficult to remove. Finally, I've found the perfect liner!"
      },
      "misspigpen":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"5 Nov 2014",
         "title":"Some liners tips dry out quicker than others",
         "description":"Ok, so I haven't tried all of the colors, but I have tried 4 of them. I usually go with a cat-eye, which means that the tip of my liner had better hold liner liquid. When the tip of your liner doesn't hold any liquid, you can't achieve the fine lines of a good cat eye look. So far I have loved all of the colors I've tried - teal, indigo, midnight, and olive. Unfortunately, the tips of the teal and indigo dry out really quickly. At first I thought it was just an anomaly but I started keeping track of how many times I used a particular color. And I only got 3 uses out of the Indigo before the tip was dried out. The base of the marker tip was still functional and had liquid in it, but what good is the base of the marker when you need the tip to draw on your liner? Teal was only slightly better, I could probably get 8 uses out of it before the tip had dried out. I'm still testing out the Midnight so I can't give you a number on it, but Olive has lasted me the longest - I've used it at least 20 times and it is still flowing nicely. Lastly, I have oily eyelinds and oftentimes liner disappears from my lids unless I use a waterproof liner and a base. This liner lasts a really long time on my eyelids. The only slightly annoying quality is that sometimes it takes a little extra effort to completely remove the liner because it will leave a faint \"halo\" of your color after you've removed it."
      },
      "LaYeyerZ":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"13 Jun 2016",
         "title":"good eyeliner",
         "description":"This eyeliner is good but still smudges great for beginners like me"
      },
      "cx23":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"19 Sep 2019",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"waste"
      },
      "brennieA":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"5 Sep 2016",
         "title":"perfect eye liner",
         "description":"I love this eye liner!  I have it in alloy, a soft smokey gray and in black. Coming on to get it in the deep blue for my daughter in law.  \r\nI love a soft, slightly smudged eye liner look but I hate the smeary undereye mess I get midday with pencils and gels ( even the waterproof versions!).  This is my eyeliner dream come true---I apply a thickish line, then quickly ( I have the smudge brush in my hand as I apply the liner!), lightly soften and smudge the line. Perfect all day, lasts through workouts\r\n, naps, and 103 degree summer days.  Looks soft, lasts from morning till night, comes off with my regular cleanser and a soft microfiber cloth.  Also could make  a thin line and would probably \"wing\" beautifully and easily---that's just not my style.  It's perfect."
      },
      "CCHutto":{ 
         "extra_info":"<b>Eye Color</b> Gray",
         "stars":"1 star",
         "date":"4 Feb 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"dried out quickly"
      },
      "MirjanaFx":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"1 star",
         "date":"30 Nov 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"Overhyped, poor product"
      },
      "LillyRose249":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"29 Jun 2016",
         "title":"Almost pefect",
         "description":"This eye liner was fantastic when I got it, but I feel like the tip is getting worse with time. It's still not very old, but it just isn't quite as exact as it once was, and I am having more and more trouble getting a perfect line with it. The product itself is pretty good, but I just end up making a thicker line than I want because the tip is not as good as it once was."
      },
      "FloLa":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"7 Nov 2014",
         "title":"Stays Put and Easy To Use",
         "description":"This is good stuff. The liner feels like a thin marker and is easy to apply. I was able to easily wing the line, with a fine point. Usually it takes me multiple tries to get the wing just right but this liner makes it easy. I got the black and the color is rich and very black. Love it."
      },
      "MelT9513":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"7 Jul 2013",
         "title":"Fabulous",
         "description":"I had decided to use liquid liner since all of the pencil liners I've been using have only successfully made me look like a panda by the end of the day. Though many reviews complain about it's loss of color after long-time use, I haven't encountered that problem yet and it's been over half a year since I've started using it. As mentioned before, I was quite the beginner to use Liquid Liner but this particular product was not hard to pick up on at all. I have Asian eyes (though with a double-lid so I guess I can say I'm lucky), and the liner came on very smooth on my lids. I wore it for a whole day in humid weather, and even got my face wet, but it did not smudge at all.\n\nDefinitely satisfied with the product. If you're willing to pay the $20, then I would definitely recommend trying this out!"
      },
      "Munchkin89":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"30 May 2012",
         "title":"Excited!",
         "description":"I hate using liquid eye-liner till I bought this one. It is so easy and smooth. I can put my eye liner quicker than tieing my shoes with this."
      },
      "chickskie":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"4 Jan 2017",
         "title":"Stays true to form out of all eyeliners",
         "description":"Over 20+ years I've tried various eyeliners from expensive brands carried by Sephora and drug store ones as well. This is the only one that doesn't hurt my eyes, stays true to form even after a strenuous CrossFit workout, and shockingly - an old one I found from 2 years ago still works as if it was new (I tested it out and didn't use it as it's long expired). The best part is it the only one that doesn't smudge like raccoon eyes."
      },
      "mskayy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"23 Apr 2014",
         "title":"My go-to waterproof eyeliner",
         "description":"It is definitely waterproof and does not budge the entire day. It takes about 30 seconds to dry completely and then you are good to go. For people who are just trying out liquid eyeliners, this might be a little hard to use at first, but once you practice more, it's super easy."
      },
      "Ang16":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Feb 2015",
         "title":"AMAZING!",
         "description":"I absolutely love, love, LOVE this liquid eyeliner. I have very oily eye lids so most liquid liners (Including waterproof) tend to not stay put on my lids for more than a few hours before they start to fade out. However, when I use my Stila Stay All Day liquid eye liner it stays true to its name and STAYS ALL DAY even throughout the evening without fading, cracking or smudging. If you have oily lids, or want a liner that will stay all day and, by the end of your day look just as good as it did when you first applied it, this is the liquid eyeliner for you. Also, the felt tip makes this liner very easy to use with precise lines."
      },
      "curlygirl2012":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"16 Jun 2012",
         "title":"Best Liquid Eyeliner",
         "description":"This eyeliner is amazing for many reasons:\n1. I have EXTREMELY sensitive eyes and it doesn't even tingle when I wear it.\n2. I went swimming in it and it didn't budge.\n3. I have a very unsteady hand, but this makes the liquid eyeliner look very simple & tangible.\n\nI recently lost my stick & I tried to find a cheaper substitute product, but once you have they best, it's hard to go back! I will be going back to Sephora to buy a new one! Definitely worth the money."
      },
      "phee3452":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Jun 2016",
         "title":"WITCHCRAFT",
         "description":"I have the most oily eyelids and my eyes pour out tears all the time. By some miracle this stays on -- even without primer. If you sleep in this you will wake up with it flawless. Yet it is easily budged if you make a mistake and comes off easily AND is thin enough to put on bottom lashline. Honestly I don't know how they did it thank you Stila. \r\n\r\nTIP: if you get a bad one (dries out), RETURN it. I did and LOVED my second one. I've had it for several months now, still perfect."
      },
      "lebanese":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Jun 2015",
         "title":"AMAZING",
         "description":"This eyeliner is so easy to use and it will make beginners feel like a pro! i like that i have alot of control with it and i can go from really thin natural lines to dramatic bolder looks. it lasts all day and it really is water proof and sweat proof. i find that if all my makeup comes off this eyeliner stays on until i remove it. i would definitely recommend to buy this because its an amazing product."
      },
      "hxleigh":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"29 Aug 2016",
         "title":"so hard to work with",
         "description":"I do winged eyeliner on the daily, and the tip of this eyeliner is so flimsy. It makes it so hard to get a nice, clean wing. I got this in the Sephora Summer Favorites set so thankfully I didn't pay full price for this. Very disappointed."
      },
      "hornedfrog":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Sep 2016",
         "title":"Best eyeliner ever",
         "description":"I have tried multiple eyeliners ranging from drugstore to $40 a piece. This is the best one. It does not smudge and it is easy to apply. The black looks black and not grey or faded. Wonderful purchase."
      },
      "tmoni":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"30 Mar 2014",
         "title":"Best liner out there for women in their late 40s",
         "description":"As a woman who is starting to see those fine lines and the sagging in the upper lid area, I was thrilled when I tried this. Once it's on, you won't see it start to rub off on to your upper lid. LOVE this product."
      },
      "treschic88":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"17 Jun 2014",
         "title":"My go to everyday liner",
         "description":"I absolutely love this liquid eyeliner and it's my go to liner everyday.\n\nI wear liner everyday and I own pencil, gel, liquid at any given time. This liquid liner has more staying power than any gel liner I have ever used. It really does stay on all day for 12+ hours. (I always do prime my eyes beforehand)\n\nAs an Asian girl with a double eyelid, often times my eyeliner would smudge after 6+ hours even with eye primer on. It's difficult to reapply makeup during the day when you're a working girl and I hate to look like a raccoon by the end of the day. This eyeliner really solved all my problems as the pen is very fluid and easy to use. Once the formula is dry, it doesn't budge. When it's time to remove, this also is easy to take off with any eye make up remover.\n\nI would definitely recommend this product and I have even stockpiled this eyeliner!"
      },
      "button88":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"15 Feb 2014",
         "title":"Stila",
         "description":"Great waterproof eye liner all day long wear easy to apply my go to liner everyday must try!"
      },
      "suzie225":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"15 Jul 2016",
         "title":"Not what it used to be...",
         "description":"I used to love this eyeliner and recommended it to almost everyone who wanted a felt tip liner. I have owned multiple of the black, but also have used midnight, teal (from the brights collection I think) and dark brown. However, my last repurchase of black made me so sad. It almost seems like there isn't enough of the product in the tube to saturate the liner tip. It's super frustrating. But, I have found that if you store it upside down it will work a little better."
      },
      "themakeupcloset":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"9 Jan 2017",
         "title":"horrible",
         "description":"It's garbage. It is decent (not great for the price, by any means) the first 3 times you use it. It then dries out, making what's left of it very difficult to apply in a smooth way. I am in my 40s so I am not even a consumer who likes to do a lot of dramatic eye looks; rather, I typically want a nice looking product with staying power. Pretty simple. \r\n\r\nI am a Stila fan so I was excited to try this liner but it was hugely disappointing."
      },
      "abbynormal":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"4 Feb 2011",
         "title":"Worst Liquid Eye Liner ever",
         "description":"Ugh, I can't believe how many positive reviews there are. Will be interesting to see if this review gets posted. I rarely ever do a review, usually only when I find something amazing. I have used many eyeliners over the years....all types. I'm sure I currently have 100+ in my stash. I bought this in the Indigo. It was sticky and made my eyelid keep sticking to my upper eyelid. I did everything to make it dry. Hours later, still sticking and lthe color transferred to my upper eyelid -not attractive!! I have used liquid eyeliners of this type from many different brands, I can't think of one other that was sticky and none transferred as badly as this. Yuck!"
      },
      "Muineth":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"22 Aug 2015",
         "title":"Alright but...",
         "description":"I bought this eyeliner in White. I was blown away by it but just after two uses, the tip has become discoloured (probably should avoid using it over eyeshadow). It's a bit tricky to work with because product only really comes out at the base of the felt and slowly spreads to the tip- meaning a sharp line is a bit tricky to achieve. The product dries quickly but if you're not satisfied with the coverage and try to go in with some more, it can become a bit cakey, or slightly \"crusty\".\nIn all, I think it's a good product but requires a bit more time and patience to work with than other eyeliners."
      },
      "alexandra825":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"23 Apr 2014",
         "title":"periwinkle",
         "description":"What a great color; it really makes my green eyes pop! Smooth, even application and great staying power. Look forward to wearing this shade all summer."
      },
      "fistinacrawford":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 Oct 2012",
         "title":"The best liquid eyeliner you'll ever use",
         "description":"Simply put: the best liquid eyeliner you'll ever use. I've tried them all, people. You could put this on in the morning and then subsist through five straight days IN the pool -- and this would STILL be on. Yet you don't need turpentine to get it off. BUY THIS. You won't be sorry if you're looking for something long-lasting, bold (if drawn as such) and easy to remove. This will be my go-to liquid for years."
      },
      "stuuuuuuuuuuu":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"18 May 2016",
         "title":"WAS the best eyeliner. Not anymore",
         "description":"WAS my favorite eyeliner since forever, but now they changed the box (from plain brown to shiny silver/gold box) and made in Korea (previously made in Japan). Huge difference. Previous formula went on smoothly and stayed on my top eyelid all day, even after 2 hours of sweaty workout and rubbing my eyes in the shower. Now, it runs off my top eyelid onto my lower eyelid after 15 minutes of applying it in the morning. Plus the felt tip of the new version is stiff and sharp as he||, in a bad way. Time to look for a new eyeliner. Bummer."
      },
      "MaddLinds":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Apr 2017",
         "title":"WORTH IT!!",
         "description":"My holy grail of eyeliners. Easy to use and lots of control. Very pigmented. Not patchy at all like if found with the Kat Von D tattoo liner. Glides on smooth!! Worth the splurge!!"
      },
      "MissPhryne":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Mar 2017",
         "title":"The only liner that stays put",
         "description":"I've used so many different liquid and cream eyeliners. This is the only one that lasts through weeping during Nicolas Spark movies, rainstorms, and working out. \r\n\r\nIt goes on smooth. It's easy to control during application, and the felt tip is perfect size."
      },
      "Momoxoxo":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Aug 2012",
         "title":"OMG AMAZING!!!!!!!",
         "description":"my favorite liquid liner EVER!!!!! i use it in a cat eye on top, line the whole eye, use it in a short line underneath on the outer part, line half the eye, and it is so amazing, that i even use it on my waterline, and it doesn't sting or burn at all, fade away, or smudge."
      },
      "Dftns107":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"5 Feb 2013",
         "title":"When i first bought this i was very excited i heard so many good things about it. I have oily eyelids and its VERY hard to find products that wont end up under my eyes. In the beginning i loved this liner worked great easy to apply until about the 3rd time. First thing it started to dry up at the tip and i had to cut off the very bottom to get it to work, worked fine then. A couple days later i tried again when i got to the second eye it'd barely come out. i waited a long time and tried to finish it i ended up having to completely take this off. I SO wish they would fix the drying issue this is a great liner but needs improvement. I would not buy this again unless it was fixed. It made it unusable and a waste of money.",
         "description":""
      },
      "breezy1989":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"14 Mar 2015",
         "title":"Not very dependable… out of town buyers beware!",
         "description":"I purchased this at the Victoria store just before flying back to Prince George. It worked wonderfully for the first 6 days, then dried out and the liquid never made it to the tip of the brush, so I couldn’t make a cat eye anymore. I contacted customer service and was told they wouldn’t let me exchange it through mail because I hadn’t purchased it online. The nearest store is 500 km away! This was my first expensive eyeliner investment, and I won’t be doing it again!"
      },
      "Jgoffee":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"10 Mar 2017",
         "title":"looks awesome",
         "description":"Ok so I've come to terms with the fact that NO liquid eyeliner is completely waterproof, not this or Kay von d or Marc jacobs or any of them. But I love the liquid eyeliner look so I do this trick. I love the Stila liquid eyeliner so I do my eyes with that first - after primer and eyeshadow- and let it dry. Then I sharpen my tarte sex kitten eyeliner to a nice point and go overtop the stila liner very carefully. THIS combo is actually waterproof-my eyes constantly water especially in cold weather and this stays put. This way I get the look of liquid with the waterproof-ness of the crayon. And if you really want it to stay, top off with eyeshadow  over top, I use a fine eyeliner brush to make sure I stay in the original lines. This stays put through crying and everything. Hope this helps someone!"
      },
      "kmt96":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Feb 2016",
         "title":"Will Buy Again",
         "description":"I have EXTREMELY oily skin and unlike other liquid liners, this liner didn't budge. It's worth the $22"
      },
      "monkey547":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"11 Sep 2016",
         "title":"pretty decent",
         "description":"I'm on the market for a new eyeliner and wanted to try this one. Lines are clean and doesn't try out quickly and stays for most of the day (I don't like long wear because they're hard to take off) but trying to do a cat eye on this is hard. It's pretty sheer and takes multiple applies to get it dark enough, and you still have a chance of it smearing since it's takes a bit to dry."
      },
      "Bubblepop4464":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"9 Dec 2013",
         "title":"really does stay on all day!",
         "description":"pros: doesn't smudge or fade. it really does stay on all day,. it's pretty easy to apply.\ncons: hard to get off. if you mess up and try to fix it, unless you fix it immediately, it will smudge.\nI mess up my eyeliner a lot so having one that sets right away can be an issue for me. I just have cotton swabs nearby and it's usually okay. but there have been a few days where I had to make it look like I was attempting a smokey eye when I really wasn't.\nOther than that, it's a great eyeliner. but if you have a really unsteady hand, I wouldn't try it."
      },
      "TLoNYC":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Dec 2014",
         "title":"The eyeliner game changer",
         "description":"This stuff is amazing. Sometimes drugstore substitutes are just as good as Sephora's quality makeup. No other eyeliner measures up to this one. The liquid is rich and pigmented. It glides on and stays all day. I rub my face and screw my wings up all the time but I'm sure it would stay all day if I'm more careful. I wear eyeliner every day and this lasts me 2-3 months. That makes $20 more reasonable for eyeliner.Just beautiful. Buy it and never look back."
      },
      "MissKayess":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"18 Jul 2016",
         "title":"Awful",
         "description":"Not sure if I received a bad one, or what! First off, it does not go on very well. I was constantly re-shaking it trying to get it to go on dark enough. It still went on blotchy. Second, it certainly does not stay on all day as advertised. It lasts at most 2 hours."
      },
      "marlene58":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"1 star",
         "date":"4 Sep 2011",
         "title":"Not waterproof !!!",
         "description":"The only way they can say this is waterproof is because you don't need water to take it off..... It will be in FLAKES on your cheeks within a hour...\nI was soooo disappointed....it went on very nice, color was great......I'm just glad I tried it out before I went out.... All liquid\nW/P eyeliners I've tried have flaked of some but this one was really bad.... I even tried it with a primer and it was the same result.... Save your money on this one.."
      },
      "Firefightress":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"20 Feb 2014",
         "title":"Best eyeliner",
         "description":"This eyeliner is a proven must for me. I have only tried the brown/green...but I love them. As a firefighter, if it can last through all day wear & through the night, occasional fires, exercise, & still be there 24 hours later...this is why its #1..my only complaint, is used Daily, it only lasts about 3-4 weeks at best. wish it lasted longer, but for the performance I'm happy!!"
      },
      "erinvai":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Feb 2014",
         "title":"Super long-wearing!",
         "description":"The first time I used this eye liner, I knew it was going to be a long day. I had class in the morning and then a concert right after. I applied this liner at about 9am and when I got home at 1am there was absolutely no smudging! My eyeliner always smudges on me, especially the wing because I do winged eyeliner everyday. This did not move at all! I think it's going to be the only eyeliner I ever use!"
      },
      "meautybagic":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"15 Aug 2011",
         "title":"Really waterproof &amp; really easy",
         "description":"Tip stays firm (doesn't bend) so application is smooth and controllable. Love the Alloy - great gray for blue eyes!"
      },
      "TKUP":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"8 Nov 2012",
         "title":"Stays on ALL day....FOR REAL!!!",
         "description":"When i first saw this liquid eyeliner, i was a little hesitant because it was liquid. I had never bought a liquid eyeliner because i always just assumed that they would smudge easily. But, when i got this Stila eyeliner (I got it in Moss Green) it stayed on all day! Sometimes, i would rub my eyes by accident and then realize, but i would look in the mirror and see that nothing had changed! I love this eyeliner, and i HIGHLY recommend it!"
      },
      "nikki93":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"22 Oct 2013",
         "title":"Best eyeliner",
         "description":"This is my favourite eyeliner ever. Goes on so smoothly and lasts all day looking fresh! I can even wake up after a night of partying with it still looking okay! I also get a perfect cat-eye each time I apply"
      },
      "sherlove":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"16 Mar 2014",
         "title":"Reliable, Essential",
         "description":"This is definitely my go to makeup piece. It's essential to my beauty routine. I have monolid eyes, so it's always a problem for me that most other eye liners smudge and rub off onto my lower eye area, but this eye liner stays put. Luckily, it still comes off with some eye makeup remover, but water will not take this liner off! I ran 7 miles with this eye liner on once and nothing budged. It's highly pigmented too and easy to use, I love it!"
      },
      "morgan5667":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"30 Nov 2015",
         "title":"Although it isn't completely matte, which is the only thing that could make this better, it's the best eyeliner I have used! Lasts all day and doesn't smudge.",
         "description":""
      },
      "moneill":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"10 Dec 2010",
         "title":"Best liquid eyeliner",
         "description":"As a liquid eyeliner fanatic, I previously was using the Sephora brand. I liked it but HATED how it would dry up literally after 3-4 times use (probably a bit exaggerated...but nonetheless, it dried up FAST)! I inquired a Sales Associate who then directed me to the STILA, claiming it was his \"FAV\" and the \"BEST\" he has come across thus far. For $20, I contemplated for a minute but he reminded me that I could return it if I was not happy. SOOOO GLAD I BOUGHT IT! Definitely worth the money. I purchased it over 2 months ago, and it still works like new! The liquid comes out just as bright and strong as the first use. Definitely found my new Liquid Eye Liner! It is very easy to control - and easy to manipulate depending on how thick you want the line. Lasts all day too!"
      },
      "GiaLW":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Jun 2016",
         "title":"Best Long Lasting Eyeliner",
         "description":"A while ago, I began a mission to find the best eyeliner. I have tried nearly every eyeliner on the market and this one is the most waterproof, long lasting, non-smudging one I have come across. It lasts forever and it doesn't budge at all. This one is, by far, my most highly recommended eyeliner. The only downside is that the tip of the pen sometimes loses it's sharpness. I snip the straggly bits with a small pair of scissors and that usually does the trick."
      },
      "tss2e":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"8 Feb 2012",
         "title":"I Love this Eyeliner",
         "description":"This is the best eye liner I have ever used and I have tried many. It applied easily, stays on all day and is easy to remove. However, if you are looking for a smudgable eye liner, this one is not for you. You should try the Stila smudge stick waterproof eye liner which is also fabulous for obtaining that look."
      },
      "viciousbadger":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"19 Feb 2015",
         "title":"The Worst.",
         "description":"Really had high hopes for this, and sadly I didn't read any of the negative reviews prior to purchasing this disappointing product. All was well until about halfway through my day and then I started to notice my eye lids feeling..sticky. Yes sticky! I looked in the mirror and was horrified to find brown sticky smears of Stila \"stay all day\" liner everywhere but where I wanted it. I am still at work with this disaster product on. I can't wait to get home and wash this garbage off. Polar opposite of waterproof! I got rid of the packaging last night so I am unsure if Sephora will accept this as a return. If not, it's going in the trash."
      },
      "PurpleButterfly":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"9 Aug 2010",
         "title":"My daughter loved this product",
         "description":"Sent as a gift. My daughter loved it. Long lasting. Great value."
      },
      "aew518":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 May 2012",
         "title":"Can't believe I lost $20 on this",
         "description":"One week after purchase it has gone dry and the tip already started to fray. It's now completely unusable- it applies unevenly and flakes. I bought it because it was a best seller- don't believe the hype!"
      },
      "sarawtan":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"19 Oct 2012",
         "title":"ALMOST perfect",
         "description":"I am an avid user of liquid eyeliner. Used this for the first time a couple weeks ago, and I thought I fell in love. It was easy for me to apply and stayed on all day/night. At that moment, I thought I found the eye liner I would buy for life! The love for this product quickly disappeared seven days later when the liner was completely used up. I gave it a second try and bought a replacement. It lasted only a week as well! Love the product, but I don't believe a week long eye liner is worth the $20 price tag. Nice concept and design, BUT sorry stila! I'm never buying this again."
      },
      "mamalu":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"22 Mar 2010",
         "title":"Great Product",
         "description":"This liquid liner is so easy to apply. I like that the tip is flexible and once you lay it on your lash line, you just sweep it across for the perfect line. I tend to be shaky with eyeliner, but not this one. Would definitely recommend this product."
      },
      "KAVIB":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"31 Jan 2017",
         "title":"Best Liquid Eye Liner",
         "description":"I've tried every type of eyeliner across many brands. This is by far the best one, no question. The black is very black, and the pen makes application easy and foolproof. The tip is precise and creates the perfect cat eye. I put my make-up on at 7am and this eyeliner lasts me until I get home late at night. It even stays on (and does not smudge) during my workout classes - including spin! This has been and will always be a staple for me."
      },
      "gwenpool":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"5 Feb 2017",
         "title":"at least easy to use",
         "description":"this liner is very easy to use but not waterproof as it may seem. the wings of my liner would always half-disappear by a couple of hours and i would have to carry the eyeliner with me to touch up every so often. for the price, i'd rather just look for a waterproof eyeliner that'll actually work"
      },
      "invaderzillm":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"13 May 2016",
         "title":"Good eyeliner",
         "description":"Goes on easily and stays on, for the most part.\r\nWaterproof? Ehh, not so much; that'd be my biggest complaint.\r\nAfter using for awhile, I'd sometimes need to trim the tip as little wisps would start affecting the application. \r\nDespite my complaints, I still think it's a good liquid eye liner (I'm Asian), especially for the price."
      },
      "madmaggzyeah":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Jan 2014",
         "title":"My holy grail liquid liner",
         "description":"I HAVE TRIED EVERYTHING and this is the only thing that is truly truly waterproof and smudge proof(once it sets.) Every other liquid or cream liner I have tried always leaves a black shadow on my upper lids... making it impossible to wear light shadows(even with a primer and even when I set it with a black shadow.) With this, I can do perfect pin up eyes and not have to worry about it transferring to my shadow. I've slept with this stuff on and it's perfect even in the morning, yet it's easy to take off with makeup remover or wipes. 4 of these babies later, I will never try another liquid liner again. I'm hooked."
      },
      "chels91":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Sep 2014",
         "title":"perfect eyeliner",
         "description":"I tried urban decay, lorac gel liner , benefit the new gel pen and of course sephoras liquid liner but nothing like this ! Its smooth easy to apply stays on forever mess free i mean just perfect"
      },
      "denverdame":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 Nov 2012",
         "title":"Cat-Eyes for Days",
         "description":"I adore this eyeliner - not only is it easy to apply, but it dries quickly and stays on all day. But don't worry! Its very easy to remove with a face-up wipe or make-up remover."
      },
      "peggy00":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"3 Apr 2014",
         "title":"not waterproof!",
         "description":"I don't understand the hype! It doesn't last and smears easily."
      },
      "mckenziew":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"6 Feb 2017",
         "title":"not waterproof",
         "description":"listen. this liquid felt tip is my ride or die eyeliner i find myself hating brushes bc i feel like you get too much excess product. felt tips on the other hand tend to dry out so quickly.. not this. this pen lasts quite a long time for a liquid liner especially if used almost daily! the color payoff and precise application is so so beautiful. only downside is that its /definitely/ not waterproof but i can handle that."
      },
      "amackx":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Feb 2015",
         "title":"best eyeliner out there!",
         "description":"Everyone knows that a perfect eyeliner is a woman's life source and this product ensures you will get that perfect point every time easily! Goes on crisp and precise, and is super pigmented. Lasts all day and you don't have to worry about it running or smudging because it does not budge once you put it on! I have tried so many different brands and many different methods of eyeliner and this is the one and only eyeliner product I will get from now on and until the end of time. I cannot stress how easy it is to get perfect eyeliner with this product. I used to rip my hair out trying to perfect my eyeliner game with pencils and gels and now I get the perfect line every time in less than a minute no problem! Not sure how waterproof it is in terms of swimming but I can vouch that it wont run after long crying sessions. But, when you want it off you can get it off easy peasy! This product should be a permanent staple in every woman's makeup bag for sure!"
      },
      "cecilita":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Oct 2015",
         "title":"I was impressed with the liner but after a while it smudged, so it's not long lasting.",
         "description":""
      },
      "kokorokristin":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"24 Feb 2014",
         "title":"Really?",
         "description":"I bought this because I heard it was one of the best available. However, it takes me several passes in order to get an opaque black line, and whenever I try to curl my eyelashes, half the product comes off, even if its supposedly dry. Not worth $20. It is pretty waterproof and produces a clean line, though."
      },
      "riella":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"21 Feb 2013",
         "title":"Folds in on itself",
         "description":"I expected to love this based on Sephora reviews, but it doesn't work right. The tip is extremely thin for precise application, but it isn't firm enough. When I press on it, it bends and folds back on itself until it reaches a thick enough part that it withstands the pressure. This could be solved by cutting the tip off, but that defeats the purpose and leaves you with a thick blunt tip. I returned this after one disastrous use.\n\nOn the plus side, the thick lines I managed to apply did take some doing to get off, so it is long-wearing."
      },
      "introvertkitty":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"15 Apr 2018",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"I work a 12 hour day."
      },
      "HateFoundation":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"6 Nov 2016",
         "title":"Formula Changed",
         "description":"I think the formula must have changed since it's made in Korea instead of Japan as the original one. It came in Sephora Favorite set. Whey applying, I noticed it was more diluted and runny. Smudged right away when tear came out. After 5 hours, it was everywhere even with Smash box 24 hour primer. Never had this kind of problem with the original formula. Thinking about returning the whole set."
      },
      "DrKhuly":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"12 Aug 2016",
         "title":"Easy to use. NOT waterproof!",
         "description":"I'm a stickler for honest marketing. This gets three stars not because it's not a good product. It IS a good product because it's super-easy to apply and very quick drying. What I don;t like is that it's NOT waterproof, as billed. To check, just apply it to the back of your hand, wait till it dries and try to wipe it off a few minutes later. With a little water (or spit, ladies) it quickly comes off. But my problem with this product goes beyond that ... if applied to an unprepped lid (no primer no base shadow), it doesn't stay dark back. It sort of fades to a light gray."
      },
      "lovedominique":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Apr 2014",
         "title":"My dream come true in eyeliner form!",
         "description":"How did I ever live life without this eyeliner??? Not to sound so dramatic, but seriously, I absolutely adore this eyeliner and it has made my daily make-up routine so much more convenient. It has made winging my eyes so easy a caveman could do it. It dries faster than any other liquid-type eyeliner I have (which is very helpful since I have asian-shaped eyes and when I've used other eyeliners that take a while to dry, it always ends up on the top of my eyelid when I blink -_-). Plus, the precision of the tip is just remarkable. Thank the heavens a friend of mine recommended it to me. I actually was the one who asked her what eyeliner she uses because her eyes always looked on point. Now I can actually say the same for myself!\n\nCons: Well not really a con, but just to let you know it's not waterproof. I've swam with it on and by the end of my time in the pool it was completely off. But why the heck was I wearing eyeliner to go swimming anyway.. Anyhow, it's perfect for all other occasions! :)"
      },
      "endophasia":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"13 Aug 2011",
         "title":"Best Liquid Eyeliner on the Market",
         "description":"This was the first liquid eyeliner I've ever tried and there's no way I'm going back. After my fist stick ran out it was impossible to find another that was as good as this. Perfect for doing a cat's eye or just for everyday wear. Stays on all day and does not smudge at all. Buying this every single time for sure."
      },
      "whitecoat2dress":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"1 Jul 2016",
         "title":"Holy grail eyeliner",
         "description":"Eyeliner is one of the few things that I can't leave home without, and the Stila All Day Waterproof Eyeliner in Jet Black is my holy grail product. The tip makes it so easy to create a wing and control the thickness of application. Plus, I never worry about this rubbing off, smearing, or washing off in rain. Even though it's pricier that many other liquid eyeliners, it's so worth it! I'll continue to repurchase this! *Tips: Just make sure to store it with the tip down to prevent it from drying out too quickly. Also, once it does dry out, I still use this to then apply other gel eyeliners that come in jars."
      },
      "patseatoo":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"12 Apr 2013",
         "title":"Stila All Day Waterproof Liquid Eye Liner",
         "description":"I only use this Liquid Eye Liner. Glides on and very easy to use and you can get a very thin line which is my preference. Does indeed stay on all day and night. Love this product."
      },
      "crstanley":{ 
         "extra_info":"<b>Skin Tone</b> Light",
         "stars":"2 stars",
         "date":"7 Apr 2013",
         "title":"Runs out quickly",
         "description":"Great product, but no more than I used it, it ran out In about 2 months which I considered a rather poor value. If you are ready to invest the money and need a sharp, long-lasting liner, then it is the perfect choice. Otherwise, I wouldn't recommend it."
      },
      "NonSponTane":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"18 Jul 2014",
         "title":"Best Liquid Liner (Black Only)",
         "description":"I've tried other liquid liners, including Kat Von D's, and came back to Stila. The pen offers great control and the pen is always moist. I found that the Kat Von D pen dried out quickly. I only gave this eyeliner four stars because the other colors DID dry out quickly. Plus, on my medium deep skin (I'm 3Y12 on the Sephora Pantone scale) the other colors often didn't show up as being very colorful. I tried Dark Brown, Moss, and Indigo. I thought Dark Brown would offer me a more \"natural\" eye, but it was practically invisible on my skin. Neither Moss nor Indigo were vibrant enough to accent my eye color. I can only recommend the basic Black."
      },
      "zmaria":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"4 Jul 2015",
         "title":"its ok",
         "description":"Stella products are super awesome but for some reason this eyeliner I don't personality don't like , it misses spaces while putting it on I have to keep retouching to fill in am use to just draw the line and drys that it . I got this eyeliner just because at the store they didn't have the one I usually buy ."
      },
      "photogurl333":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"8 Nov 2016",
         "title":"Love this liner!",
         "description":"I spent a lot of time searching for a quality liquid liner and landed on this. It goes on so smooth and doesn't melt at all during the day. Unfortunately I feel like I go through it fairly quickly and the last bit in the pen never goes on quite as smooth."
      },
      "Cinnamon29":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"12 Nov 2015",
         "title":"Finally!",
         "description":"Finally I have found an eyeliner the doesn't leave black arches on my eye lids. I have bought MANY different brands, They are all the same no matter what they promised to do. None of them did as they promised. But, this one does. I absolutely love it. I'm on my second tube.Well, the first one I bought as a combo pack. It came in a little tube which was fine, because I could use it like a tester to see if I like it. Turns out I loved it, so I bought this one. I've had it for a few months and it's still going strong. I will buy yet another when the time comes. Ladies, this is the one your looking for! Enjoy!"
      },
      "lisabush":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Nov 2013",
         "title":"Best Liquid Eyeliner",
         "description":"Easy to use. Easy to correct. What else could you ask for?"
      },
      "Niniane":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"21 Mar 2015",
         "title":"A reliable eyeliner - no smudging!",
         "description":"I've been pretty happy with this liner. It goes on easily and I can go all day without ever having to worry about it smudging (even when I've cried or forgotten I'm wearing it and rub my eyes!)\n\nThe ONLY thing that would make this liner better is if it was a little more matte. (I read that it was matte before I bought it, but to my eye, it has a bit of shine to it.)"
      },
      "Jennifer00":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Mar 2017",
         "title":"Best eyeliner!!!",
         "description":"This is the best liquid eyeliner I have ever purchased. I finally was able to do a \"cat-eyed\" look with this eyeliner. I have tried different eyeliners, but always failed!!! You will not regret this purchase!"
      },
      "JaneL3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Oct 2016",
         "title":"**APPLAUSE**",
         "description":"Oh my goodness.. I am so upset it has taken me THIS long to find this product. I am Asian and my eyes smudge every eyeliner I have ever tried (I currently have 7 different brands in my make up bag), I am constantly walking around with qtips and make up remover and frequented the restroom to clean up under my eyes. But now I don't have to. I purchased this last week and wore it all weekend. I woke up early (5 am), put make up, ran errands and did weekend stuff, came home and took a 3 hour nap and woke up and the eyeliner had not moved. I had to reapply foundation for dinner but did not touch my eyes. THIS IS THE HOLY GRAIL OF ALL EYELINERS.... go get it!"
      },
      "zgirl2":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"12 Feb 2014",
         "title":"I'm feeling blue",
         "description":"Had to try the Stila liquid liner in Midnight. Softer than black but just as effective, it really stays put once applied, so any mistakes need to be addressed PRONTO with a pointed cotton swab. This brown eyed girl likes the effect of the dark blue liner with grey shadow."
      },
      "NYshortgirl":{ 
         "extra_info":"<b>Skin Tone</b> Medium",
         "stars":"5 stars",
         "date":"11 May 2014",
         "title":"Umber= NEW LOVE!",
         "description":"Stila has come a LONG way in the past few years in terms of the quality & staying power of their eye shadows & liners! I have purchased several of these in the past few months but this review is for Umber (a burnt orange.) LOVE the selection of colors to choose from! (I'm so tired of having to choose from the usual black, brown, purple & blue!) Umber is a beautiful matte (no glitter or sparkle) burnt orange color. LOVE IT!! These liners really do stay a good 14-16 hours (keep in mind I do use UD Primer Potion every day because I have oily lids so that may help) Love the fact that I can control the thickness or thinness of the line with these liners! Absolutely NO flaking or smudging after a 14 hour workday & workouts. LOVE these! My new favorite liner...these might just take the place of my favorite MUFE liquid Aqualiners. You can smudge these, just do quickly before it dries. But these don't budge once they are dry so keep that in mind. Can't say enough good things about these liners....great color payoff, longwearing, great selection of colors to choose from & truly waterproof, smudgeproof & sweat proof! LOVE!!!"
      },
      "shivagrrl":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"5 Feb 2017",
         "title":"desert island? I'm taking this with me.",
         "description":"Seriously, one of the best eyeliners on the market. I have hooded eyes and eyeliner consistently ends up transferring to my upper lids all of the time. When I use this with primer, it stays all day without smudging. It's even lasted through hot yoga. The tip is super precise for a stiletto sharp cat eye flick. I can get sooo close to my lashes and a tight pinpoint line into the inner corners. It dries fast with a slight sheen and it's super black. I'm an cat eye junkie so between this and the Benefit Push Up, I'll in heaven. I hope this never gets discontinued because I'd be lost without it."
      },
      "Seoulbunny":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"21 Aug 2014",
         "title":"Overrated",
         "description":"I expected great things based on the reviews however I was disappointed. Pros... dries quickly, easy to dispense, comes out evenly. Cons... it is not very pigmented, it sticks to the skin like a sticker, it stays very well.... in certain spots. Not forgiving.I find it so difficult, it collects dust in my bag."
      },
      "Sarah13Jayy":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"3 Feb 2016",
         "title":"definitely waterproof",
         "description":"Wore this eyeliner and it stayed flawless all day. Later that evening had my heart completely broken and cried my eyes out, but on the plus side when I went to clean up what I thought was going to be a mess the eyeliner was still in place and still flawless. Does as advertised."
      },
      "TAJo":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"2 stars",
         "date":"27 Jun 2014",
         "title":"Lasted less than two weeks",
         "description":"Initially, I really liked this product, and it performed as the store personnel said it would -- long-lasting, waterproof, and easy to use. However, within two weeks, I could not use it at all. There was no liquid left, or at least it didn't come out of the tube/brush! I hope this is unique to the one item that I purchased, but felt like I should at least share it with others."
      },
      "kfarbs":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"1 Sep 2015",
         "title":"Everyday all day lasting eyeliner",
         "description":"I do not write many reviews, but this product I had to. I am on my third one already and I love it. It is really easy to use, the only thing I noticed was that if you wear eyeliner 24/7 like me and you like it to be consistently dark this does the trick in one sweep. You do not need to coat it over and over to get the desired darkness you want. Also, I use the dark brown because I have green eyes and fair skin and I do not like the look of black eyeliner on me personally. I like the felt tip because it is a perfect balance of being sturdy as well as flexible. Very hypoallergenic, my eyes are very sensitive and this eyeliner does not irritate them whatsoever."
      },
      "evie87":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"21 Jun 2013",
         "title":"I don't really get this eye liner. it's like trying to use a marker that's running out of ink. the tip doesn't stay pointed, either.",
         "description":""
      },
      "queenVmakeup":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"20 Jun 2014",
         "title":"Daily need",
         "description":"I have been purchasing this eyeliner since 2011. I don’t think I can live without it. I love the intense black color and long lasting stay. I have oily skin but this eyeliner stays in place without any primer. I use this eyeliner when going out, going to work, or just running errands. You can do multiple looks with a single stroke. I would really recommend for beginners."
      },
      "sherdiet":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"18 Oct 2012",
         "title":"rich color",
         "description":"The colors rich and dark brown, but it wore off through my work day, and I sit in an office, I'm not outdoors. It didn't slide or smear off, just disappeared. And when you put it on it runs a little into your wrinkles, which isn't good. But the color is nice. I took the product back and got my favorite Stila Smudge Pot liner. The only reason I didn't get it to begin with, the product dries up before you finish it."
      },
      "betafish":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"9 Feb 2015",
         "title":"Best eyeliner!",
         "description":"stays all day, never smudges or fades, easy to apply, there is nothing wrong with this product! My favorite out of all the eyeliners i've tried so far."
      },
      "ALI6783":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Aug 2016",
         "title":"AMAZING",
         "description":"This eyeliner is EVERYTHING. It is easy to glide on and there is no smudging what so ever. I put it on and took the 12  flight and when I got off the plane the eyeliner did not move an inch. I was also constantly touching my eyes the whole time. It is simply amazing, hands down the best eyeliner I have ever tried."
      },
      "tinuviel187":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Apr 2014",
         "title":"Perfect",
         "description":"I am in love with this liner. The application is much easier than some others that I have tried. Like any liquid liner, it requires a little care, but this one is more forgiving than others, and easier to make fine lines and sharp points. I'll never use anything else again."
      },
      "ganderson":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"10 May 2017",
         "title":"eh",
         "description":"It dried out in about a month, despite the fact that I closed the lid every time and only used it once a week or so.  Not to mention, the tip kind of falls apart.  You're better off getting a different liner.  The color quality is good, but there's not longevity and the tip doesn't last long or work well."
      },
      "makeupnmore":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"24 Aug 2014",
         "title":"ehhh...",
         "description":"I was so excited to try this liner and see what all the fuss was about. I will start by saying that it is NOT worth the hype. First of all, you have to layer it to get it to be black. At first layer you get something like a light gray. Next, it isn't that easy to use! It took me a good three weeks or so to really get the hang of it. And I've used so many different liquid liners. Once you do learn how to use it though, it's not horrible. I mean, I still use it.. I just wish it was as good as peo"
      },
      "ishygurl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 Aug 2014",
         "title":"LOVE THIS PRODUCT! A MUST HAVE!",
         "description":"I love this product., it is amazing and super easy to use. I am usually not a cat eye person or anyone who usually uses eye liner on the top. but I do it all the time now just because of how easy it is with this product!"
      },
      "goffai":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Feb 2014",
         "title":"Changed my life",
         "description":"I have not had great interactions with liquid eyeliner in the past. But this eyeliner is amazing! It is easy to apply and lasts until you wash it off. It has totally changed the way that my eye make up looks."
      },
      "peedee":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"14 Oct 2010",
         "title":"Great great - wish you had it blue or brown",
         "description":""
      },
      "Pen31":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Apr 2013",
         "title":"this eyeliner rocks",
         "description":"This is the first time I have ever used liquid eyeliner. For years I went back and forth between pencil and using a brush and eyeshadow. No matter what i did, eyeshadow primer and powder after, etc, i always ended up looking racoons eyed. (except for one Chanel product). This eyeliner that was suggested to me by a sephora employee changed everything. The tip makes it really easy to make a very thin line so it does not look too thick or inky. It smudges so much less and it stays on all day!"
      },
      "cher07":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"31 May 2011",
         "title":"Really, Really Stays On",
         "description":"So I don't generally wear makeup to work out, but when I do a run at the end of the day I usually leave it on. I took this eyeliner out on a 4-mile run in 90-degree heat and major humidity. It didn't budge. I then decided to further test it by not removing it for my post-run shower. It still stayed on.\nFinally, when I used an eye-makeup remover to take it off, it came off quite easily. I highly recommend."
      },
      "Mereca":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"26 Sep 2015",
         "title":"all day every day",
         "description":"i love this eyeliner! i wear eyeliner every day or almost everyday and i would recommend this stila one! the fact thatits a marker like tip makes it so great to make my wing! i always get complimented on my liner so i def tell everyone to get this one! the only reason why i made it 4 stars and not 5 is that i feel like i have to buy more than one within a month so it drys out but makes sense since its a daily item on mine!"
      },
      "Steacy":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Dec 2014",
         "title":"ALL Day Wear",
         "description":"Great away of colors to choose from. I have five of them and there has never been any movement or smudging after a whole day of wear. Great for a clean cat eye."
      },
      "brittlovesallie":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"20 Apr 2014",
         "title":"Great",
         "description":"Goes on smooth and easy."
      },
      "HalfPast5ive":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Sep 2016",
         "title":"Best Eyeliner Ever in Life",
         "description":"This stays on alllllll dayyyyy, is very black, and doesn't smudge. It still looks perfect even after the gym. Don't waste your time with other liquid eyeliners."
      },
      "patty826":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Aug 2011",
         "title":"Best liquid eye liner I've come across to date",
         "description":"It gives the teeniest precise line imaginable. I can get right in the inner corner of my eye, tightline, draw an everyday thin line with a small flick, or ginormous cat eyes with this product. It is absolutely fantastic. The applicator has just the right amount of bend to make drawing curved lines easy, and lets me draw much thicker lines using the side rather than the tip. I bought this in Moss, it's a fantastic alternative for black for my really light skin. It is noticeably dark green up close, but far away you can't really notice. The product is very opaque and dries with a semi-glossy finish quite quickly. If you make a mistake, a slightly damp q tip can erase mistakes without giving that terrible stain which can rin the rest of the look.\n\nBasiclly, I recommend this product to anyone who enjoys easy liquid liner. The gray color is quite cool as well, found myself torn at the store between the two."
      },
      "iratikaffairs":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Apr 2011",
         "title":"ALL DAY WEAR MOST DEFINITELY",
         "description":"Great product! I finally invest in a eye liner that works -_- i was in denial to use a product that i thought wouldn't work for such a high cost, but finally it's well worth it :)\n\nstays all day long! wore this throughout the whole day in the heat and no creasing or running or melting whatsoever!! :D however it only works with a primer base, it will melt and do the same as any other cheap liner on the lid if you don't use a primer -_- i tested it..."
      },
      "DaniJ8991":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Dec 2016",
         "title":"Love love love",
         "description":"I have used this product for over 2 years and every day I love it more. Some people say they've experienced cracking but I never have. I think the key is to moisturize really well before applying any makeup and to store the liner in a reasonable temperature. Applies beautifully over eyeshadow. I'll never use another liner"
      },
      "hailey813":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"10 Dec 2015",
         "title":"AMAZING",
         "description":"this is by far the best waterproof liquid eyeliner! I've tried the kat Von D tattoo, and even that smudged on my oily eyelids. This is amazing and does not budge. Easy to apply and stays kn forever. Recommend this to everyone, have repurchased this 4 times!"
      },
      "CourtneyyC":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Jan 2017",
         "title":"This liquid eyeliner is the best liquid eyeliner. I have tried countless liquid eyeliners, including both high-end and foreign brands, and I always return to Stila's. It's super long-lasting, lasts through heavy rain and crying, and is a fantastic deep black with only one pass. The foam brush isn't my favorite, but it's easy to use and the formula makes up for it.",
         "description":""
      },
      "nesmailka":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"20 Jun 2014",
         "title":"Great application, with OK hold",
         "description":"I have been using this liner for a couple of months now, and as a cat-eye enthusiast this is by far the best product I've tried. The applicator is pretty no nonsense, if I do mess up it's due to having an unsteady hand not because the applicator is difficult to control. The color is very strong, which is perfect for some added drama. When first applied it is possible to smudge it which is ok because when you make a mistake it's easily fixable. Once dried the product becomes a little flakey, so if you do end up crying or what have you it won't smear your tears will be covered in flakes though. This stands up well too heat and cold (where I live the temps range from -40f to 90f), and as long as you don't have very moist eyes there's no reason this producer wouldn't last you all day."
      },
      "Jayidel":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Jul 2016",
         "title":"great for hooded eyelids",
         "description":"I've always hated the marker, pen look. Always used the urban decay 24hr pervision and since the ran out in the location I was currently in I decided to try something else. It scared me at first because I know it skips when you don't apply correctly. But it actually doesn't..it's great for my hooded eyelids and I for sure think this formula is better than urban decay.. When I forget I'm wearing makeup sometimes I rub my eye and I'm like \"oh fudge\" but my eyeliner, my wing is still flying.."
      },
      "MorgannLamb":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"11 May 2012",
         "title":"Nice color",
         "description":"I bought the blue liner. When i tried it on in the store on my hand it went on smooth but when i got home i tried it on my eyes it was acting as if it dried up. returned it after that."
      },
      "badp":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"12 Jul 2013",
         "title":"Very good staying power",
         "description":"I used BB gel eye liner but it just did not last all day for me. I have hooded eyelids and they are oily. I use UD eyelid primer and the BB still made me look like terrible by the end of the day. this is significantly better. Easy to apply after using gel eyeliner and lasts almost all day even in the humid summer we are having. four stars because it has smeared on a few occasions."
      },
      "ScubaNiki":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"6 Feb 2016",
         "title":"Excellent For Beginners!",
         "description":"I got this pen to try and work on perfecting my new fetish for winged eyes and this fits the bill and more!\n\nWhen I'm not using this almost mistake-proof pen to practice my wings I use it to put my eyeliner on however I want it and I barely have to touch it. It glides on and gives me whatever width line I'd like. I can do thick just as easily as thin - no mistakes.\n\nIt also stays and stays. I can't recommend this product enough!"
      },
      "AmbieInABox":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Nov 2016",
         "title":"AMAZING.",
         "description":"I've bought a lot of makeup products. Some of them I've hated and others I've loved. But my feelings towards them have never been strong enough on either side to warrant a review. Until now. \nThis eyeliner... Ugh, it's just so AMAZING. The best thing about it for me is the super fine tip. I have really hooded eyes so it's hard for me to do my liner thick enough to be seen but thin enough so it doesn't take over what little eyelid space I have- But this little treasure did just that. Besides that- it's super pigmented and pretty much the perfect black. I didn't have any troubles at all with it drying out before I could finish both eyes (i've noticed that with some others and it makes me so angry!). It really does stay all day- I put it on in the morning as soon as the mailman dropped it off, and by the end of the night it looked as perfect as it did when I first applied it. I'm trying to think of a downside to this liner so it doesn't look like I'm robot reviewer to push sales (I promise I'm not), but I honestly can't think of a single one."
      },
      "bruingirl12":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Mar 2015",
         "title":"I'll Never Use Another Liquid Eyeliner!",
         "description":"I use this every single day. It lasts ALL day (even through workouts) and it is incredibly easy to use. I can create a very thin line which is perfect for my professional work makeup as well as do a bold cateye for nighttime. The color is saturated (I use black) and dries fairly quickly. I used to use the Eyeko liquid liner but switched to this because:\na) They stopped selling the Eyeko liner at Sephora and\nb) That eyeliner used to dry up pretty quickly (1-2 months)\nI find that one Stila eyeliner lasts me for 3-4 months and that is with DAILY use. Perfection. I'll never switch to anything else!"
      },
      "DaniTrava":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Jan 2015",
         "title":"Amazing",
         "description":"This product is the best liquid eyeliner I've ever tried and I've been through many of them. Extremely easy to apply."
      },
      "sugarfoot89":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"11 Dec 2016",
         "title":"disappointing",
         "description":"This liner applies beautifully but smudges after an hour and gets EVERYWHERE. The worst part is the smudges are so stubborn they can't be removed without makeup remover. I worse this to a party and it was a disaster."
      },
      "prettygirl72":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"22 May 2014",
         "title":"BLACK is PERFECT. Other colors dry out!",
         "description":"I've used this in black for the last few years for winged liner and it's always been perfect in the Florida heat and humidity. Pool, beach, no sweat! I've always lusted after the other colors, and tried moss and midnight. GORGEOUS, but unfortunately after only a few days these shades dried up and became nearly unusable. Will still continue to use it in black as I've never as this issue and the liner lasts at least four months with daily use, but will not try the other colors again. Sad face."
      },
      "Hannahbeatty":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"21 Apr 2014",
         "title":"FAVOURITE EYELINER EVER!",
         "description":"this eyeliner is AMAZING! it lasts all day and doesn't smudge. The colour payoff is really good to! GO BUY IT NOW!"
      },
      "tmoco23":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Aug 2014",
         "title":"Magnifique!!",
         "description":"It is the best liquid eyeliner I have ever bought. Hands down. Great price, excellent wear, and is just what you need for thin to medium thickness in your liner. It is perfect for designs as well bc it is water proof. Do not leave this at the store!"
      },
      "morehope":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"11 Apr 2014",
         "title":"Love this",
         "description":"This is the first waterproof eyeliner that stays put. I have sensitive eyes and this does not burn. No raccoon eyes.\nThe thin brush draws a good, fine line. Love these"
      },
      "msstphenson":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"27 Jul 2013",
         "title":"Wasn't for me!",
         "description":"I really wanted to like this after hearing such great things but it just wasn't for me. I found it very difficult to draw a straight line. I ended up exchanging it for the Bobbi Brown eyeliner gel and use it with the Bobbi Brown eyeliner brush and love it!"
      },
      "Hayete":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 Feb 2014",
         "title":"Only Liquid Liner For Me!",
         "description":"I love liquid liners for lining my top lids with a cat eye. I have this Stila in multiple colors and love every one of them! I even took an unplanned dunk in a river after a canoe overturned, and while I looked like a hot mess when I got to dry land, my eyeliner was impeccable. No smudges or anything. Officially hooked."
      },
      "yrittneb":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"19 Jul 2016",
         "title":"okay",
         "description":"I've already purchased this two times and the only problem is that over time the applicator gets really weak and it's harder to apply eyeliner."
      },
      "PaulaTX":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"25 Jan 2013",
         "title":"Darkest Brown",
         "description":"Stila's StayAllDay Waterproof Liquid Eye Liner is my all time favorite eyeliner! And their dark brown color is so dark chocolately! It really shows up, but it is not the glaringly stark BLACK that looks obviously like eye liner on me. The dark brown does not draw attention to itself; rather, it sets off my eyes. When I was young , my hair was brunette and the black eyeliner looked just fine.But now that my hair has gone white, the black eyeliner looks fake. But the Dark Brown eyeliner seems like it was made for me! The shape of the pen brush makes application easy. Easy to put on, lasts all day, easy to take off, and it is a good color match for me now!"
      },
      "CarleyNM":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"10 Jul 2013",
         "title":"THE BEST EYELINER I HAVE EVER HAD!!",
         "description":"This eyeliner beat Urban decays liquid eyeliner and Kat von d tattoo marker liner by a landslide. It stays on the best and it is easy to apply . tho at the end of the day it does fade alittle but i have not found an eyeliner yet that doesnt. I LOVE U STILA LIQUID LINER!!"
      },
      "kristy72":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Dec 2011",
         "title":"Best liquid liner I've ever used!",
         "description":"I have tried quite a few liquid liners and this is by far the best. It is precise, easy to use (as far as liquid liner goes), and very long-lasting but not too difficult to wash off. My only complaint is that it can dry out a little bit too early if I'm having a difficult day and taking longer than usual to apply it. Overall, this product is DEFINITELY worth the price!"
      },
      "sarahmg":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"7 Mar 2014",
         "title":"Easy and Long-Lasting",
         "description":"Fantastic product. Ridiculously easy to make a cat-eye, but if that's not your thing, still worth it to make either a thin or thick line. Goes on MATTE which I love (a shiny liquid liner look isn't my favourite for day), can be dressed up or down, and really will last ALL DAY, even through tears or water. I use mine daily for a cat-eye, and the pen will last about 2 months before getting dry. If I could only own two makeup products it would be this and mascara. I recommend it to everyone who asks what I use. The dark brown is a must for lighter complexions, too (especially redheads!) - great for a less harsh but still defined look."
      },
      "kassandraperez":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"15 Dec 2014",
         "title":"Okay but not worth it.... at all",
         "description":"I'd consider myself experienced with eyeliner and this pen is such a hassle. It is IMPOSSIBLE to get a thin line with this. I never got a nice wing using it and I could never make it look semi decent without adding some kind of wing because the line was always too thick. I'm going back to the Kat Von D or gel eyeliner. Do not waste your money on this unless you are like the queen of eyeliner.."
      },
      "ValerieJB":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"3 Aug 2016",
         "title":"I really wanted to like Kat Von D's liquid eye liner but I keep coming back to Stila again and again.  It goes on very easily and dries almost immediately.  I am relatively new at liquid eyeliner and this is basically fool proof.  I don't feel like I have to press down in order to get the look I want.",
         "description":""
      },
      "makeupmonster46":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"14 Dec 2014",
         "title":"Favorite Liquid Eyeliner",
         "description":"I've been using this for years. This liner is so easy to use and I recommend it to everyone I know that has yet to find a great liquid liner. Docked one star because I do think it is pricey."
      },
      "hades13":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Nov 2010",
         "title":"best liner... ever",
         "description":"I have uber oily lids and I've tried soo many liners. liquid, pencil, powder and none can compare. first liner that stayed w/o having to use a primer. no flakes, smudges, racoon eyes or irritation. yet washes off with soap and warm water."
      },
      "darleneg":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"21 Jan 2013",
         "title":"Easy to apply and stays all day",
         "description":"While I am a fan of Laura Mercier's Caviar Sticks, I have always liked liquid eye liners for their ability to provide a precise line. I have \"older eyes\" (translate: crepe-like, with the outside edges turning slightly down), so I like to add a little outer edge up sweep with my eyeliner to provide the illusion of non-droopy eyelids. Stila's Liquid Eye Liner enables me to add a precision line at the base of my lashes and add a little up sweep with ease. I shake the tube before removing the cap and then apply it. I shake the tube again before applying it on the other eye. I will continue to purchase this product because it works for me."
      },
      "leia04":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"27 Dec 2015",
         "title":"Awesome",
         "description":"First thing i had ever bought at Sephora and i love it."
      },
      "aileenjunglee":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"3 stars",
         "date":"29 Nov 2017",
         "title":"<img src=\"https://www.sephora.com/productimages/sku/s1221084+sw.jpg\" alt=\"\" class=\"css-1ctithg \" role=\"presentation\" data-comp=\"Image Box\">Color: Intense Black",
         "description":"As much as Id like to agree with all of the 5 star reviews, I cant simply because ive given this product a couple tries (got it in value sets, alone, and as 100point minis) but it always dries out. Dont get me wrong! the first couple times you use it, its amazing!! \nBUT Ive noticed a couple things: \nI have oily eyelids sometimes and when my eyelids are oily, the eyeliner tends to come off. Another thing is, the felt tip gets ruined easily. If you wear a lot of eyeshadow, the eyeshadow gets on the tip and dries it out even more quickly.  \n\nI once also opened one of the stila liners at the same time as kvd liner and used both every day (one for each eye) just for fun and the stila became unusable in a shorter amount of time. Stila gives .16 fl oz for $22 where as kvd gives .19 fl oz for $20 think KVD is more worth."
      },
      "bibii":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Jan 2012",
         "title":"Loving this Eye Liner",
         "description":"I love the sleek and soft glide feeling when appying this eye liner, It really define my eyes and everyone noticed. And the fact that it stays smudge free for the whole day, This is the best !"
      },
      "kadieh":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"3 Oct 2012",
         "title":"I am not a great eye liner user. I have poor eyesight and shaky hand but Stila's Stay All Day Waterproof Liquid Eye Liner is easy to use. I prefer pencil but for a liner that won't smudge and stays for hours this is the way to go. The tip can bleed color a bit if held down too hard.",
         "description":""
      },
      "Kaylakoo225":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Jun 2016",
         "title":"Love it!",
         "description":"Love this product sooo much!! Will literally stay on all day at the water park with out smudging !"
      },
      "oskar27":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"23 Dec 2012",
         "title":"Great Eyeliner",
         "description":"I seem to have very oily eyelids and most pencils and other liquid liners come off during the day. This is the first and only eyeliner that stays on all day and by all day I mean 12 to 18 hours depending on my schedule. It doesn't flake peel or smudge. However, I don't think it is truly waterproof because I have been caught in the rain and it did come off some."
      },
      "Jaynalynn":{ 
         "extra_info":"<b>Skin Tone</b> Medium",
         "stars":"5 stars",
         "date":"23 Feb 2015",
         "title":"Stays All Day",
         "description":"This is a must have liquid liner for people with oily and/or hooded lids. I received this product as a sample in two separate occasions, one in black and one in brown.\nThis eye liner is quick drying, preventing smudges and long wearing. I can put it on in the morning, work a full 8 hour day, go to the gym and have dinner out, and still have to use makeup remover at night to take it off. The colour pay off is excellent with the black liner that one application is suffice and does not require building to achieve the optimum black.\nWill repurchase once I have finished both of my samples as this is the first liquid eyeliner that has remained on my eyes the entire day."
      },
      "uwsanne":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"8 Feb 2017",
         "title":"Wish it lasted longer",
         "description":"I love this product and i use moss green but it dries out with hin 3 weeks which is ridiculous. Any suggestioins?"
      },
      "villagemomma":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"26 Aug 2013",
         "title":"waterproof",
         "description":"I got Alloy because I wanted a sublte definition for my eyes for work. I love this product and will get more colors. The pen is easy to use and the liner stays put. Thank you Stila."
      },
      "RissRys":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"1 Feb 2015",
         "title":"The Best Waterproof Sweatproof Eyeliner",
         "description":"This product passed the test for my bridal makeup. The test? An hour and a half of a ridiculous workout session leaving me so sweaty that it looked liked I jumped in a pool, and this was after a 9 hour workday. And this eyeliner was still there when I got home from my workout class."
      },
      "JulieeeLee":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"20 Mar 2016",
         "title":"did Stila recently change this product?",
         "description":"I have been using this eyeliner for the past year or two, and it has been my favorite go-to liner. However, this past month, I ordered a new one from Sephora, and I think Stila might've made some changes to the product. The applicator tip feels a bit more stiff, with a slightly less precise tip, and it seems to be drying out rather faster than they have in the past. Has anyone else experienced this? I'm contemplating ordering a new one because it's drying out already, but I can't decide if I should just move on and find a new liner if these changes are permanent."
      },
      "lambeausmom":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"23 Nov 2012",
         "title":"Better than most",
         "description":"I have been looking for a waterproof liner to use on the inside of my lash line. I've tried every waterproof pencil, but they don't last very long. I have been using the Makeup for Ever liquid, and really like it. It's about empty and I thought I'd try something else. The Stila lasts a long time on the inner lid, but not all day. It will be my backup liner, but I'll reorder the other for full time."
      },
      "amymackinlay":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"29 Dec 2012",
         "title":"Long lasting &amp; waterproof",
         "description":"This product is great! Its lasts alll day and doesn't even get smudged! i wear this to the beach and i go swiming and still have perfect eyeliner. The only con is that is so waterproof that if i make a mistake applying it then i have to put makeup remover on a q-tip. but this is a great product i totally recommend it to anyone"
      },
      "ShadesStep":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Feb 2017",
         "title":"My go-to liquid liner. The tip doesn't dry out and it gives you great precision with wings. It doesn't smudge, has amazing pigment, lasts all day without signs of wearing off, no feathering, no running... I could go on. Prefer this over Kat Von D's tattoo liner any day.",
         "description":""
      },
      "nicolekara":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Jan 2012",
         "title":"A necessity!",
         "description":"This is by far the best liquid eyeliner that I've ever used. It lasts all day & looks just as fresh as when you first applied it."
      },
      "ShannonMealea":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"4 Dec 2015",
         "title":"favorite eyeliner",
         "description":"This is by far my most favorite eyeliner and I've tried all the highest rated ones. Stila's dries matte, super pigmented and is very easy to work with. I found with KvD tattoo liner (used to be my fave) that whenever I went over my line, it would rip off the ink like a bandaid. I don't have that issue with my Stila one. I can fix and adjust over the line and it'll still be perfect. I'm fed stocking up on some other colors soon!\n\nI do find that the tip of my eyeliner does fray a bit after prolonged use but I just take sharp eyebrow scissors and snip the teeniest bit off and continue on. It's a small foam like piece... So I'm not expecting it to be stiff and perfect forever.\n\nAll in all, it's amazing eyeliner. If you love perfect wings, try this baby. It def went up in price compared to when I first purchased it but it's an awesome product and I'm a loyal fan no matter what."
      },
      "BeastlyBeauty":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"30 Nov 2014",
         "title":"Bold and Perfect",
         "description":"I give this 5 stars because this is the first eyeliner I've ever used that's given me everything I wanted.\n\nPros:\nvery strong colour\nlong lasting\nwaterproof\ndoesn't fade\nprecise\n\nCons:\nafter about 16-17 hours, it will begin to flake, and that will make your eyes burn a little bit."
      },
      "AllieAction":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"9 Aug 2016",
         "title":"what happened?",
         "description":"I used to love this eyeliner. It didn't dry out as quickly as Kat Von D and made a great wing. I restocked a month ago and it just isn't the same. Since the packaging change they must have changed the formula as well, because it dries out and makes a terrible wing now. Such a shame. Time for something new I guess."
      },
      "boomermama":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"8 Dec 2011",
         "title":"Bingo!!",
         "description":"As one with small, often teary eyes, I have found my new liner! Easy on, stays on, comfortable to wear. Long live this liner!"
      },
      "KakiG":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"8 Mar 2015",
         "title":"Great Liner",
         "description":"This liner is very easy to use, and it has great color."
      },
      "titagirl":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"26 Jan 2011",
         "title":"BEST Liquid Liner Ever for Contact Wearers",
         "description":"I have oily skin especially under my eyes and have tried every liner out there especially ones that claim to be waterproof. I've tried pencils, gels, cakes & liquids. The closest I came to finding perfection was with the Dior waterproof lliner as there were no smudges under my eyes by the end of the day. The only problem though was when my eyes would tear, the liner would bead into very small particles and eventually get into my eyes and cause further irriation due to my lens. I happened to stumble upon the Stila liner - it is truly long wearing, waterproof, easy to apply, easy to remove with regular makeup remover, smudge proof and most of all does not break apart should your eyes tear. It is THE MOST perfect eye liner if you have oily skin or wear contact lens. And the price is very affordable!"
      },
      "ToriDoes":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"19 Aug 2014",
         "title":"LOVED... then didn't.",
         "description":"The first one I purchased worked like a dream, didn't come off at all during the day, product lasted for months. But then my second and third seemed to not stay on as long and also the tip seems to fall apart much faster. Really sad, because I loved this liner. It WAS my holy grail. :("
      },
      "waterknockers":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 May 2014",
         "title":"Love it",
         "description":"This liner is easy to use. It's very precise and stays on all day. No flaking and no sticking to the top of my eyelid like other liners do. The color is very vibrant"
      },
      "Mermaidstwin":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"14 Jul 2016",
         "title":"Bad Batch, Maybe?!",
         "description":"I purchased this product along with other products from the Sephora Favorites '15. I quickly fell in love with it. It lasted me about 3 or 4 months. I then purchased another one. That one dried out because for some reason the top kept coming off. I'd tighten it and it would still come undone. I yet again purchased another one not even 3 weeks after. That one lasted me a week and already it's not working. I'm very disappointed! I don't know if I purchased from a bad batch but I gave up already. Please fix that!"
      },
      "PeachLips":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"16 May 2013",
         "title":"Good but not Great",
         "description":"I have a problem with my eye liner smearing and making it look like i haven't slept for days but this eye liner doesn't smudge at all, unless you fall asleep with on. It is easy to apply but it takes a while to get the black black. You have to apply it one multiple times or than it will be gray and messy."
      },
      "GabrielaB":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Sep 2016",
         "title":"Ok this eyeliner deadass changed my life. It stays on through hurricanes &amp; is so precise and easy to work with. Intensely black and perfect in literally every way.",
         "description":""
      },
      "Kcp5015":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 May 2015",
         "title":"Amazing Staying Power",
         "description":"When I was in labor, my sister kept asking what brand of eyeliner I used. Not necessarily what I was focused on at the time, but really speaks to the quality and staying power of this liner!!!! She kept saying \"wow I can't believe it's still there\" lol"
      },
      "jemly":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"28 Mar 2015",
         "title":"exactly what i've been looking for",
         "description":"what can i say, this is the best liquid liner i've ever used. really. the black is the blackest of black. stays all day, just as it claims. and, what i think it's most essential for a liquid liner: it is EASY to use. i'm not at the mercy of this product--i have control over it. bold and graphic or tightlined and natural, this liner can do it all. i highly recommend, and will keep this as my liquid liner of choice. THE SEARCH IS OVER !!!"
      },
      "kennowl":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Apr 2013",
         "title":"This eyeliner is beyond amazing. My eyes are very sensitive and will start tearing up at any little thing (wind, cold, sun in my eyes, laughing, coughing, sneezing, yawning, they’re leaky faucets!), which has been extremely aggravating because I love having winged eyeliner. Every product I’ve used hasn’t been able to handle all the tears; after an hour either my wings have completely disappeared or I look like a panda. Stila’s eyeliner is the only liquid eyeliner that has been able to hold up against my watery eyes. Whenever I get teary eyed this liner doesn’t budge, it even stands up against five minute fits of my eyes watering out of control. The felt tip also makes this liner ridiculously easy to apply; after a few practice runs I can now do perfect wings in under a minute!",
         "description":""
      },
      "Yvonnejy":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"7 Apr 2014",
         "title":"long wear",
         "description":"My eye is really oily. I try so many eye liner pencil, gel or liquid. this is the least smudge one at the end of the day."
      },
      "Shorty57":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"16 Feb 2014",
         "title":"The Best Eye Liner Ever",
         "description":"Since I've been using Stila Stay All Day Waterproof Eye Liner, I don't have to worry about touching up my make all day! I love the way it goes on and it's not hard to remove! Finally, an eye liner that does what it claims!!!"
      },
      "tjpline":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Apr 2014",
         "title":"My new GO TO liner!",
         "description":"I have zero complaints. It dries fast. I put it on, fan the line with my hand for about 3-5 seconds and can blink with no transfer. Once it dries, it is there ALL DAY and it will still be there looking perfect the next morning if you haven't removed it. It is faster than a gel and leaves a beautiful, dark line. I will never buy another brand. You definitely get what you pay for. This stuff is perfection!"
      },
      "lenawest":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"22 Jan 2014",
         "title":"Cat's Meow",
         "description":"I LOVE this liner. I'm sure I write a review every time I purchase it, but it's worth it. It's prrrrrfect for creating the most precise cat eye and it stays on all day and all night. It's a must buy."
      },
      "VS15":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"3 Apr 2017",
         "title":"Two thumbs up from Miss Picky",
         "description":"I decided to buy this on a whim after being dissatisfied with so many other eyeliners on the market. I have the tendency of rubbing my eyes, using other eyeliners from all different price ranges would always smear all around my eyes giving me the \"raccoon eye\"affect or wear off early in the day. I forgot to wash my face after a night out wearing this eyeliner and woke up with it still intact! Yet this eyeliner is easy enough to remove with a makeup wipe. I'm beyond over the moon that the search for the perfect eyeliner for me is over!!"
      },
      "PBF01":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"9 Dec 2014",
         "title":"Love this Liner",
         "description":"I love this liner. I now have it in Black, Dark Brown, Midnight, and Moss. The tip is perfect. It is easy to apply. My eyes look so amazing with this. Because of the nature of the tip, it is possible to make subtle differences in how your liner is applied, very easily. For example, I've made a lovely cat-eye sweep one day, and the next made a high-in-the-centre rounded style look, kind of like a cute goat. Haha. No really, I swear by this liner. I am gradually acquiring it in all the colors. I can't wait to try white. Oh yes - and I found that it lasts all day which is 12 hours for me. Note that I do spray my face with Urban Decay's ALL NIGHTER to set it in place, so maybe that helps. ANOTHER note - this linter withstands major hot yoga classes. Try it!"
      }
   }
}