{ 
   "product_name":"All Nighter Long-Lasting Makeup Setting Spray",
   "product_type":"Setting Spray",
   "brand":"Urban Decay",
   "url":"https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504",
   "reviews":{ 
      "2094":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Mar 2017",
         "title":"AMAZING",
         "description":"Love this product .. I wear glasses and literally hate wearing eye makeup because by the middle of the day it looks like i have two black eyes lol !! but by using this miracle spray OMG big big difference my eye makeup stayed amazingly sharp never going without this spray"
      },
      "colorsmicaela":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 May 2016",
         "title":"DONT SLEEP ON THIS",
         "description":"THIS SURVIVED ALL OF MY EMOTIONAL THERAPY SESSIONS. LASTED THROUGH DADDY ISSUES, LOW SELF ESTEEM AND ALL OTHER CRYING FACTORS. BAWLED MY EYES OUT BUT MY FACE STILL BEAT, HIGHLIGHT STILL POPPIN, CONTOUR STILL SHARP AS A KNIFE. 10/10 WOULD RECOMMEND."
      },
      "nina5":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Jan 2011",
         "title":"amazing! when used correctly",
         "description":"I had heard mixed reviews on Urban Decay's all nighter Makeup Setting Spray, but after reading hundreds of reviews and watching youtube videos on the product I decided to give it a chance. My initial reaction to the product was positive, it immediately got rid of flakiness or powderiness which were two of my concerns in this winter weather. But after two days of wear, after 2 hours I noticed my makeup had run off, perhaps faster than if I hadn't used it at all!\nHowever, today I tried something new with the product. I sprayed it on my bare face before applying primer and my other makeup, then sprayed again after with some setting powder over it. Bam. 7 hours later and my face is perfect.\nGREAT PRODUCT! but use before and after application of makeup.…read more"
      },
      "ttnt":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"12 Aug 2010",
         "title":"Just a piece of advice...",
         "description":"I just tried this out for the first time this morning.. Makeup still looking good! None of the packaging says this, BUT put your mascara on AFTER you use the spray!"
      },
      "victoriaa11":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Feb 2017",
         "title":"I went to a party got drunk asf , vodka spilled on my face and my makeup was still on throughout the night LORD BLESS ME",
         "description":""
      },
      "kellyliz42":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Mar 2012",
         "title":"amazing!",
         "description":"I have been using this for about a year now and i am obsessed. I just recently learned the best way to apply this stuff, and since then, my makeup does not budge at all, even by the end of the night, my makeup still looks freshly applied. The best way that i have found to apply it is to do the following:\n-put on moisturizer\n-put on primer\n-put on concealer and foundation\n-spray all nighter spray all over face\n-let it dry\n-apply face powder\n\nby applying the spray and then applying powder, it seals all the makeup in!\n\nI will forever purchase this product :)…read more"
      },
      "SamiSue21":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Apr 2017",
         "title":"P-U what stinks!?",
         "description":"I am sooooo disappointed. This spray used to be my ride or die. It set my makeup perfectly and didn't budge.. HOWEVER it appears UD changed the formula because it stinks!!! It smells like pickles..and garbage? Idk, hard to describe- almost like it has gone bad. While it may still work and set the makeup, I'd rather my face not smell like something died on it. I wonder if maybe they took out an added fragrance..? Idk, but I can't spray it without gagging so I'm on to another setting spray! Just my .02!…read more"
      },
      "SavKhry":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Mar 2016",
         "title":"Cried therough half of Season 11 episode 21 of Grey's anatomy and makeup is still in tact. Derek is dead but my makeup is eyeliner wings are alive and prospering.",
         "description":""
      },
      "rachbanes":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Oct 2015",
         "title":"OH MY GOD",
         "description":"Ok so I never write reviews but this product has changed my life so I had to. I have EXTREMELY oily skin like nothing has every worked on my face to keep my makeup from slipping until I tried this product. I don't even need a setting powder with it! Seriously I have extremely oily skin and I never thought I'd ever enjoy having makeup on my face, so thank you urban decay for seriously making me SO happy…read more"
      },
      "alicelin":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"24 Mar 2017",
         "title":"New formula has a horrible smell",
         "description":"I had been using this spray for years. I recently bought a new one with the new dark bottle packaging and the smell is terrible!! The formula must have changed. It smells like expired or rotten product and when sprayed on you just smell it all day. I went back and the associate opened another new one to test and it has the same bad smell. I hope they realise this and change the formula back to what it was before.…read more"
      },
      "MrsStorey":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"7 Apr 2016",
         "title":"Refreshing, Doesn't Last",
         "description":"I got this thinking it would keep my makeup from melting off my face a few hours into my day. Unfortunately, I'm disappointed. I work in an office, with no strenuous activity throughout my 8-5 day. I use this religiously every single morning, and my 10-11 am my face is shiny and slick, and my makeup has worn off in places. It's refreshing when I put it on, but with a name like 'All-Nighter' I was expecting better results. If anyone has any recommendations or if I'm applying it wrong, please let me know!…read more"
      },
      "Adreeanna":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Mar 2017",
         "title":"Amazing",
         "description":"I wore this over my make up on New Years, I drank too much so I threw up multiple times, splashed water on my face, and went to sleep, woke up the next morning with my foundation still flawless. hands down the best setting spray I've used"
      },
      "sweethilarity92":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Mar 2012",
         "title":"Great investment! Long lasting!",
         "description":"I honestly was a bit shaky about the price at first. Although I've heard great reviews of the product. I decided to get the travel size one for $10-$12. I instantly fell in love with the product. I literally was so scared when the travel size was running low. Its that of a great product. I needed it! I recently just started working in a restaurant. I'm constantly running around and literally have no time to go in the restroom to check up on my make up. I also couldn't afford to have my make up falling apart. When I got this product. It did wonders for me. I saved so much time and money. I don't ever have to retouch my make up meaning I use less of my products.\n\nHow I use the all nighter spray with my make up routine:\n-I moisturize and use the UD facial primer in brightening\n-My Makeup Forever HD foundation\n-Laura Mercier concealer in 2\n-Mac loose mineral Powder\n* I spray the all nighter two times 8 inches away (let it set and dry)\n-Then I prime my lids with UD original primer\n- My Naked Platte 1\n- Prime my lashes with Too Face lash primer\n- Water proof Mascara\n-Brows\n-Contour\n-Blush\n* I spray the all nighter spray two times 8 inches away from my face. (set & dry) I'm good to go for the rest of the day of fresh make up all day ;)…read more"
      },
      "dreamyone":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"22 May 2010",
         "title":"MUCH BETTER THAN I EXPECTED - PASSES A BIG TEST",
         "description":"UD's All Nighter Long-Lasting Makeup Setting Spray is more amazing than I originally thought. This is graduation week for one of our sons and it was put to the test. There's been lots of events, parties, and ceremonies all week. Many of the social events have been outdoors in the heat and humidity and then, rain. I'm so impressed by UD's All Nighter Long-Lasting Makeup Setting Spray. During one of the outdoor parties, there was an unexpected torrential downpour. This spray performed better than expected. The rain was so heavy that our hair and clothes were plastered against our bodies. We were dripping wet with water running down our legs. Many of the people stayed to see if the sudden storm would quckly end. I was looking at some of the other moms who had smeared makeup all over their faces (particularly eye makeup on their cheeks). Myy husband surprised me by mentioning how great I looked. I assumed I looked as messy as everyone else. He said I looked like the women in those ocean photo shoots where the models' faces looks perfect, even though they've supposedly just come out of the water after swimming. I actually didn't get the full impact of his comment until an hour later when I saw myself in the mirror. Many of us ended up dancing in the rain which was incredibly romantic. The thing that surprised me at the time was the realization that no makeup product rubbed off on his white shirt when I rested my head against him so I incorrectly assumed all my eye makeup and blush had washed away from the rain. When I finally did see myself in the mirror, all my makeup (eye makeup, blush, tinted moisturizer) was pretty much intact with no big mess. (Some of it was waterproof but not all was). If this isn't a testimonial for UD's All Nighter Long-Lasting Makeup Setting Spray, I don't know what is...…read more"
      },
      "foundeadincali":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 May 2016",
         "title":"YALL I CRIED FOR LIKE 3 HOURS AND MAKE UP WAS STILL POPPIN'",
         "description":""
      },
      "cnd1993":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Mar 2017",
         "title":"I've re-purchased this several times- and will continue to do so because its an amazing product- but it honestly smells awful since they switched to the new packaging. I'm not sensitive to smells, but I won't breathe through my nose for a minute after I put it on. There was never any smell with the old packaging, and I really hope Urban Decay figures that out.\r\n\r\nThat being said, when I use this, I can go out all night, sweat, sleep face down on the pillow, and still wake up with my eyeshadow/eyeliner/face makeup looking like I just did it. I haven't even considered using a different setting spray since the first time I tried it.<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "paddylos":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"7 Jun 2010",
         "title":"Good, but the ORIGINAL is better",
         "description":"I don't know if you all checked out the fine print on the packaging, but this product is formulated by a company called Skindinavia. Urban Decay's version is a spin-off of Skindinavia's original makeup finish. I've used Skindinavia's Cool Flash Makeup Finish for a while now and I adore it, and because I'm brand-loyal, I just think that Skindinavia's version is better. They offer six different formulas designed for your needs instead of just this one formula that's probably a hit-or-miss for most. Both companies offer their versions for the same price (4 oz for $29), but I would definitely check out Skindinavia's website (Skindinavia.com) and take a look at their products before buying this one.…read more"
      },
      "jordanaustin19":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Jan 2016",
         "title":"You need to buy this now",
         "description":"So I did my makeup all nice for New Years Eve; winged liner, contour, highlight, the whole shabang. Wellllll...I went a little too hard that night and it did not end pretty. But what was pretty was my face the next morning when I woke up! Girl let me tell you, winged eyeliner was flawless, highlight was poppin, and my countour would have made Jaclyn Hill proud of me. This makeup setting spray made the next morning a little more bareable. Buy this stuff now.…read more"
      },
      "xxLiz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Sep 2013",
         "title":"Def an ALL NIGHTER!",
         "description":"I work at an animal clinic and I never, ever have time to touch up my makeup in-between seeing appointments and treating hospitalized patients, it can be a pretty stressful job. Everyday, I am running around like crazy and with this setting spray I don't have to worry about my makeup smudging, sliding, and falling off my face. (Plus, I have EXTREMELY oily skin!) With this product, I can go home, look in the mirror and say, \"Dang, I still look good!\". I cannot live without this product.…read more"
      },
      "champagnecheeks":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Jul 2016",
         "title":"my brows are here to stay",
         "description":"this settling spray is without a doubt one of the top dogs.  you get a great amount for the amount you're paying, it keeps your makeup pretty and from slipping, and all in all does a great job without weighing you down.  so many setting sprays practically drip off of your face, but this one sets into skin immediately and locks in makeup.  the product speaks for itself 11/10, get it now. *DISCLAIMER, will not make you matte, if anything it leans more to the dewy side, so for my beautiful oily boys & girls, I would not suggest this UD setting spray…read more"
      },
      "lindamaried":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"23 Feb 2013",
         "title":"Amazing product",
         "description":"My makeup ALWAYS faded by noon -- sometimes earlier. I was very skeptical that this would help but it really, really works. I spray this on before and after I apply my makeup and when I come home from work at 6 pm, the only thing that's faded is my lipstick. GREAT product."
      },
      "bebewater":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"9 Jun 2015",
         "title":"Makes my skin look 10 times oilier",
         "description":"I noticed my skin being oilier than a usual normal day without using it. and it gives a sticky shiny feeling to my skin when i apply it. as if it never sets and just sits on top of the skin leaving a sticky sensation.\n\nhalfway through the bottle so I can't return it but i will not be spending on any other setting spray :/"
      },
      "bobis":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"16 Feb 2016",
         "title":"works like a hot dam!!!",
         "description":"so I thought I would give this the ultimate test.did my full makeup,set with the setting spray then went for a 6 km run. ( I don't normally wear makeup running). makeup was flawless. no sweat runs nothing.love this stuff"
      },
      "pianogeek":{ 
         "extra_info":"<b>Skin Type</b> Dry",
         "stars":"4 stars",
         "date":"27 Mar 2017",
         "title":"That Smell Though",
         "description":"This product is made by Skindinavia, who have the absolute best setting sprays out there. This spray does exactly what it says it will: \"keeps makeup looking just-applied for up to 16 hours\". I once saw a YouTube experiment where a girl stuck a thermometer in the bottle of setting spray and the temperature actually went below room temp. That's exactly what it does for your face: lowers the surface temperature so your makeup stays intact and doesn't melt off.\r\n\r\nHOWEVER, this product has been reformulated and the new smell is absolutely awful. It smells kind of like fishy malt vinegar. Though I did find the smell to dissipate quite quickly, this is definitely a draw-back. If the product wasn't such a tried and true performer, I would definitely be torn about whether or not to repurchase.\r\n\r\nBottom line: The product does exactly what it promises, but the smell definitely gave me pause.…read more"
      },
      "miacelina":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"28 Apr 2017",
         "title":"what happened?",
         "description":"I used to love this stuff and while it still works well and sets my make up, I find this new scent unbearable! The original scent was just fresh and smelled light. The new formula honestly smells like lettuce. Disappointed."
      },
      "KariGabi":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Feb 2016",
         "title":"FLAWLESS",
         "description":"I did my makeup this morning and it lasted 8 hours of high school and 2 hours at the gym and my face is still flawlessly beat and my wing could cut a boy's heart."
      },
      "Amber1205":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"22 Dec 2017",
         "title":"Got intoxicated, cried, and slept with this on (all in one night) and MY MAKE UP DIDN'T GO ANYWHERE! 10/10!",
         "description":""
      },
      "LittleLady36":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"31 Oct 2016",
         "title":"Love It",
         "description":"I am an extremely oily person so I am not sure if anything will keep my makeup  the way I want it to but this does a decent job. Does it set my makeup? Yes. Does it stop my oilyness? No. But I am not sure if it claims to be mattifying and recommended for oily skin so I guess it does it's job."
      },
      "saddiemay11":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"17 Jul 2014",
         "title":"Greatest makeup purchase EVER",
         "description":"I was honestly a little skeptical about this product, but oh my gosh...I will never NOT use this again after applying my makeup! I tend to get oily after a while and this seriously helps with my makeup staying in place all day! Great buy for sure!!"
      },
      "copacetik":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"31 Oct 2014",
         "title":"Don't make up without it",
         "description":"I bought this because I got tired of turning my husband brown every time we kissed and his nose touched my face (it's ok to laugh). I spray this on after I put on my liquid foundation, and once again after my concealer, and my makeup stays on longer and most importantly, stays off my husband."
      },
      "BeautyTeen1":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"19 Jan 2015",
         "title":"So I am in middle school and I have gym. This works great throughout the entire day even when I have gym. I love this and recommend it.",
         "description":""
      },
      "miniowl":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Apr 2016",
         "title":"Hairspray to your face!",
         "description":"Amazing product. This spray keeps my makeup on ALL NIGHT. I've had some silly drunken nights where I fell asleep with my make up on and the next day everything would still be perfectly intact... not sure if that's something to brag about but my point is that it gets the job done!"
      },
      "Fungrl22":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"8 Aug 2013",
         "title":"Cant live without it!",
         "description":"I seriously love this stuff and cant deal with how my make up looks without it! I have tried the de-slick because I have oily skin and I have to say this one works way better in terms of keeping the oil away. If you havent tried this yet just do it! You have nothing to lose."
      },
      "cakefacebitch":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Sep 2016",
         "title":"lasts 24 hours",
         "description":"I was hooking up with a dude in the back of his car and no air was on in the middle of summer and I'm sweating like crazy doing it for 40 min and when we finished, I still looked perfect. my makeup didn't even run even though I was sweating like crazy. 10/10 would recommend if you have to hook up at 12, and meet your mom for dinner at 3"
      },
      "misspriss28":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"17 Apr 2011",
         "title":"Works great. I go to the gym a lot and hate going without make up since my face is not perfect. My make up could never stand up to my workouts before. But now with this it will last through my whole workout. It also will last through my 13hour work days. Great product.",
         "description":""
      },
      "CMBC":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"3 May 2017",
         "title":"Miss the old one",
         "description":"I loved the old version of this. I thought they only changed the packaging but apparently not, the product itself seems different, and the SMELL is just gross! luckily it does go away after some time, but when you first spray it, it is not pleasant at all. Hopefully nobody can smell it off of you. Hoping they bring the old one back!"
      },
      "makeupgeek":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 May 2010",
         "title":"my makeup savior!!",
         "description":"If only this product had come out sooner...I'm in love with this all-nighter spray! I got a sample of this yesterday from a sephora rep and tested it out today. The rep told me to spray 3 times but a lot comes out in one spray so you need to spray about 1-2 times after you've completed your makeup application. Before using this I was always irritated when 1) my makeup would crack on the side edges of my mouth and 2) when my face makeup would oxidize throughout the day. For those of you who don't know what I mean by 'oxidize' it means that my face makeup would change color. I'm fair to light beige and my foundation matches my skin in the morning but by the end of the day it alters to a darker beige color. In turn, there was a huge color contrast between my face and neck. However, thanks to the all-nighter spray my makeup color stayed as is and no more cracks on the edges of my mouth!!! I had M@C's fix+ spray as a back-up but now that I've found this, I'm returning it tomorrow and going to purchase this. Thanks Urban Decay!!…read more"
      },
      "carol76":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"22 Jul 2010",
         "title":"It does what it says!",
         "description":"It definately does what it says!\nDoes keep my make-up almost as is^^\n\nI took off a star because it tends to come out wide (excessively, more than I need).\n\nHaven't tried to redo my makeup AFTER I use this product ... but when i use powder over it, it did not become cakey(?)...I guess that's a good sign^^"
      },
      "JCermeno":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"30 Dec 2013",
         "title":"Awesome",
         "description":"This product does everything it says it does. It totally kept my make up in place and it looked just as fresh at the end of the day as it did when I first I applied it. It dries super quick, it was not irritating to my skin and my skin did not get oily. I was afraid it would turn oily since there is a specific spray for oily skin, and this is not meant for it, but I did not get oily. I am extremely happy with this product. It is now one of my favorite products of all time.…read more"
      },
      "EmilyHerx":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Jun 2014",
         "title":"New to setting sprays",
         "description":"This reminds me of when I first started using primers and can't live without them. This is how I feel about this setting spray. I can't go without it especially in the summer months. I did makeup for a bridal party and they called me the next day saying their makeup lasted ALL night. However, not all setting sprays are equal. UD is worth the money because it WORKS! You won't be disappointed! Go for it girls! :)…read more"
      },
      "EmilyJoy14":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 Mar 2016",
         "title":"Amazing",
         "description":"I heard of this spray while watching make up artists on Youtube rant and rave about it.  It feels so lightweight and refreshing.  This got me through a funeral service and then a night of heavy drinking afterwards.  I definitely recommend this product if you need your makeup to last all day and night."
      },
      "frelkins":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"4 stars",
         "date":"23 Sep 2012",
         "title":"Definitely helps makeup last",
         "description":"It will keep your blush from fading, no doubt, and your foundie will stay put a couple hours longer. Spray before your mascara or it will run - no matter how lightly you spray. And it really doesn't help keep you matte at all. You'll blot just as frequently. If you sweat, you'll feel the moisture build up under this product, which is a rather strange sensation.\n\nIn general it does most of what it promises, doesn't irritate skin, and doesn't break you out, which is all you could realistically hope for. Air brushing on real waterproof makeup is truly the only way to get 16-hour wear. But this does help with normal makeup.…read more"
      },
      "Sunshine227":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jan 2016",
         "title":"DOES NOT BOTHER MY SENSITIVE/ACNE PRONE SKIN!",
         "description":"I love this spray. It absorbs into your skin quickly to set your makeup and it last all day. I literally use it everyday. I have oily/acne prone skin and this does not break my face out at all :) I have my mother and sister using it as well."
      },
      "Kinjy":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Mar 2016",
         "title":"magical",
         "description":"My makeup lasted all night from 10:30 to 4:30 am. And my make up survived a night of bar hopping and crying. It was still perfect when I got back home."
      },
      "coffeeandcorgis":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Jun 2017",
         "title":"already ordered my backup!",
         "description":"I've been using several drugstore setting sprays that are decent. But I saw this on sale & tried it for a few days. I've already purchased my backup!! My makeup usually breaks down & settles into my pores by mid-day. When I use this spray, my makeup doesn't settle into my pores & looks fresh all day!"
      },
      "LK117":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Aug 2015",
         "title":"disappointed",
         "description":"Works really well.. As long as you stay at home in front of the air conditioner all day."
      },
      "fekeys":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 May 2017",
         "title":"I BATHE AND SWIM IN IT",
         "description":"THE BEST SETTING SPRAY HANDS DOWN! I have fooled myself that Drugstore setting sprays are the best simply because I didn't want to spend a lot on high end. Then I bought the travel size and I was so amazed. Sometimes I use it with the De-Slick and My makeup last all day, no oily T-Zone. This is the best thing From Urban Decay."
      },
      "letsmakeup2":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"23 Feb 2013",
         "title":"Totally in love",
         "description":"I finally bought the all nighter. I have dry skin and by the end of the day my makeup always seems to disappear and soak into my skin! This product does exactly what they advertised !! My makeup stays on all day and my skin has a health glow to it now! Def recommend"
      },
      "ildebo":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"13 Apr 2016",
         "title":"A staple!",
         "description":"Full disclaimer, I model and work on sets, on multiple occasion several makeup artists used this product and on those days after running around or being under the heat of lights - my makeup looked just as great as it did at the beginning of day so I bought and utilized during a few races (one of which will be airing on television shortly) AND my makeup (granted during races I go light/natural) has stayed in place. I have told everyone to buy this and thus far no one has been disappointed as it truly holds up thru water, sweat, mud and daily activities.…read more"
      },
      "meaganmichelle":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Mar 2013",
         "title":"Really works!",
         "description":"I don't normally have any issues with my makeup melting off but I do wear a lot of black and have some issues with my foundation rubbing onto my clothes, which is not a good look. I bought this last week because I saw the small size in the cash lineup and figured I'd give it a shot, if it didn't work then it was only $15. I have to say that it really does work. My makeup doesn't budge from when I apply it at 5:45am until I take it off at 11:30pm. I apply it as per the directions, I shake it first, close my eyes and do 2 spritzes in an 'X' shape and 2 in a 'T' shape. It is wet, but not sticky and it dries fast. The only time my makeup has moved at all while using this was when there was a small snowstorm a few days ago, but that has nothing to do with the product, that's just the joy of living in Canada. Anyways I will continue to use this product and buy more when I run out. Great product from one of my favourite makeup companies!…read more"
      },
      "aceemcd":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"1 Jan 2013",
         "title":"Perfect setting spray",
         "description":"Worth it. Keeps makeup looking freshly applied for hours. Not sure about 16 hours, haven't tried that yet, but definitely works for 10 hours. Comes in travel size too, which is great for those weekend trips. I suggest spraying in to the air slightly above and in front your head and then walking through the mist. Do this three times."
      },
      "LCBL26":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Nov 2012",
         "title":"love it!",
         "description":"The first time I used this was for my wedding day. My makeup lasted ALL night, through dancing, high humidity, an insanely torrential rainstorm, kisses, and cake being shoved into my face. Now I use 'all nighter' every day. If I'm going to spend the time and money that it takes to have a polished look every day, I want it to last as long as possible. This is the key to long-wearing, budge-proof, smudge-proof makeup!…read more"
      },
      "AlleyB163":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Aug 2016",
         "title":"Amazing!",
         "description":"This product is so great. There are a lot of days I work 12 hours and have to be in business professional. I can say that my makeup truly stays on the whole day, I may just have to do a few touch ups. Must have product!"
      },
      "angeli26":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"21 Mar 2011",
         "title":"It's ok...",
         "description":"I've read so much good review about this setting spray which is the reason I tried it but I was disappointed after trying it.\nMy PROs:\n-- It's lightweight. It doesn't feel sticky or tight after it has dried on my skin.\n-- It dries fast.\n-- It doesn't drip down my face even though I tend to spray a little extra more all over.\n-- I sprayed it on my lids (eyes closed and I sprayed it farther than the rest of my face) and it did not sting.\n-- I didn't notice any funky smell to it...no scent\n-- The spray applicator sprays pretty evenly to me.\n\nMy CONs:\n-- Does not do a good job on keeping your makeup in place, especially not \"16 hours\" as it claims....so it defeats the purpose of a \"setting\" spray. Half way through the day, my makeup has somewhat faded. (I've used another setting spray that actually kept my makeup on all day even in summer hot weather & I'll be going back to this old one....fyi, sephora doesn't sell this one).\n-- I bought and used it during winter time so if it doesn't hold up during winter time, I doubt it'll do a good job for the summery hot weather to come....but I'll see since I still have a lot left in the bottle by the time summer is here.…read more"
      },
      "flamingolegs":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"20 Sep 2018",
         "title":"Perfect Makeup!",
         "description":"This is the first setting spray that has actually worked to keep my makeup looking as fresh at the end of the day as it was at the beginning.  I mist it on just prior to adding my mascara and lipstick/gloss.  It has a pleasant cinnamon smell to it that fades in seconds."
      },
      "SuziQPassion":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"3 stars",
         "date":"2 May 2016",
         "title":"Doesn't stay put with glasses",
         "description":"The spray seems to work well on my non-oily sections but on my T-zone my glasses still slide around on my foundation as it slides off during the day."
      },
      "dirtybird":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jul 2011",
         "title":"Dance the night away!",
         "description":"I was a bridesmaid in my cousin's wedding...an outdoor wedding in the middle of June. I wanted to be close-up picture-perfect all day long without having to constantly touch-up. No easy task, even on a good day, thanks to my ultra oily skin...my make up is usually a muddy mess by lunch time. And it happened to be 90 degrees out the day of the wedding. I received a free sample of this stuff and decided to give it a try. It worked wonderfully! Our pictures were at 11 am, ceremony wasn't until 3:30 pm, with reception (and dancing) afterward. I didn't touch-up once! Lasted all day, and all night!\n\nThe product is very easy to apply...just spray it on! It is light-weight and non-greasy, didn't irritate my sensitive skin, and I didn't notice any fragrance. Also, it wasn't sticky and it didn't leave any marks or residue like with other finishing sprays I have tried in the past. I was impressed with it's performance and will be purchasing a large bottle for every-day use.\n\nThe picture provided was taken several hours after the ceremony, and after taking quite a few turns around the dance floor. As you can see (even from the horribly compressed pic), my make up is still in place.\n\nOther products I used, which may have enhanced performance:\nSmashbox Photo Finish Light Foundation Primer\nToo Faced Shadow Insurance Eye Shadow Primer\nToo Faced Amazing Face Oil Free Close-Up Coverage Foundation\nMake Up Forever HD Microfinish Powder…read more"
      },
      "kmkck":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"7 Dec 2016",
         "title":"pretty good",
         "description":"This finishing spray works and makes my make-up last. However you can't put any mascara on before spraying because it will transfer onto your face. That's the only down side of it."
      },
      "dalliance":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"5 Feb 2014",
         "title":"Holy grail!",
         "description":"Amazing amazing amazing! For anyone doubting this product, you just need to try it. My foundation lasts SO much longer when using this product than without! Keeps me looking flawless all day, and is great when going out at night - keeps my face in place even when you're dancing. What I love about this product is how it removes the \"powered\" look and makes your skin look flawless! A bottle lasts me about 6-7 months with daily use.…read more"
      },
      "pinkybella":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"2 Sep 2017",
         "title":"horrible smell",
         "description":"I used to love this product but the new formula has weird smell and It doesn't go away. I can't use this anymore. what did you do UD?"
      },
      "CarolynRenea":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"21 Jun 2017",
         "title":"Fort Lauderdale Approved",
         "description":"Spent the past few days in South Florida for a work convention and brought this along to try. My makeup stayed on through an all day convention, then dinner, and a walk on the beach. Back to the room, and my makeup was still amazing!"
      },
      "serinag123":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"23 Jun 2016",
         "title":"Love it!",
         "description":"This setting spray is amazing! Even the 1 oz. one lasts a long time, but the 4 oz. is worth your money! I get very oily skin on certain parts of my face, but it doesn't make it more oily! It helps a lot to keep my makeup on and it does not have a strong smell."
      },
      "Illuminaughty":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"8 Oct 2016",
         "title":"From skeptic to true believer",
         "description":"This was the first ever setting spray that I purchased! I bought this because I had a huge Vegas trip and am notorious for being sweaty! Usually when I go out with my girls, after a night full of dancing, I'm soaked and I get major raccoon eyes. So attractive, right?! Not. At first, I was skeptical. How can a spray really make your make-up last all day? Ladies, it does! And trust me, I put it to the test! I'd also like to add that I did have Urban Decay's All-Nighter foundation on so it might've been a magical combination of the two but I stayed flawless the whole trip! It was about 100 degrees out and we were at Encore Beach Club (day club) so I was definitely sweating my little behind off! I was so surprised when we came back to our hotel room hours later and everything was still in place! I didn't even need to do any touch up's before we left to go to dinner then the night club. We left around 11am and came back around 3am.. Everything was in place! A bit of under eye smearing from my eyeliner and my lip color wore off a bit, but still, it was truly a religious experience.\r\n\r\nAlso, for all the females that powder or bake your face - this is a must! It melts the powder into your face and give you a gorgeous finish.…read more"
      },
      "meagle":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"19 Nov 2012",
         "title":"I hate to leave this review, but....",
         "description":"I have to be honest. This product really didn't do anything for me. I have combination, sensitive skin and live in a pretty humid environment (Houston). I tried this in drier weather, on a \"dry skin day,\" and also in Houston/Galveston on days when my skin was drier than usual...as well as on days when my skin felt oilier than usual. So, I feel like I gave it a fair chance. I really, really wanted to like this product- I really wanted this product to work out for me. Even with being very cognizant of touching my face & eye makeup post -application of this product-- in every environment (humid or dry) environment, on dry/oily skin days alike- it just melted off me. I probably am better off continuing my use of water proof/sweat proof sephora eyeliner, which btw, IS AMAZING. I still like urban decay products, but this one just isn't for me.…read more"
      },
      "adrienne270":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Aug 2017",
         "title":"the best!",
         "description":"I tried makeup forever setting spray and I was pretty surprised that this UD one nailed it! NAILED IT. I live in California so we get hot melting days. With the makeup forever setting spray I was left with disgusting makeup-missing patches that were so embarrassing. But this urban decay one kept my makeup in place even after I was melting! Now that's pretty good! I love love love this stuff, it does its job and it's weightless!…read more"
      },
      "ZFlatCat":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"10 Jul 2013",
         "title":"This stuff is wonderful",
         "description":"I NEVER write reviews, but for this I have too. I was reading the other reviews and said \"yeah right\", but I bought the small size anyway. This stuff is the best thing I have ever bought. I did my makeup around 11 AM yesterday, was out in 96 degree weather all day then went out to dinner with my friend and my makeup still looked like I just put it on. I am buying more."
      },
      "Pinkster8":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"11 Mar 2013",
         "title":"All Nighter",
         "description":"I bought this product ages ago, and just recently started regularly using it again. I use moisturizer, BB cream, concealer and translucent finishing powder and sometimes my skin can look a little dry or even \"cakey.\" I use a few (3-4) mists of this on my face, and it provides a really nice moisturizing veil on my makeup to eliminate the cakey appearance and give my skin a hint of dewy appearance. It is very lightweight and dries within seconds - just make sure you hold it a little ways from the face while spraying. Also, make sure to keep your eyes shut while the mist settles on your skin - it will cause some mild eye stinging for a few seconds, but it isn't bad by any means. Once it's on, you don't even feel it - it doesn't leave any weird residue and has never been sticky. I love this product and I'm really glad I started using it again!…read more"
      },
      "AussieD":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"29 Mar 2014",
         "title":"So refreshing",
         "description":"After all the products, spackle, primers, colors, powder that I use to polish THE look, using this mist to set the makeup is a real treat! The mist is ultra fine and it is cooling, refreshing. A bit like walking into a flower shop on a summer's day. Apply BEFORE mascara. Makeup looks good from 7 a.m. until end of shift around 5-6 p.m."
      },
      "missbrenda":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"1 Jun 2010",
         "title":"This works",
         "description":"The humidity in Eastern TN is brutal! UD All Nighter Long Lasting Setting Spray really makes a difference in keeping the makeup on my face and not sliding off. 3 sprays are all you need and be sure to hold it away about 10\" I use this with Makeup Forever's Mat Velvet foundation, which, bar none is the best foundation out there! !"
      },
      "laschdanamarie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jan 2016",
         "title":"Does exactly what it says",
         "description":"I have used this to keep my makeup put on several occasions, from parties to interviews and even just for a normal day when I have to have my \"face\" on from morning till night. Can't believe I went this long in my makeup life without it"
      },
      "Morkielover":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"2 stars",
         "date":"22 Sep 2016",
         "title":"Drying",
         "description":"This product dried out my skin but to be fair I have maturing/dry skin.  It did help my foundation stay put so for oily complexions this probably would work great.  Just a caveat for all you mature women that tend to have drier skin this product will make you look crinkled like the desert by the end of the day."
      },
      "missbeckyy":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Feb 2016",
         "title":"really works",
         "description":"I finished my makeup Sunday morning, went to Disneyland, cried my eyes out after fighting for my boyfriend and went to work the next morning with the same makeup and got plenty of compliments on my makeup. This allowed my makeup to last over 24 hours and through work, fun, heat, and an emotional day. This product definitely will keep your makeup on all night for a typical (or not so typical) night…read more"
      },
      "sttc":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"21 Jul 2016",
         "title":"Excellent product",
         "description":"I had to attend a beach wedding in the Caribbean and I used it over my makeup.  It was early July and I was sweating heavily.  But my makeup stayed perfectly on my face for hours!"
      },
      "sweeneye":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Aug 2016",
         "title":"Just get it already",
         "description":"This setting spray feels cooling and you're makeup will not budge. I went to a festival in the middle of July and my makeup stayed in place throughout the gross heat that I endured."
      },
      "DoNotEatTheCake":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"23 Mar 2017",
         "title":"WHAT DID THEY DO TO YOU!!?",
         "description":"I have been a loyal UD all nighter spray user for about 6 years now. I LOVED the OG spray, back when it came in a white bottle with the purple cap. I mean the stuff was AMAZING -- My makeup survived me being pushed into a pool, and this was AFTER attending a rave. I came out of the water super angry, but with perfect makeup still. \r\n\r\nHowever, recently UD revamped the bottle, and apparently the formula too?! While the stuff still works, it has his HORRID smell -- like musty plastic (if that's even a thing). Like a smelly book made of plastic was sitting on a musty old shelf collecting dust and mold. My boyfriend cannot stop complaining about the gross smell whenever he gets near my face after just applying makeup. Oh how I miss the days when my makeup was party-proof AND non-smelly...…read more"
      },
      "maryg4":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"28 Aug 2016",
         "title":"Believe the hype!",
         "description":"The good: this setting spray really, really works. I used it for my wedding in late July (in VA -think  upper 90s temps, off-the-charts humidity), and my makeup looked perfect all night, from the outdoor ceremony and pictures through dancing, toasting, and just generally sweating from anxiety because I am sweaty. I have combination skin that's more oily in the summer, and seriously, my makeup did not budge.\r\nThe bad: I could feel it not budging? My face felt sort of tight and weird for horus - it felt like hairspray on my skin. I only used it twice, and it didn't make my face break out either time, but I really can't imagine that something that feels like it's stopping your skin from breathing can be good for it.\r\nOverall, I would definitely strongly recommend this spray for big events that require all-night perfect makeup, but I wouldn't use it just to keep my everyday makeup looking fresh or for a night out - it feels too intense.…read more"
      },
      "mutley321":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Apr 2015",
         "title":"wow",
         "description":"If you're like me, you wear too much makeup and love it. I walked through an entire outdoor event (big for me, because I'm lazy) in the rain, and someone looked at me and said- why does your makeup still look good? The answer is a) because I did a good job b) because of this product."
      },
      "wannabemua88":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Jun 2016",
         "title":"Amazing",
         "description":"I don't know how I've lived without this! It blends and sets my makeup flawlessly, and even corrects patches where makeup caked. Works especially well with powder. I have oily skin so sometimes my skin is too shiny after I apply it, but I just put a little Makeup Forever HD Loose Finishing Powder over it and it's fine. Just make sure you put on mascara AFTER using this or it can cause it to run."
      },
      "NurseCG":{ 
         "extra_info":"<b>Skin Type</b> Combination",
         "stars":"5 stars",
         "date":"22 Jul 2014",
         "title":"Works great for oily skin",
         "description":"I recently bought the de-slick setting spray and found that my skin started to look oily within 2 hours. I decided to try the all nighter one just out of chance that it would work and it did! I use this before and after i put on my foundation and it lasts all day and even on those days when I don't feel like wearing makeup I use this alone and my skin does not look oily throughout the day. Definitely a must have product…read more"
      },
      "breesie":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"31 Mar 2011",
         "title":"It really works!",
         "description":"About 3 years ago I underwent chemotherapy. Since then, my body has become very heat sensitive. Even in the dead of winter, I experience sweating on my forehead, eyelids and upper lip, which causes my makeup to melt off. I saw this product a couple of months ago, and didn't believe it would work. I didn't want to spend $29, just to find out. This week, I found a sample size in the store for about $14, so I figured \"what the heck, I've notheing to lose\". I am so glad I did. I spritz my face about 3 times immediately after applying my makeup, and it stays all day, even through the worst hot flashes. I used to be self conscious of my forehead and upper lip, because the makeup wearing off unevenly left them looking lighter than the rest of my face. Not anymore...this product works great! And , as an added benefit, it seems as though my skin feels softer.…read more"
      },
      "avelasco96":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"3 Nov 2016",
         "title":"Miracle Worker",
         "description":"I work in a food restaurant, where I am constantly moving and I am around hot food all day. My foundation usually comes off with my sweat and oily skin, but after purchasing this and wearing it for a full day of work until the very end of the day after my night class, my makeup lasted and looked perfect!! I was honestly so desperate and about to give up on having anything save my oily skin and my makeup from coming off of my face, but I am so glad I decided to try this out. I have been using it for the past week and I am in LOVE! It works wonders! Make sure to spray enough if you really want your makeup to stay. I pair this with my Lancome Teint Idole 24 Hour foundation, and its a match made in heaven.…read more"
      },
      "somersaultwme":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 Jun 2016",
         "title":"Holy grail product",
         "description":"I was somewhat skeptical about needing a setting spray on top of using primer and powder, but this product REALLY changed my tune. I often put makeup on at the beginning of the day and need it to still look perfect for afternoon auditions. This spray prevents me from having to do ANY touchups at all. It's also especially great for the summer when things tend to get sweatier and oilier. If you need makeup to go from day to night - or you just don't want to worry about things sliding around, this product is absolutely worth every penny. I do the full recommended four sprays when I know I need things to look picture perfect for hours, and just two sprays for hot days.…read more"
      },
      "BombshellBetty1":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"26 Dec 2015",
         "title":"Must Have",
         "description":"If you're a make up junkie like me and hate after a while, the make up starts to run, this is the answer to your problems. I do photoshoots and usually I use a finishing powder, but I also have dry skin. I found this and I swear, it works like a charm. Great purchase."
      },
      "stish":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"19 Dec 2013",
         "title":"worth it",
         "description":"Love this! Will definitely purchase when my current bottle is finished. My T Zone usually gets really oily. After about 2 hours. With this I can go about 6. And I live in south Florida."
      },
      "SabSavard":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"6 May 2017",
         "title":"Ewwwww",
         "description":"I used to love this setting spray.. Until I bought this new formula that comes in the black packaging.. What is wrong with that smell?!? I am soooo sad, it smells so bad I can't even use it!!"
      },
      "stephhlow":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Jul 2016",
         "title":"OKAY LISTEN...",
         "description":"I just bought the small bottle because I didn't know if I was really gonna like it. I just thought that there was so much can hype and that another cheaper setting spray would be just the same.... NO OKAY. OH MY GOD. I did my makeup like how I normally do ( full face, foundation, contour, shadow, brows, liner etc.) and then I sprayed a good amount (4-5 pumps) all over my face and then I went to the beach for a party. But I didn't just chill in the sand like most girls do. I went JETSKIING. And IT STAYED ON!!!! All of my makeup! Even my eyelashes(but I'm sure that was just the glue haha) But seriously guys. I was expecting it to be totally gone like how it normally would when you get in the ocean and get saltwater sprayed all up in your eyes nose and mouth, but this made it all stay and I was still able to take cute pics later in the day because MY MAKEUP STAYED THE ENTIRE TIME!!!! Okay so go ahead and add it to your basket now. It's worth it ;)…read more"
      },
      "natasha454":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"11 Jun 2019",
         "title":"really bad...",
         "description":"Really bad honestly maybe it’s just the formula, I’ve never tried the original all nighter but this one is horrible it doesn’t keep my makeup in place at all. If anything my makeup looks better at the end of the day without this setting spray! Definitely will be returning this."
      },
      "silverdancer":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"9 Nov 2014",
         "title":"What a difference this makes!",
         "description":"Wow, this stuff is amazing - it REALLY does what it says it's supposed to do. I am the perfect candidate to review this because before I discovered this, I was THAT girl, the girl whose lower lash liner got smudged soon after applying, no matter what type of liner I used, be it shadow, gel, or pencil (with primer, mind you). This keeps my eyeliner (and everything else) in place THE WHOLE DAY - no smudging! Couldn't believe my own eyes, literally AND figuratively! And an added plus - it's super refreshing, yet dries right away to set your makeup. Really glad I tried this; it makes quite a difference!…read more"
      },
      "aud3376":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Apr 2013",
         "title":"Great product",
         "description":"Spraying this on after makeup application keeps my face oil free for at least 12 hours and my makeup looks great! An added bonus of this product is that since I've started using it my acne has completely cleared up it is absolutely an amazing product that I cannot live without!!!!!"
      },
      "SpookyPumpkin":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Feb 2014",
         "title":"I'm very happy!",
         "description":"My boyfriend got this for me for my birthday along with a couple other items because I was interested in using it for work. I work in a grocery store where there's lots of water, sweat, moisture, drastic temperature changes ect ect, and I never feel like I can wear makeup at work because it's a waste if it's just gonna come off in an hour. Well, I sprayed how it said on the bottle; twice in an x shape and in a T shape, and after my shift was done (during which I actually sprayed myself IN the face with a hose) my makeup was still there, yaaaay! I'm so happy! I feel like I can actually do my makeup for work now. I don't go out much, so it's more of an all-day spray for me but I'm still quite pleased with it and will probably purchase it again in the bigger bottle when this one runs out.…read more"
      },
      "kaile":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Feb 2017",
         "title":"Best makeup product I own.",
         "description":"This stuff makes any makeup you have stay on, and I mean STAY ON. I once slept in a full face, after a night out, with this on and I looked basically flawless in the morning except for some mild eyeliner/mascara smudgage. I will buy this until the day I die haha, have it in full and travel sizes."
      },
      "rubyskull28":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"5 Jun 2017",
         "title":"holy grail setting spray",
         "description":"Every time I try a new setting spray I always end up coming back to this one. When I set my makeup with this I know it's not going anywhere."
      },
      "tammyolivia":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 Oct 2015",
         "title":"amazing!!",
         "description":"i just bought this because i saw all of the good reviews online. i was anxious to see how this would hold up with my skin. it gets oily extremely fast. no matter how much i prep and prime, everything gets oily and runs. so, i made a little sephora haul this weekend. got a bunch of good products for oily skin, this included. usually, after i do my eye makeup, by time the about 4 hours hits, my eyeshadow is rubbed off and my eyeliner is smeared, one of the reasons i stopped wearing eye liner to work. so last night i wanted to give all of my new stuff a try. after 7 hours of my makeup being applied, everything was still in place looking like i just did it!!! love this stuff!!!!!!!!…read more"
      },
      "stxenia":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"1 Aug 2015",
         "title":"It works!",
         "description":"The only thing I need to say is that it works! Even in the summer heat, which is when you really need it! As another reviewer mentioned, apply before mascara."
      },
      "alexinthecity":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"4 Jul 2013",
         "title":"Leaky, pore-clogging mess :(",
         "description":"Believe me, I would much rather write a positive review than a negative one. I am very disappointed by this product for a number of reasons:\n\n1. It leaks like crazy! Despite the fact that it has two lids (one clear, small plastic lid, and a larger purple lid to go over top) it constantly leaks if it's on its side. And yes, I have ensured that the lids are properly secured, but regardless, I've lost a lot of the product in my makeup bag.\n\n2. It causes breakouts. Luckily I rarely break out, but whenever I use this product, I break out.\n\n3. I really don't see a difference between using it and not using it.\n\nSigh. I really wanted to like this product, because it was highly recommended to me. But I'm very disappointed.…read more"
      },
      "LittlePrince":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"1 Apr 2016",
         "title":"Stays on forever!",
         "description":"I went out to do a night photoshoot and sealed my makeup with this. Halfway through the night it started raining but when I got back to my house an hour later and checked my makeup was still in place! This spray is incredible and it truly seals your makeup, would definitely buy again!"
      },
      "npelurie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"12 Aug 2014",
         "title":"Not impressed",
         "description":"My skin was oily after one hour! I used a mattifying primer and lotion and a powder foundation underneath this product. Pretty unsat and I will be returning."
      },
      "minishopaholic":{ 
         "extra_info":"<b>Skin Type</b> Oily",
         "stars":"1 star",
         "date":"7 Oct 2013",
         "title":"Formula change",
         "description":"I recently just finished my bottle of all nighter, which I bought in late November 2012 (before Urban Decay revamped all their setting spray packages in December 2012). I assumed that only the packaging had changed and not the formula, so I bought the new all nighter. I immediately started to break out with the new all nighter - I know bc it was the only thing that changed with my beauty routine. Just to be sure I researched online and sure enough I found out that that the formula had been 'tweaked'. I'm disappointed because I really was a huge fan of this product. This new formula might still work for girls with less acne prone/sensitive skin. I submitted a similar review of this product a week ago...strange that it wasn't posted. Hopefully this review will, since it may help other sensitive skin girls avoid a major breakout.…read more"
      },
      "leesh0430":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"17 Feb 2017",
         "title":"no",
         "description":"I did not like this at all. It smells terrible and did nothing to help my oily skin. It also feels quite sticky. Overall, it did absolutely nothing for me."
      },
      "EmmaRan":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Aug 2016",
         "title":"Essential!",
         "description":"I need this in my life. I live in very humid conditions and this helps my makeup not run! I can't say my makeup is absolutely the same as it is when I initially put the makeup on, but it looks WAY better then before when I didn't use this setting spray. My makeup would literally MELT off. My eyeliner would run, my foundation would move, and honestly I looked like a mess. Again, my makeup doesn't look perfect at the end of the day, but it does look way better. I don't know what more could I expect living in Central Florida! The Humidity is insane. I'm happy if my makeup lasts an hour. Very impressed with this setting spray and I will continue to repurchase.…read more"
      },
      "VictoriaSelina":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"15 Apr 2014",
         "title":"So amazing!",
         "description":"I absolutely L O V E this!!!! It just fixes everything. If my foundation brings out dry patches, this hides it. If I look oily, this somehow absorbs the oil. My makeup stays on forever and it gives me such a healthy glow. No look is complete without this!"
      },
      "jess728":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"8 May 2017",
         "title":"Did they change the formula??",
         "description":"I really really loved this spray....and I still have a bottle of what I am assuming is this old formula. But I recently bought the travel size to keep at work, proving how much i love this stuff, well use to ....but I can't stand the smell!! Unless they revert back to the old formula I will not be repurchasing. So disappointing :("
      },
      "beautyjunkie1":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 Aug 2011",
         "title":"Incredible!",
         "description":"I love Urban Decay's products, and the All Nighter Long-lasting Makeup Setting Spray has blown me away. This summer, I visited a Sephora store on a day when the outside temperature reached 111 degrees. I played around with some makeup, and then I used the All Nighter spray because I had been dying to try it. Of course, I expected it to melt in the incredibly hot temperature. To my surprise, the spray kept all my makeup in place even though I ventured outside many times that day. I was convinced to purchase it right away. I won't use it every day, but it works wonders for keeping my makeup in place on special occasions or when the temperature is incredibly hot.…read more"
      },
      "superslickgloss":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"23 Jan 2011",
         "title":"ALL NIGHTER, WHERE HAVE YOU BEEN MY WHOLE LIFE?",
         "description":"Product: Urban Decay Long-Lasting Makeup Setting Spray (29.00 for 4.0 fluid ounces)\nShade: Clear\n\n>> I didn't expect much when I got this, especially because I've never tried setting sprays before. Urban Decay claimed a lot of things about this, and usually I don't list what the company says, but just take a look...\n\n>> What it does: It's the new final step to your makeup routine! This weightless, super-fine mist holds foundation, eyeshadow, blush, and concealer in place so that makeup looks picture-perfect all day long. Temperature Control Technology prevents makeup from a melt down when it's warm and avoids makeup dehydration and cracking when it's cold. All Nighter works expertly on all skin types and prevents loss of color, melting, sliding, caking, cracking, excess shininess, fading blush, eyeshadow, and lip color disappearance. AND it's formulated to resist moisture, so you can fearlessly sweat, cry, or get your Jacuzzi on—you're guaranteed makeup that always looks just-applied, without ever feeling sticky or tight. Backed by years of science, All Nighter is simply unlike any other product available and keeps you looking flawless with just a couple sprays on top of your makeup.\n\n>> What else you need to know: All Nighter is allergy tested, dermatologist tested, vegan, cruelty free, and free of oil, parabens, and fragrance.\n\n>> Research Results: 81.8% of customers say product gave makeup a healthy glow. 78.8% of customers said product helped makeup avoid creasing. 75.7% of customers said makeup looked as good at end of the day as at the beginning of the day.\n\n>> Wow. A spray that is lightweight, super-fine, sets eye makeup, sets face makeup, sets lip makeup, uses temperature control technology, works on all skintypes, prevents de-pigmentation, prevents melting, prevents sliding, prevents caking, prevents cracking, prevents shine, prevents fading, prevents creasing, resists moisture, gives a healthy glow, and makes makeup look the same at the end of the day.\n\n>> Um... is it just me or is that a TON to offer! After reading that mouthful I was very skeptical of this product. Was Urban Decay just \"fluffing\" up the description. I was wrong. This spray really does all of that, I really wish I could just give this an A++++++++ to the millionth power. I was so surprised at how awesome this stuff is, anyways into the in-depth review.\n\n>> This spray is created by Urban Decay but uses formulations from Skindinanvia, or a brand that specifically creates setting sprays. I received this in a small bottle and followed the instruction by simply shaking and then spraying on the face. I like to make sure that everything is always even, so even though the bottle says spray 2-4 times I might of sprayed 5-8 times very lightly to make sure my whole face was covered. When I was spraying this on I thought it would feel very sticky or gooey on the face, or basically uncomfortable. Instead it felt like I was misting very \"finely milled... water\" on my face. The spray is very thin and feels as light as air on the face, as if you're running through a park in the early morning. Just a fine amount of dew on the face, very refreshing. The spray takes about 10-15 seconds to dry depending on how much you applied. So, overall the application was easy and the spray felt very refreshing. I noticed a slight 'sugary' fragrance, even though this is fragrance free; so maybe it's my imagination. Overall it just smells (not a bad thing) just when spraying; but the all of the scent disappears after it dries.\n\n>> Just to make it clear, I've seen people on Youtube spray this before applying makeup. According to the bottle you spray it on AFTER you apply makeup, so make sure you use it after makeup application. It will not work as well if you apply it beforehand because you are simply \"setting\" your natural skin. If you do have dry or oily skin setting beforehand can help makeup application go on easier though.\n\n>> Now here came the true test, to see if my makeup stayed on all day and really did the things that Urban Decay listed it did. After a 14 hour day, none of my makeup had changed. (Urban Decay claimed that this stuff works for 16 hours, and I believe them.) My makeup looked exactly the same. Obviously this didn't do anything for my tightline because the spray can't magically fly into my eye and along the inner rims. All my eyeshadow, eyeliner, mascara, concealer, tinted moisturizer, blush, highlighter, lip stain, etc. seemed to have stayed in-tact. It literally looked the same as it did when I had applied it in the morning. For temperature control these past weeks have been relatively cold because of winter. I didn't notice any flaking at all (score!), since I have dry skin this was surprising. (I was thinking of buying the version for dry skin, know as Dew Me, but this works fine. They also have a version for oily skin known as De-Slick.) I did test this out when I went out on a jog, and I noticed that my makeup didn't melt off and my skin didn't feel uncomfortable, (score again!).\n\n>> I can definitely see how this works on all skin types. I have slight combination skin meaning half of the time my skin can be normal. (No oil, no dry patches) While other times I can have lots of oil and blocked pores in my T-Zone, or forehead, nose, and chin. I will also have dry patches on my cheeks and around my nose also. This didn't disturb my skin type by making me any oilier or any drier, which is nice to know. If you have severely oily or severely dry skin I recommend trying out Dew Me or De-Slick, which are the same things but are formulated for certain skin types. I noticed that it did prevent all the things above, de-pigmentation (fading), melting, sliding, caking, cracking, creasing, bla bla bla. My makeup did look the same as it did in the morning and my skin had a soft healthy glow, something like a lit from within appearance. As you can see this setting spray is amazing and I apply it on to all of my makeup looks that I wear outside.\n\nEffectiveness: 10/10\nValue: 10/10\nPackaging: 10/10\nEase Of Use: 10/10\nOverall: 10/10\n\nGrade: A+\nOne of the best products I have ever tried. Truly.…read more"
      },
      "Meghan14":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"30 Aug 2015",
         "title":"it's okay",
         "description":"My job is stressful and requires me to be moderately active so I wanted a spray that would keep my makeup lasting all day. This was recommended to me by a sephora employee but I'm sorry to say I'm not impressed. When I get home, my contour/blush/highlight is completely gone HOWEVER my foundation is practically one with my skin, so that's nice. I think it would work very well if you're not extremely active, it just doesn't work for my situation. I'll keep using it until I find something better but I won't buy this again.…read more"
      },
      "siennahome":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"9 Jun 2014",
         "title":"I hate this stuff",
         "description":"Hate is a strong word. But I hate this spray. The trade-off for \"moisturized\" skin is shiny skin. I have combination skin, erring on the side of dry. After a day's work, my blush is blotchy and foundation is slide down my skin like a thin sludge. The shine is outta control. Not worth it."
      },
      "may02ale":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Sep 2014",
         "title":"much needed for weddings!",
         "description":"This setting spray may feel weird when it is first sprayed to the face, but boy does it work! Especially for very important events like a wedding! Forget the makeup running and have a blast knowing your face is as perfect as it was 8 hours ago!"
      },
      "CaityEliV":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"3 Jul 2016",
         "title":"Amazing",
         "description":"I live in Florida and one day I walked into a Sephora and when I took my sunglasses off I had spaces where my makeup had completely sweated off. I touched it up and decided to try this. It worked amazing! I even went swimming later that day and my makeup stayed intact."
      },
      "sundae0417":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"28 Aug 2011",
         "title":"You CAN pull all-nighters with this!",
         "description":"Love this setting spray! It's a tad pricey but TOTALLY worth it!\n\nThe thing is, I'm a sweaty gal. Not like a waterfall on my face sweaty but more of like a fine sheen over my face sweaty. When I'm at work, I'm always running back and forth from the kitchen to the cashier area so I do work up quite a sweat. I always had to retouch my foundation and I always had terrible raccoon eyes. After using this spray, my foundation stayed put and my eye makeup didn't run after a 6 hour workday! Totally worth the price!\n\nIf you don't want to spend $30 on it right away, try the travel size of this that's $11. They usually have them near the cashiers.\n\nHow to use: (at least how I use it)\nAfter putting on my foundation and letting my mascara dry, 3 sprays do the job. One spray for my forehead/eye area (close your eyes when you spray this!), one for my right cheek, another for my left cheek.\n\nThat's it! The formula dries really quickly and sets really quickly too so there's little to no waiting time! Spray and get out the door!…read more"
      },
      "lhyde":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"13 Sep 2013",
         "title":"Good stuff",
         "description":"I can tell that this makes my make up, including my powder blush, last much longer. My results were much better than I expected. I live in a hot humid climate and have oily skin. Cream blushers break me out but I've never felt like powder blush lasted, especially with a powder foundation. But at the end of the work day, I still had color on my cheeks and my powder foundation looked great too!! Will definitely always being using this in the future.…read more"
      },
      "Mila1993":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Jul 2016",
         "title":"I love this!",
         "description":"I live in hot and humid Florida. I have oily skin as it is, and the heat and humidity don't help my case. I've never tried a setting spray before this so I bought it. Does keep my makeup intact. People at work are actually noticing that I have make up on since it leaves my skin very smooth. By the end of the day, I have little to no shine. The only thing I dislike is that after it dries, my skin feels a little tight."
      },
      "rachelmyers4":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"4 Jan 2015",
         "title":"Must-have",
         "description":"This spray literally changed my life.... I have really oily skin that is hard to control even with primer, but I do 2-3 sprays on my face along with smashbox light primer, and my makeup is set for hours. After wearing all day, my makeup still looks fresh and I have very little oil. It's seriously a must have for anybody with oily skin."
      },
      "fracnbran":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"11 Apr 2016",
         "title":"Makeup setting Spray",
         "description":"Great product , works well!\r\nReceived a free sample & then went back to purchase!"
      },
      "Catssie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Dec 2015",
         "title":"Holy Grail Setting Spray!",
         "description":"This has been my holy grail makeup setting spray for a couple years. I always have to have a bottle on hand! One thing I love about this is that if you use it before you put on your makeup as well as after, it gives even better staying power. I have used this many times for weddings and special events, and everyone is always amazed at the stain power this gives. Two big thumbs up!"
      },
      "jmatth":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Jun 2017",
         "title":"Best Setting Spray",
         "description":"I ended up in the ocean on a very hot day with a full face of makeup while using this spray, and when i got out of the water everything was still exactly perfect. It's literally so good"
      },
      "diamondlove":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"11 Jun 2019",
         "title":"I'm giving this 3 stars bc the spray is the same as all nighter. But I solely purchased this for the scent which happens to be at the end of the ingredient list.  It literally smells like nothing so if your buying this for the scent it's not worth it.",
         "description":""
      },
      "theslickest":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"4 May 2016",
         "title":"AMAZING",
         "description":"I spent like 20 minutes in my professors office crying, trying to get him to round my grade in my favor (he didn't) but when I left my makeup was still perfectly in place!!! no tear streaks, highlight still on fleek, cheek bones defined AF,even my under eye shadow stayed. Everyone needs this. Buy it, buy two. It's worth it"
      },
      "BrianaaLopez":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Mar 2016",
         "title":"YOOOOO!!!",
         "description":"I just took a 3 hr nap and I still look bomb af ya'll if you're looking for good setting spray, THIS IS IT"
      },
      "cjbardt":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"14 Dec 2016",
         "title":"Absolutely LOVE this!",
         "description":"I've been using this since I was a teenager, and this year I turned 30. The formula is amazingly light, refreshing, and this product WORKS. I'm an emergency room nurse who runs around for 12+ hours sweating and like a chicken with my head cut off, but my makeup stays put and looks like I just put it on at the end of the shift. I have extremely sensitive skin that is acne prone, and this has never made me break out or made my face red and tingly like many other products. The price is great bang for your buck! I highly recommend this product to anyone and everyone that wants their makeup to stay put for more than 4 hours.…read more"
      },
      "vanessa4":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Dec 2015",
         "title":"skeptical at first, but it made me a believer",
         "description":"At first, I thought makeup setting sprays were a product that had more of a placebo effect than real results. I bought the 1 oz to try during my summer spent in Europe. It was ridiculously humid and this spray did miracles for my makeup! I was out nearly every day for the entire day, walking, eating, etc. I was NOT willing to lug around makeup for touchups in my little crossbody bag, and with a few spritzes of All Nighter in the morning over my full face of makeup, I did not have to! What a lifesaver. My skin is very oily and I worried it would make me look shiny, but alas it did not. Normally I don't write reviews but this product really blew me away. Very impressed and I will continue to repurchase.…read more"
      },
      "kaycee01":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"30 Jul 2012",
         "title":"All nighter",
         "description":"I had a makeover at Sephora before my birthday date, the lady used this on me after getting my makeup done, and it stayed on all night, even the next morning i had it on!!!! This is a great product, not sticky or clam like. It's perfect if you want makeup all night for those long nights."
      },
      "MilCK":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Jan 2013",
         "title":"Only setting spray ill buy",
         "description":"This does its job! What sets this apart from other setting sprays is actually the bottle. I've used several bottles of urban decay, and it's always been realizable. Others I've used either clogs or will not spray for numerous attempts which can become frustrating. Reliable and my makeup lasts from 8am until whenever I get home!"
      },
      "newaddict":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Apr 2014",
         "title":"Amazing.",
         "description":"I use this daily after putting on my makeup. It evens all my makeup, I never look \"powdery\" or have \"cake face\", and sets my makeup ALL day! I work 13 hour shifts... It's a must!"
      },
      "velvetpegasus":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"29 May 2011",
         "title":"Mom Likes It",
         "description":"My mom now draws her eyebrows on - and by the end of the day a swipe of the hand, a little scratch to the forehead, leaning her head on something, causes them to disappear.\n\nSo I invested in this spray for her.\n\nHer comments :\n\n1. It does hold Make-up on beautifully\n2. The spray darkens eyebrow pencil color though\n3. And it's mildly shiney - a light powdering fixes that\n\nSo far this is the best product we've found out there - only problem is # 2 above.\n\nOther products are stickey and excessively shiney.\n\nUntil we find one that keeps her exact eyebrow color - this is it !!! And for now she just buys a lighter eyebrow pencil to counteract the affect.…read more"
      },
      "chels940":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Aug 2014",
         "title":"really does the job",
         "description":"I have normal to oily skin and I found when doing my makeup, not only would my foundation start to fade but even my eyeshadow would start to fade as well over the hours I wore it. Then this miracle came into my life haha! I use it every day and I will say it TOTALLY helps your makeup from foundation to shadow stay. It has become a must in my makeup routine."
      },
      "jaly180":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Jan 2016",
         "title":"best setting spray ever!!!!",
         "description":"I bought the smaller version to try it out since I have really oily skin and my foundation tends to wear off throughout the day. Hands down I am so happy to have purchased this setting spray. I work 10 hr days and I just look a little luminous after a long day instead of a shiny grease ball. I will def be getting the bigger bottle."
      },
      "cblackburnatx":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 Apr 2013",
         "title":"OH MY GATOS!",
         "description":"This product has got to be the most amazing thing I have ever used. I have incredibly oily skin, and even with powder it just seems to slip off my face, but not now. It's like super gluing your makeup to your face. just perfect."
      },
      "jharetoun":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"7 Jun 2015",
         "title":"This is lightweight, yet heavy duty stuff!",
         "description":"I have more normal than combination skin, with occasional dryness around my chin and mouth area, and throughout the day my skin gets a bit oily around my T-Zone.\n\nI tried this for the first time a couple days ago when I was a bridesmaid for a wedding. I did all the bridesmaids' face makeup and topped everyone off with a couple sprays of this setting spray. Everyone's makeup stayed put all day long, and all the girls had their makeup done by 10:00AM. And in my culture, wedding's involve dancing from morning until night. I even sprayed the bride's face with it when she was done with her makeup and she looked flawless all day. She only needed to be touched up with some bronzer on her forehead toward the end of the night because the banquet hall was about 100 degrees and she had sweat it off.\n\nSpeaking of sweating it off...the ceremony was also really warm and I sweat pretty easily, as well. I was dabbing my forehead and upper lip with a napkin during the ceremony because I was quite literally sweating my butt off (TMI, I know) and when I looked at the napkin, there was NO makeup transferred to it at all. I'm not even exaggerating.\n\nI especially like using this product in collaboration with my MUFE mist and fix spray which I like to spray on to make myself look less powdery and to intensify my highlight. The two products work really well together. I used it yesterday on its own, however, and it looked even more amazing and I did not touch up at all (I had another wedding to go to so I had a full face on again). It even made my highlight glow really nicely.\n\nUsually I get creasing on my laugh lines but there was less creasing than ever when I got home after the second wedding. I didn't look powdery either. I'm really happy with this product.\n\nThe best part is it doesn't feel like hairspray for your face. You can't even tell you have a setting spray on once the mist has dried.…read more"
      },
      "jenjen0312":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"7 Jun 2010",
         "title":"have used it a few times after my purchase",
         "description":"have to say what this product does really intrigued me....has it really made a big difference with how long my make up wear? I can't really say it was amazing, but my make up does seem like it stayed on longer and looked fresher! i haven't also been out all night to be fair after the purchase of this spray! The only concern i have is if the ingredients in this bottle is going to be bad for my skin, clog my pores!"
      },
      "fulllife08":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"23 Sep 2015",
         "title":"not that great",
         "description":"I was super excited to try this makeup setter but it seemed to bother my skin. It kept my makeup in place but made my skin itchy. I returned it sadly. My sensitive skin doesn't seem to care much for it. But it did make my makeup last all day even through the hot humid temps."
      },
      "Shanstinator":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Aug 2016",
         "title":"this stuff is BALLER",
         "description":"Yo hear me out. This stuff is literally INSANE. So I don't understand makeup and all and learned how to contour last week so basically my method of makeup putting on is like....layer a ton of different things and say three hail marys. So I sprayed this on after that, it held up all day. Then my boss handed me tickets to go to a Darius Rucker concert with my other boss and coworkers in 106 degree heat. This stuff held up through me tailgating while drinking two cups of wine, shoveling french fries into my mouth while being drenched in sweat, and all through the night when I forgot to take it off. 5/5 would recommend fot getting drunk with coworkers.…read more"
      },
      "glitterfemme":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"4 Sep 2014",
         "title":"has many uses and is totally worth the cost",
         "description":"i've used UD all nighter for a couple years now: it hasn't once let me down. i have very very dry skin and therefore use foundations that are quite moisturizing, like bobbi brown's tinted balm, and i never powder my face. (at most i use a tiny amount to spot powder over concealer and that's it.) despite all that, this makes my makeup stay in place and not transfer to clothing / seatbelts / my spouse lol.\n\ni've recently found a couple uses for it that make all nighter even more of a go-to product for me. i have hooded eyes and eyeliner transfer has *always* been a problem -- until now. i use a tiny liner brush, load it with a dark eyeshadow, mix it with a dot of this spray, and then apply it like eyeliner. no transfer, no smudging (even with tears and rubbing), and no fading. love. i also recently saw a wayne goss vid where he used setting spray to set under eye concealer -- works like a charm and is now my #1 concealer \"trick\" to prevent creasing.…read more"
      },
      "littlehoneypot":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Feb 2016",
         "title":"This stuff stays!",
         "description":"I used to hate crying in public because my makeup would come off but I can cry whenever I want now because I can cry for like two hours and, unlike my life, my make up will still be perfect."
      },
      "shopgirl90046":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"4 Jul 2011",
         "title":"Great product if you're indoors with the ac on.",
         "description":"I first tried this spray at work and I noticed that after 10 hours, my eye make-up and foundation stayed put and I did not have to retouch once. However, I was in doors and the temperature was controlled and cool with the ac set to 72 degrees. I used the product during the day and being out in warmer temperatures, my eye make-up smudged after an hour and my make-up needed major retouching."
      },
      "Hjaye":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"26 Aug 2015",
         "title":"I had to go 2 1/2 weeks without this setting spray, so I tried some glycerin concoction I found on Pinterest to try and replace it.. There is no replacement. This is absolutely a ride or die.",
         "description":""
      },
      "sarahdarling":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"26 May 2011",
         "title":"All day long",
         "description":"This is my second time buying the product and I felt like I just HAD to put in a good word. My face is generally prone to breakouts and I have a naturally red undertone that I like to cover up with sheer makeup which after 2-3 reapplications throughout the day begins to make my face look more like a birthday cake.\nAfter 5-7 sprays of this, though, my foundation and eyemakup stay close to flawless all day long! I love it and can't leave the house without it.\n\nI took this picture after a full 8 hour day without reapplication (completely unedited and in natural light).. see for yourself!…read more"
      },
      "onelove":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Nov 2011",
         "title":"NOTE:\nHow long your makeup stays with the use of this setting spray really depends on how you do your makeup.\n\nFor best results follow these steps:\nmoisturizer -&gt; primer -&gt; foundation -&gt; setting spray -&gt; finishing powder (for the velvety look)\nOR\nmoisturizer -&gt; primer -&gt; foundation -&gt; finishing powder -&gt; setting powder (for a dewy/glowing look)\n\nYou cannot simply use foundation and setting spray, and expect your makeup to stay on for 16 hours. People with oily/combination skin should definitely follow the steps above!<div class=\"css-xq9yyh \" data-comp=\"Box\"><button class=\"css-nlkkp4 \" type=\"button\" data-comp=\"Link Box\">…read more</button></div>",
         "description":""
      },
      "LCRAW":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Jun 2019",
         "title":"Beach in a bottle",
         "description":"This smells just like the beach! I’m in love :) I douse myself in this stuff every few hours"
      },
      "vanewpc":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"28 Mar 2011",
         "title":"Try the smaller version before Investing in this",
         "description":"This product did not work at all on me. My makeup did not stay on any longer than normal while using it"
      },
      "lini07":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"30 Apr 2015",
         "title":"lasts hours and hours",
         "description":"Played carnival and used this to set my makeup. Hot sun, humid, sweaty..and YES this lasted from the time I put it on till I was ready to take it all off."
      },
      "Samrr":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Nov 2015",
         "title":"definitely keeps makeup in place for hours. But make sure you absolutely love your makeup before spraying, because you can't re apply later . made my skin look blotchy after I tried putting a little bit of bronzer on.",
         "description":""
      },
      "chloe14":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Sep 2011",
         "title":"Fantastic product",
         "description":"This spray came with the sephora summer set & I tried it thinking it wouldn't work. I was wrong. The first time I used this spray I had walked several miles in 100 degree heat. My mineral makeup looked great! I was sold and continue to use this spray daily. I have normal to dry skin that's very sensitive & this product does not dry out or irritate my skin."
      },
      "teresanc":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"28 Aug 2011",
         "title":"Great Staying Power",
         "description":"This setting spray is fabulous. My makeup truly does not sweat off when I use this. It doesn't fade, melt, or sweat off. I've tried several setting sprays and this is the best to keep the color and the texture of my makeup fresh."
      },
      "AmandaFreakinK":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Jun 2017",
         "title":"Make up routine staple",
         "description":"I've been using this spray for at least five years. I work in a kitchen at a BBQ restaurant and sweat buckets. It's also incredibly hot at my station.. I use this setting spray before I go to work and look gorgeous still when I get home. This is one serious setting spray!"
      },
      "kesselrun":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Jun 2017",
         "title":"i am officially sold",
         "description":"I've been skeptical of many setting sprays. my t zone gets very oily, so of the ones I've tried, I've always gone for oil control ones. Skindinavia oil control, urban decay de slick, i didnt notice any difference in the staying power of my makeup. I liked Cover FX mattifying setting spray as a great alcohol free mattifier. But this UD all nighter is the real deal. i bought it specifically for an event this past weekend. on the day i needed it, it was 90  degrees. i was going to a concert at a casino, so although it was air conditioned it still was extremely hot in the venue. i wear hourglass veil primer, UD all nighter foundation, and baked with RCMA powder. Then used my UD setting spray. i applied it around 2pm, and when i checked my makeup in the bathroom mirror at 11pm after sweating for 4 hours, i was scared. i looked in the mirror and noticed my makeup didnt move an inch. i was so stunned and impressed. this is going to be a staple for me to use in summer time.…read more"
      },
      "melissakay85":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Jan 2012",
         "title":"Better than I expected!",
         "description":"Before I purchased this product, I feared that it would not do what it advertised that it would do. Not only does it effectively keep my Bare Escentuals Mineral Makeup on all day, but it still looks great at the end of the day."
      },
      "jennshin0301":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Apr 2013",
         "title":"the best makeup setter ever!!",
         "description":"i went thru 3 bottles already! its the best makeup setting spray i ever tried. even if you go clubbing and sweat like crazy, after u come home, the make up almost same as before (but make sure you spray thoroughly enough). i was amazzzed!!"
      },
      "leaw":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"31 Aug 2010",
         "title":"Best kept secret",
         "description":"I was always skeptical with products that \"claim\" to set your makeup all day...I mean, come on...really? Well, I was proven oh-so-wrong with this miracle bottle!! My makeup lasted all day in the humid days of summer!! No streaking, no melting, no creasing!! When my day ends at 5:30pm, it looks just as fresh as it did when I applied it at 7am!! Keep in mind, it didn't work for lipsick! However, this bottle will last a VERY long time!!! I can't suggest this product enough!"
      },
      "AllieC1368":{ 
         "extra_info":"<b>Hair Condition</b> Chemically Treated (Colored, Relaxed, or Permed)",
         "stars":"5 stars",
         "date":"9 Aug 2018",
         "title":"What is this witchcraft?!",
         "description":"Just got back from bouldering for the first time in years, and despite the fact that I sweat probably all the water in my body, my full face of makeup is flawless. I didn’t get any makeup on myself from wiping my face with my shirt, either. This is witchcraft and I love it."
      },
      "tracylura":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"3 Nov 2015",
         "title":"This stuff saved my face!",
         "description":"I got married outdoors on a very hot, humid July day. I used Urban Decay's All Nighter Makeup Setting Spray after applying my makeup and every ounce of my makeup remained in the same place I put it originally. I was soaked from head to toe from sweating (gross!), but my makeup remained fabulous! Thank you Urban Decay!"
      },
      "MargaretJo87":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Mar 2014",
         "title":"Works for the stage!",
         "description":"I bought this to use for a show where I literally had buckets of water dumped on my head. And it sure worked! Foundation, cheeks, and eyes stayed through the entire 2 hour show and then longer for cast parties! Just be careful to hold it far enough away from your face when you apply or the moisture will make your makeup run before it sets. Now to test it in Italian humidity...."
      },
      "Reina78slhi":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"9 May 2016",
         "title":"I prefer this setting spray by UD over all the other brands because it's doesn't have a strong fragrance, my makeup lasts longer, and it's refreshing to use throughout the day.",
         "description":""
      },
      "TurnMySwagOn":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"9 Jun 2017",
         "title":"Believe the Hype",
         "description":"I was skeptical that was I perceived as a spray bottle full of water would do anything for me but it was on sale so I gave it a chance. OMG. My makeup looks like I just applied it after a full day of being out (about 15 hours). I am shook."
      },
      "dannikat":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Feb 2016",
         "title":"Yo I went on jurrasic park and my makeup didn't even smudge!!",
         "description":""
      },
      "Shak212":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Apr 2014",
         "title":"I feel the difference",
         "description":"I have always watched woman with their makeup on and wondered how do they not get the makeup all over their clothes like I do? Well I think I found the answer. I started using this last week and it feels great I have to say I notice my makeup doesn't smudge like it use to, and I don't notice any annoying smudges of makeup on my clothing. I highly recommend."
      },
      "moniandjohn":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"17 Dec 2015",
         "title":"Love it",
         "description":"I'm a flight attendant and my make up looks great from New York all the way to Japan. A must have"
      },
      "hmazie":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"3 Jun 2010",
         "title":"I tested this stuff in store, I love it! My makeup didn't budge all day. At the end of the day I had completely forgot I even put this stuff on, it was so light. I didn't really notice a remarkable difference in shine control, but it probably depends on the person. I only have two concerns about this product; one is the high price, but at least you get a good size amount for your $, two is you have to figure out the right spraying distance. Spray too close and your face is drenched, spray too far away and you won't get the maximum amount of staying power ( so if it doesn't work the first time for you maybe you don't have the correct spraying distance )",
         "description":""
      },
      "vdang002":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"9 Aug 2013",
         "title":"This setting spray gives a wonderful finish to my make up everyday! I am already onto my second bottle, having my first one being the older packaging XL version. I have to admit the first few times I just thought this spray was not working at all but that was just because I was literally using this as the final step to my make up routine. Because of that my face got super oily, a big no-no. However now I use this after finishing my eye makeup and foundation but before I use a loose power/bronzer/blush. By doing this, this product works AMAZING. I give this product 4 stars because this product works amazing but the price is quite high.",
         "description":""
      },
      "StephenieR":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Sep 2016",
         "title":"Second Bottle!!",
         "description":"I'm not one to go back to products. I like trying out different formulas and brands. Well this i had to repurchase before I ran out of my first one!! I LOVE it! The mist covers your face evenly which I've found others have a patchy spray. It doesn't feel like hairspray, super comfortable. I just don't know how I was surviving without it! Your makeup won't budge I promise don't think about it anymore just add to cart trust me!"
      },
      "Carly1234":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"31 Dec 2015",
         "title":"I always repurchase",
         "description":"This product is great at keeping makeup on for long periods of time, and beautifully sealing powder. I have normal/dry skin and when layered over my foundation and powder this product makes my complexion appear satiny and seamless.\n\nHowever, do not use over liquid foundation if you have not set it with powder. This will make your skin appear blotchy and emphasize your pores."
      },
      "beckybeauty":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"6 Feb 2016",
         "title":"if you wear bareminerals , you must get this",
         "description":"This really does make your make up last all day and night. The other benefit is it sets my bare minerals make up and makes it look completely airbrushed and flawless. I don't know if it has the same effect with liquid foundation, but it makes bareMinerals look amazing. I spray an X shape over my face. Perfect."
      },
      "hanibanani":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Jan 2015",
         "title":"works!",
         "description":"At first it took me awhile to tell if it worked or not but it Def does. I work at a club and by the end of the night makeup is still on. It doesn't feel like you have anything extra on your face. Def recommend. Will Def repurchase!"
      },
      "Reedzor":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Aug 2015",
         "title":"Flawless Victory",
         "description":"This is the stuff of dreams. Whether I'm doing a light makeup day or a full face, finishing it off with the UD all-nighter is the best. I don't do touch ups on makeup throughout the day, and this setting spray seriously carries me through. After a long day a work (or a long night of parting) my makeup still looks fresh and flawless. I previously repurchased and repurchased the smaller size, but I have finally accepted that I can't do without this spray and I should really just purchase the full size from now on."
      },
      "beauty4cutie":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"23 Sep 2012",
         "title":"exaggerated.",
         "description":"Boy I wish this worked, but I guess with combination skin and humidity, I didn't notice any staying power at all."
      },
      "MeganBrennan":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"8 Mar 2017",
         "title":"Amazing",
         "description":"I absolutely love this setting spray. It's my all time favorite and I won't use anything other than this. The only issue I have with the new formula or whatever urban decay changed is that it has a very nasty smell. Other than that it's amazing as usual."
      },
      "Rubyruby420":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"23 Apr 2017",
         "title":"Smells like baby wipes",
         "description":"The Urban Decay All Nighter spray used to be my favorite setting spray! It smells so bad - like someone slapped my face with a pack of baby wipes! I will not repurchase this unless they make this an unscented spray."
      },
      "NY354":{ 
         "extra_info":"<b>Skin Type</b> Normal",
         "stars":"5 stars",
         "date":"15 Nov 2012",
         "title":"Awesome",
         "description":"I love wearing makeup but have always had a problem with it fading and/or smudging (especially eyeliner). I've tried probably everything on the market to prevent this. This spray is unbelievable. I can put on my makeup at 6:00am before work and when I get home after 7, it still looks perfect - hasn't smudged or faded at all! SO happy to have finally found a product that works for me!"
      },
      "snowywhiteowl":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"19 Apr 2011",
         "title":"urban decay all nighter setting spray",
         "description":"I'm not one to usually write reviews unless something really stands out amongst the others. I used this product after applying my makeup on 2 occassions where I'd be out for a night and the other being outside for the day. Several people asked me how I got my makeup to last so long. Being a makeup artist, first I did want to let them know the type of foundation I was using but, I told them of this new product I bought by Urban Decay called the \"All Nighter\" that was supposed to set makeup and help it stay in place. It definitely did its job because I didn't have to use oil-blotting papers or powder any areas the entire time. I did buy the trial size bottle but, will surely buy the full size once I'm out. I also bought \"Dew Me\" but, haven't used it. Will have to let others know of its performance later."
      },
      "indigodiva":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"19 Jan 2017",
         "title":"I used to love this spray",
         "description":"I've used this spray for a long time now because I have very oily skin. I recently purchased a new bottle and saw the packaging changed but I thought it would be the same spray--it's not. This new formula smells like a mixture of puke and morning breath! Yuck!  It's really bad,  Also not keeping the shine away the way it used to.  I'm not sure what they did but it's not an improvement!"
      },
      "kramer789":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"30 Sep 2010",
         "title":"Urban Decay Makeup Setting Spray Review",
         "description":"I have an extremely oily T-zone. i tried this product and was only slightly satisfied. It did help with my makeup last longer than without it, perhaps 3 hours where normally I would see shine within the first 1/2 hour, however, it did not hold for nearly as long as it claims. I would not buy this product again but rather I would be interested in trying further products along this line in search of something better suited for my needs. I am happy I tried it as it gives me hope of finding something stronger. It might work better on someone without such an extreme case of oily skin."
      },
      "bambidanielle":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 May 2014",
         "title":"Delivers Results",
         "description":"This product is fast-absorbing and really helps my makeup stay put. I don't use it everyday because I feel like it isn't necessary, only when I go out on the weekends to parties, etc. My makeup stays on all night and since I only use it once or twice a week it has lasted nicely for the price!!!"
      },
      "ascvbnm":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"25 Feb 2017",
         "title":"love it",
         "description":"Most of the bottles I've purchased the spray hasn't been very even, so that could be improved. But the quality of the setting spray is matched by nothing I've ever used, so i deal with the unevenness. Sometimes it can be a little drying but I have dry skin as it is."
      },
      "lizz95":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Mar 2017",
         "title":"Amazing!",
         "description":"A friend told me about this setting spray and while I was super sceptical about it working due to my skin type and length of time I need my make up to stay in place, it was amazing! I can tell the difference when I don't use it. It's a must have!"
      },
      "sf327":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"19 Feb 2016",
         "title":"disappointed",
         "description":"I heard a lot of good things about this spray (even from people with oily skin), so I decided to give it a try and what a mistake it was. One hour after using it my makeup oxidized, 4 hours later my face looked like I applied oil on top of my makeup. And the next day I had breakouts all over my face. So its sad to say that this product was not meant for me."
      },
      "MaggieMF":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Feb 2017",
         "title":"great product",
         "description":"I use this product every day, I've been using it for about 2 years now. I couldn't recommend it more! Makeup stays on all night and the next day if you don't take it off with makeup remover!!"
      },
      "ariv":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Jun 2015",
         "title":"Favorite Setting Spray!",
         "description":"This is by far my favorite setting spray. I have oily skin and have used the De-Slick setting spray from Urban Decay also and have found that it does not keep the oil at bay as well as this one.\n\nThis setting spray leaves my skin feeling refreshed and it lasts for hours. I do have to blot during the day but that is just because of my crazy oily skin. But this spray keeps everything in place longest and I do not have to worry about my makeup budging at all.\n\nHighly recommend if you have oily skin or if you work long hours, works amazing."
      },
      "Butkovich":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"26 Jun 2017",
         "title":"GoodPurchase",
         "description":"This product makes my makeup lady all day. I work in a fast food restaurant and before using this, my makeup would be a mess by the end of an eight hour shift. now I find my makeup lasts the entire day and still looks amazing. my only complaint, and the reason I took off a star, is because of the smell. I'm not usually one to complain about the smell of a product, but it smells truely horrid! it does fade, but it's hard smelling something that nasty everyday. overall, I highly recommend this setting spray!!"
      },
      "simplem8up":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"3 Feb 2015",
         "title":"ALL DAYer TOO",
         "description":"I love this product been using it for about 4 years or since it came out in stores. the new look is more simple which I like. Bottle is still soft. This product doesn't dry out my skin and I have a T-zone (dry in winter, oily in summer) problem aka combination skin type. 4 or 5 sprays of this stuff is PLENTY. This is awesome stuff."
      },
      "BlueFreckles":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Aug 2018",
         "title":"AMAZING",
         "description":"I have used this spray whenever I go out have always been  impressed, but today was a true miracle. I just got back from an 8 hr event that included dancing, sweating, rain, hugs from relatives (who deemed it necessary to squish my face into them)- my makeup DID NOT BUDGE. Of course I used primer and powder to set my foundation and concealer, but honestly? My makeup would have been gone after 3 hours without the spray. I will definitely be buying this again, and recommend everyone buys it until the end of time. (pic is of me post-event)"
      },
      "angiediaz":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"18 Mar 2018",
         "title":"Definetely worth it",
         "description":"Guys, I though this product was over rated, like there's no way it would be any different from my other setting sprays.\nNO. i was soooo wrong. \nSt. Pattys day, woke up at 7am- did my super extra makeup, partied, napped, partied again, didn't get home till almost sunrise, and my make up  WAS ON POINT YALL. \nI recommend this to literally everyone ever."
      },
      "tenngal":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"18 May 2010",
         "title":"Miraculous!",
         "description":"This is like a miracle spray! This makeup setting spray works absolutely great. It sets my makeup for the day and it looks as good at the end of the day as it did at the beginning, which is saying a lot because I have very oily skin. I put my makeup on as I normally do and as the last step, I spray this super-fine mist over my entire face and it keeps all my makeup set for the day, including lipstick, eyeshadow, mascara, etc. It’s easy to use. I hold it about 8 inches away from my face and spray in an “X” and then a “T” pattern so it’s distributed evenly and then I’m done. It’s one extra step in my makeup routine, but it only takes a minute and it’s worth it. This is a great new product."
      },
      "haleyalexis":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"28 Jan 2011",
         "title":"I found a keeper!",
         "description":"Wow, so I'm not a big fan of setting or finishing powder (especially the mineral veil that comes with BE). I bought this on my trip to Vegas recently and let me tell you, I'm now a believer. I had crazy, long night full of clubs and dancing and this really improved the staying power of my makeup.\n\nI usually switch up my makeup to search for new favorites, but this has me sold! This really will become a part of my routine! I use it every day now after applying makeup! Fantastic!"
      },
      "rosiejean":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"22 Aug 2016",
         "title":"I can't believe I used to do makeup without this!",
         "description":"LOVE THIS PRODUCT! I coat my face with about 10 spritzes every day. It feels so cooling and luxurious. It absolutely melts my makeup into my skin and takes away all powdery-ness. I can touch my face and have absolutely no makeup come off on my fingers. Lasts through a whole day... including a waitressing shift!"
      },
      "ccarmen":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"25 Nov 2016",
         "title":"Best setting spray!",
         "description":"This is the only setting spray that actually makes my makeup last all day. I tend to get very oily in certain spots of my face but this totally helps! I love it!"
      },
      "PrinzessinNaomi":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"12 Jul 2016",
         "title":"Did not work for me",
         "description":"I bought this setting spray because i heard it was a great. I really wanted it to work for me because I love urban decay products. I put it on and in the end of the day my makeup was gone. Maybe it doesn't work for oily skin girls like me."
      },
      "Rayybies":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Jan 2015",
         "title":"Holy Grail!",
         "description":"I will not leave my house without this stuff! Not only does it do a great job at setting your make up as you do it, it also brightens and freshens up your make up throughout the day!"
      },
      "wxlf":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"16 Jun 2014",
         "title":"Gets the job done",
         "description":"I was really surprised how well this stuff actually works. I work as a waitress and I'm constantly sweating or accidentally getting splashed by something, and by the end of the night I would look terrible. You don't need more than a spritz or two, and spending money on this allows me to justify buying more drugstore makeup."
      },
      "repurcgase":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Jul 2016",
         "title":"amazing",
         "description":"Went on a college tour in North Carolina in at least 100 degree heat, humidity was 93%, and my makeup was still flawless at the end of the tour! Highly recommended!"
      },
      "buttercupkitty":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Dec 2010",
         "title":"Whenever I know I'll be out for a long day or night I know I can always turn to this baby. I sweat A LOT esp my nose during hot summer or when I go out and have fun and by using this product my makeup does not melt away at all! The pump is very well made that when you spray the product the mist applies on to your face very evenly and light. Before the product came out, I was using the Make Up Forever Mist &amp; Fix. The Mix &amp; Fix was nice too but when you spray the mist it does not feel as light or even. However the Mist &amp; Fix has a travel size bottle, I'm hoping that Urban will come out with one too so it's easy to bring it around when I go out. What I do is when i'm done with the travel size bottle of Make Up Forever I pour Urban's spray into it but again the pump is not that great. I would HIGHLY recommend to get this spray if you want long lasting makeup.\nPS. Did I mention it is refreshing with a really nice scent to it too?",
         "description":""
      },
      "GypsyKay":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"21 Apr 2015",
         "title":"I really like this product! It smells pretty yummy and doesn't make my face all sticky. It's lightweight and fast absorbing and it works pretty great, too. Would love to find a product that lasts just a littleee bit longer, but until then, this works awesome! It's definitely good to have in your makeup collection, especially if you live in a place where it's a little more humid. Worth the money.",
         "description":""
      },
      "karosm":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"15 Jul 2012",
         "title":"Believe The Hype",
         "description":"This is one of those products every single woman/girl who has to wear makeup all day should own. Period. The hype is real, and it's amazing. Just try it. If you don't like it, well, you already know Sephora's awesome return policy. But you won't need to use it. You will just want to buy a bigger bottle."
      },
      "Alley89":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 Feb 2014",
         "title":"Pretty Fantastic",
         "description":"I love this setting spray! I put it on in the morning before work everyday, and when I go home and wipe my make up off the amount of make up that comes off is amazing!\nI did a test, and one day compared how much make up came off with the setting spray and without. Lets just say I will never be without this stuff. Thinking of trying the De-slick spray next..."
      },
      "raiyah12":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 May 2016",
         "title":"kinda sticky but...",
         "description":"Makes my makeup stay on forever, took a nap in my full face of makeup and woke up looking as good as before I closed my eyes!"
      },
      "ladysheeva":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Jun 2016",
         "title":"HOLY GRAIL!",
         "description":"If you wear make up then this product MUST be in your kit! I have tried setting sprays from big brands and they work fine, but this product is noticeably on a whole other level. When people compliment your make up for looking fresh through out the day, you know it works. \n\nI deal with a shiny T-Zone and make up settling into my fine lines, especially under my eyes. I've had minimal shine, my make up has barely creased, and my foundation is still solid after 10  hours. Look, you're always gonna have shine and creasing, but this product minimizes it better than anything else I've tried. \n\nIf you still have issues with your make up staying put, you may need to look into using primer, or your current primer may not the right formula for your skin or with the foundation you've paired it with. \n\nI'm blown away by this product and it's already become a vital part of my make up routine!"
      },
      "psame":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"29 Dec 2014",
         "title":"Not so oil proof",
         "description":"i have really oily skin, and when a rep at Sephora suggested this to me, i was than excited to try it.All of your reviews were promising.\nI bought i, and tried it for a couple of weeks. It made my skin worse and more oily than before! i am truly dissapointed and need to find something that wont let the shine through!"
      },
      "hugtime":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Aug 2013",
         "title":"I use it every day",
         "description":"My winged eyeliner + face contours stay on all day, even through me walking a mile to and from work. It's flexible, so it doesn't settle into lines like some primers/heavy shadows or concealers."
      },
      "Jjlm1991":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Aug 2015",
         "title":"Amazing!",
         "description":"This stuff is amazing!!! I went to a Slipknot concert in Las Vegas that was outdoors; not only is Las Vegas hot, but I was up front with a mass of sweaty jumping people that made it hotter. This spray made my makeup last through al of that. I would recommend this for anyone who is going to be somewhere that is going to be very hot!"
      },
      "MirMir5":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 Apr 2012",
         "title":"Keeps my face \"on\" and non-greasy",
         "description":"I tried the travel size version and I am a believer! This product delivers and then some. i like matte face makeup but for some reason some parts of my face look cakey after foundation so a spritz of this stuff hydrates my face without coating it in grease. This stuff helps with eye makeup too, like keeping your lashes \"on\" but not dried out like waterproof formulas can. I recommend this to everyone<3"
      },
      "jen1ny":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 Feb 2013",
         "title":"It Just Works",
         "description":"I love this product - I first got it in the small sample size to test it/fit it in an airplane carry-on. The first time I used it, it last all night through a party and into the next day (a little gross, i know!). It goes on light, dries super fast, and even if you don't use the De-slick version, it keeps your face dry. And most importantly, your makeup will not budge. It is my go-to for any event, especially weddings. You only need about 3-4 spritzes and you're good to go. It is absolutely worth the money."
      },
      "becksies":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"26 Jul 2011",
         "title":"Something works",
         "description":"After talking myself in and out of buying this product I compromised and bought the travel size. Ive used it for two days, the first day I sprayed 3 times after my makeup was completely done, I did notice my face did not get as oily as it usually does. After reading some tips on others' reviews I sprayed this on my face pre-foundation, then again after foundation, then again after powder (1 spray each time) and I noticed even less oil on my combination skin mid-day. In hot, humid Texas weather (103 degrees plus 90% humidity...) you need something to help your makeup last instead of melting/sweating off and this was pretty decent. I also like that it's oil free. I also ordered MUFE mist and fix to go but it hasn't arrived yet so I'm not sure how the products will compare (although that one was cheaper for the travel size-and I'm a huge MUFE fan, I use their waterproof matte foundation and concealer). And P.S. the spray didn't make my eye makeup run."
      },
      "amycayxo":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Apr 2014",
         "title":"best setting spray",
         "description":"I spray this over my makeup at 7am, and when I'm leaving work at 5pm, my makeup is the exact same as it was 10 hours prior. I started with the smaller bottle just to try it out, but since I'm so pleased with the results, I'm definitely going to be getting the bigger bottle!"
      },
      "Emmy1386":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Jul 2014",
         "title":"amazing stuff!",
         "description":"Really works! Kept my makeup from slipping off all day on a hot summer day! Will definitely be repurchasing."
      },
      "mqlyn":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"18 Jun 2019",
         "title":"SMELLS LIKE COCONUTS",
         "description":"At first I really smelled nothing, but the more that I used it the more that I noticed the coconut scent and I AM IN LOVE.\n\nI love the smell of coconuts and this smells just like it. I hope they keep this forever or reproduce them every summer because, YA GURL is gunna keep purchasing this one!\n\nSince the original one smells like sneeze lol.."
      },
      "Vampira510":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"1 star",
         "date":"10 Jun 2019",
         "title":"best setting sprays I’ve tried,Has the same smell, if anything it has a summer faint smell that ever so slightly can be noticeable but faints away so fast.... 5 stars cause it’s a incredible setting spray but 1 because it’s the same smell ....",
         "description":""
      },
      "Sweetpea329":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"16 Nov 2017",
         "title":"EXCELLENT",
         "description":"This product saves my makeup all the time. I always tell people to purchase this because when I had a wedding last July, I was drenched because the ceremony was in the sun; and even though I was sweating, my makeup stayed in place and didn’t budge. I️ definitely credit the all nighter setting spray for that! 4 instead of 5 stars because it smells a little funky, but it’s a great product!"
      },
      "ZoeBoyd":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Jul 2016",
         "title":"ignore the bad reviews",
         "description":"literally I don't get what all these people are talking about saying how it doesn't work. this product is literally amazing. \n\nlike I don't know how to describe how much I love this. basically I got this because my makeup never lasted and I was so annoyed that by the end of the day my makeup would be completely gone. I had been wanting to get this for a very long time so I finally got it 2 weeks ago. my makeup still looks perfect after hours of wearing it throughout the day. and I live in Texas so lemme tell you it gets hella hot here in the summer.\n\nbut this product is guaranteed to make your foundation last all day. I highly highly recommend this!!!!!!!"
      },
      "1SultrySCENTNut":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"25 Sep 2014",
         "title":"UD - ALL NIGHTER !!!",
         "description":"This is a wonderful product by UD that I always try to keep on hand. I have used many other brands, some cheaper and some that are way more costly, but I decided on a whim to try UDsALL NIGHTER and I prefer it overall of the many othersI have tried. I do not have oily skin so it gives my skin the perfect balance and keeps it from drying out, like many of the other brands that are made to work for combination / oily skin. It comes in different sizes and has one size , for an awesome price, that fits into my one makeup case perfectly. ( I have an issue finding products , other than makeup, to fit in any of my cases due to the amount I have on hand because of my freelance makeup work that I am currently engaged in and my other cases for my personal use ) My clients preserve the KVD Brand but I love te UD, it is silky soft on my skin and it has held my makeup on for over 17 hours before in an emergency ! Please keep this one in stock!"
      },
      "VicketteH":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Apr 2013",
         "title":"Best finishing spray",
         "description":"I have super oily skin, I used to use Dew Me but the All Nighter is waaaayyy better! Sets beautifully!"
      },
      "RockyP10":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"4 Mar 2017",
         "title":"Works well but bad smell",
         "description":"This setting spray does a great job of making my makeup last all day. However, the product does not smell pleasant. The smell goes away about 10 seconds after application."
      },
      "jroads":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"5 Jul 2015",
         "title":"Must-have",
         "description":"This stuff is magic. My oily skin and eyelids are a recipe for melty makeup within 8-10 hours, and just a couple of spritzes of this keeps melty face at bay. For about a minute or so it feels wet on your face; just don't mess with your face for that time and then you're good to go. Thanks again, UD!"
      },
      "Lulu182":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"18 May 2016",
         "title":"Must!",
         "description":"I love this stuff!!! Have been using it for quite a while and got my mom into it and she loves it now, too. We can really see a difference in our make-up longevity. The mist/cooling sensation is a nice treat, too.\r\n\r\nI will continue to repurchase this item- I use it almost every day!"
      },
      "CndnNat":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"24 Jun 2014",
         "title":"Love it",
         "description":"Easy to use and works so well. My wedding makeup did not budge one bit."
      },
      "Tee27":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"9 Jul 2014",
         "title":"Can't live without this!",
         "description":"I use this product to set my makeup everyday and haven't found anything that works better. I usually use 3-4 sprays on my face making sure to get each eye and I've found that my eye makeup stays in place all day without the usual eye shadow build up in my crease. My foundation also holds fairly well which is fantastic considering I live in a humid place. It doesn't make my makeup run if I accidentally get too much on my eyes, which is nice.\nI also like that it's cool and refreshing which is nice in the morning."
      },
      "Swopie":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 May 2016",
         "title":"Amazing! Amazing! Amazing!",
         "description":"I have sensitive skin and have always struggled to find the right products that give me the flawless coverage I want that doesn't fade or rub off after a few hours. I work 15 hour days and I can honestly say that when I use this product after I've applied my makeup it looks just as perfect at 7pm as it did when I applied it at 4am. TIP: apply your mascara AFTER you've set your makeup with this spray or you'll find your mascara all over your under eye. \n\nYou will NOT be disappointed with this stuff!"
      },
      "driftergirl":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"22 Sep 2012",
         "title":"I'm a convert!",
         "description":"I bought this on a whim and am now a true believer. This product distributes evenly in a fine mist that dries in seconds and never feels sticky, tight or like it's even there. As a menopausal woman sweating in my riding leathers and helmet; I thought I'd give this a try so that I might still look good or at least have my eyeshadow in place by the time I got where I was going on a hot summer day. This stuff is amazing! I sweated, but my makeup never budged no matter how much I dabbed under my helmet and I looked good even once I got home. the next day. Once I stopped perspiring, my skin stayed dry to the touch and I didn't need a touch up all night. A steal at twice the price!."
      },
      "casadeeya":{ 
         "extra_info":"<b>Skin Tone</b> Light",
         "stars":"5 stars",
         "date":"7 Apr 2016",
         "title":"Keeps Makeup Put!",
         "description":"I am not very oily so before using this setting spray, my makeup would stay put during most occasions. However, it would start running in extremely warm environments.\r\n\r\nWith this setting spray, my makeup does not move at all and it lasts all day! Like 24 hours all day. It does have a chemically smell but the smell quickly fades. It reminds me somewhat of a cooking spray but for your face. Despite that, I continue to use this every day and it does not break me out!"
      },
      "cucchiella":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"15 Mar 2016",
         "title":"This stuff rocks! I wear glasses, and when I use this spray to set my makeup, I have absolutely NO transfer on the bridge of my glasses, or the lenses. Will never go without this spray!",
         "description":""
      },
      "TopSyCurvEE":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"2 Apr 2014",
         "title":"Not as Advertised",
         "description":"So this product boasts a \"just-applied\" look for up to 16 hours. I didn't even get 3 hours in to my look before shine reared it's ugly head. I've attempted quite a few different application methods and products, and none get me anywhere NEAR the 16 hour mark that Urban Decay claims for this product. I would not purchase this again. I would not recommend to people with GENUINELY oily skin who are looking for something to cut down on the shine."
      },
      "udaddict88":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Aug 2011",
         "title":"LOVE it! it STAYS!!!",
         "description":"I bought this because I wake up about 7 in the morning, go to work and school and don't get home until midnight. So, I needed my make up to stay put. THIS WORKS. My make up is perfect all day. I've also gone swimming, and I don't sweat my face off when I go dancing! BEST INVESTMENT EVER!"
      },
      "IAmTenYen":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"16 Feb 2016",
         "title":"I knew this would definitely help keep my make-up in place and on for longer but the first day I wore it was during an Aussie summer day walking around the hot city for hours on end and everything remained in place. I was honestly amazed.",
         "description":""
      },
      "HollyeG":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 May 2015",
         "title":"Puts my makeup on lock down",
         "description":"I've been using this setting spray for years. I've tried others but always come back to Urban Decay. It's a very fine mist that doesn't break up my makeup. I'm a nurse and I work long hours and my makeup always looked patchy by the end of my shift. But when I use this my makeup lasts all 12 hours and doesn't budge. This is a holy grail item for me."
      },
      "chazee":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"4 stars",
         "date":"13 Nov 2015",
         "title":"Keeps my makeup looking great!",
         "description":"It is fall here in Maine, so the weather is cool, and not humid. So, I don't usually have too many issues with my makeup budging this time of year. However, it does keep my makeup looking good all day and night long. I am looking forward to testing this product out in the dead of the summer next year. I will buy this product again."
      },
      "MonaAhmed":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"7 Feb 2017",
         "title":"New Formula",
         "description":"I have been using this for years and the product does do a great job setting everything in. However, the recent change in the past few months has altered the scent because I cannot bring myself to use it anymore. The scent is really sour now and it lingers on your clothes, hair etc."
      },
      "mu4eaddict":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"6 Mar 2011",
         "title":"Fantastic life-saver",
         "description":"I am amazed at what this product does. I am a professional dancer, and I typically dance for several hours in a row during gigs. In the past, I've always had to reapply my foundation and bronzer throughout the night--especially on my temples where I sweat a lot, and thanks to this stuff I rarely have to do that anymore. I believe this product even makes my lipstick last longer. Just a few spritzes of All Nighter, and my makeup stays on all night long. Fantastic!!!"
      },
      "Toasterghost":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Oct 2016",
         "title":"Worth the hype!",
         "description":"I got the travel sized version of this since it's a product I'd never tried before.\r\nIt's not cheap but it's totally worth it, I wore it to a wedding and it held my make up ALL DAY. \r\n\r\nMy mascara smudged a little but that may have just been from tearing up at the wedding ahaha.\r\n\r\nIt also very light weight, it's not sticky and it didn't make me break out so it's good for sensitive skin!\r\n\r\nI'll be buying this again!"
      },
      "aplxtt":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"13 Apr 2017",
         "title":"Not the same formula at all",
         "description":"I've been using UD's All Nighter religiously for over two years now and I swear by it. But... I ran out two weeks ago and went to buy a new one and it was a totally different bottle. No biggie, they said it was the same with a different look. So I bought it and when I went to use it.. oh my god the smell is HORRIBLE and it stays with you the whole day. My boyfriend even commented on how my face smelt awful when I saw him later that day. I definitely don't think that this is the same formula at all either, it's way more dewy than the old formula. Ugh. The smell is unbearable and it's SO noticeable it doesn't go away. I am returning."
      },
      "NurseMel":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"25 Apr 2016",
         "title":"amazing!",
         "description":"Worth every cent. Having oily skin and suffering from occasional breakouts, maintaining coverage is important to me. This stuff has been though the ultimate tests- kept my face in place through 12 hour shifts (I'm a nurse) and a hot, outdoor Texas concert. Will continue to buy."
      },
      "DeniseDM":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"19 Jan 2015",
         "title":"Must have",
         "description":"We all heard how amazing this product is & guess what..IT'S ALL TRUE! This product indeed does EVERYTHING it says. Make-up stays on for hours all the while it has such a smooth flawless finish. It's the last step in my routine which starts with Sephora perfecting primer & Sephora 10 hour foundation. This review is short & sweet as this product sells itself. Will rebuy & highly recommend."
      },
      "rebecca1989":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Jun 2015",
         "title":"Works like a charm",
         "description":"I had been having problems with my makeup looking ick by the time lunch rolled around and was also investigating products to use to DIY my makeup for my wedding. I read about this on a bridal website and decided to give the travel size a go. It's now a staple in my makeup bag as it allows your makeup to stay on through pretty much the whole day. I don't know about 16 hours, but it's very good. Feels very refreshing to finish off your makeup with this spritz and brings your whole look to life by adding a perfect dewy (not oily looking) finish. I recommend applying prior to finishing off with mascara, as it can make your mascara transfer immediately after applying."
      },
      "DMD03":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"30 Jun 2010",
         "title":"i didnt notice a difference. kind of dissapointed since i had high expectations with this product.",
         "description":""
      },
      "lynds3":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Sep 2012",
         "title":"Definitely a fan!",
         "description":"I've tried the Make Up For Ever Mist and Fix but I most definately prefer Urban Decay All Nighter. Keeps everything put all night and makeup stays looking fab!"
      },
      "Jeg5190":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Dec 2015",
         "title":"Everything I was hoping",
         "description":"I'm a nurse, and can rarely get through a 10-12 hour shift without my makeup melting away. At the end of the night I would get home and be so disappointed that my expensive make up just couldn't hold up. I've been spritzing this on my freshly made up face every morning for the last week, and can't believe the difference it makes! I was worried that as a liquid, this would add oil to my already slightly oily complexion, but at the end of the day my face looked practically the same! Definitely a great buy!"
      },
      "tisthebree":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Oct 2016",
         "title":"First Time Gold",
         "description":"I had never used a setting spray before this. I had heard that they're amazing, but just never wanted to spend the extra money on something I thought was so trivial.\nThis was until I started wearing a full face of makeup and realized that my glasses completely rubbed off the entire portion of makeup that they touched. I'm very pale with extremely red spots. Which means that my entire nose would be bright pink and the rest of my face would be an average skin color.\nSo I bought the travel size of this to test out. And I seriously ran out after about six uses. I went setting spray crazy!\nIt helped to prevent so much foundation rubbing off of my nose! It didn't completely eliminate the problem, because I have a tiny nose and large glasses. So it's inevitable. But this was an extreme difference. Buying the full size immediately!"
      },
      "raiiraii":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Aug 2016",
         "title":"holly water",
         "description":"I live in Texas were its hot all the time! And I sweat any time I'm out side this setting spray prevent me from getting oily even if I sweat I love it!"
      },
      "Lmoaga":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"24 Apr 2015",
         "title":"Will be repurchasing! Makeup stays on all day because of it, gives my face a fresh feel after I apply it. You need this in your life, purchase it girl! You will not be sorry! Try the smaller size if you're skeptical, I did and now I will buy the larger size",
         "description":""
      },
      "kealeyok":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"11 Sep 2017",
         "title":"YOU NEED IT",
         "description":"This product made my makeup last through the day, and when I had sex later that day. If that doesn't make you want to buy it I don't know what will"
      },
      "LilyMullaly":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"3 Oct 2016",
         "title":"Yo I just cried for 2 hours straight and my makeup still looks flawless 10/10",
         "description":""
      },
      "SpikesAndShells":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"28 Jan 2014",
         "title":"Womp womp",
         "description":"I really wanted to like this, especially after the amount if money I spent on it. Unfortunately, I don't think this product works very well. A few hours after application, I find that my makeup is still in need of the same amount of touch ups. I just don't think it does what it promises, which is a shame, because it would be awesome if it did. I'll probably keep using the bottle until it runs out, though, just to feel like I got my money's worth."
      },
      "jennyjennjennb":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 Dec 2013",
         "title":"Really does last all NIGHT long",
         "description":"i use this daily i finish my makeup around 630am and take it off around 830pm, and that includes a lunch gym visit. It really makes a difference on the lasting time of my makeup wiht and without this. i never ever run out, i always have a back up. :)"
      },
      "beautybabexo":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"4 stars",
         "date":"25 Jan 2011",
         "title":"Just what the description says!",
         "description":"Honestly, these days on youtube you can never completely believe a review a guru gives, but when I heard about this product I was instantly drawn to it. My makeup stays all day long from when I put it on at 5:30 in the morning to when I come home at 3 from school, looking the same as it did in the morning. The only place I feel like it doesn't stay as long is underneath my eyes, but I'm sure that's only because I don't focus the spray there. I spray it 3 times but I don't feel like it's enough to cover my face. The smell is kind of like baby powder but only stays while you're spraying. It absorbs fast and does not feel heavy. It even makes my makeup look better, particularly my foundation.\nThe only thing I'm suspicious about is that my acne has gotten a little bit worse, however I'm unsure whether this is because increasingly worse stress or this product. However, I'm pretty sure it's the stress, but I'm just putting it out there."
      },
      "MissLC":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"18 Jun 2014",
         "title":"Refreshing",
         "description":"I use this every night when I know I'm going to have a long night and it holds up pretty well. When sprayed it dries fast and feels super refreshing. Iv'e cried and my makeup held up pretty good."
      },
      "DebinPEI":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"3 stars",
         "date":"15 Aug 2016",
         "title":"Not sure",
         "description":"I have purchased this many times and do use it when I work long hours or the weather is hot or humid but I am just not sure if it really works. I don't find my makeup lasts any longer, but maybe it looks a little better at the end of the day.  Its like I believe I need such a product to lock things in but really hard to say if it really makes that much of a difference."
      },
      "MM187":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"3 stars",
         "date":"18 Nov 2017",
         "title":"I like how it prevents my make up from sliding off throughout the day. The old packaging I gave it 5 Stars because it was my go-to/holy grail and there was no scent at all. This new one has a weird, funky, almost like a musty smell to it. Not digging that at all. Get rid of the smell... PLEASE!!",
         "description":""
      },
      "katiepotatie":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"22 Feb 2014",
         "title":"really does work",
         "description":"I am kind of astonished that this thing does what it says. I don't even really know how to describe how it feels when I spray it on - it's like it seeps through all the layers of my make up - highlighter, blush, bronzer, concealer, foundation - and fuses them together to form one layer of makeup that won't move. It also makes it look more natural and skin-like, if that makes sense; it removes the appearance of cakiness on my face. I also can't feel it once it dries, it's completely weightless.\n\nI can't say it lowers the temperature of my makeup, and I haven't worn it in hot temperatures, but it's working during these frigid winter months and makes my makeup last all day. Will buy again and won't go a day without using it."
      },
      "nycchik":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"30 Sep 2012",
         "title":"It Works!",
         "description":"I tested this product on an overnight flight- I needed to be fresh for a long day. I was pleased to find out it worked. I did my eye makeup before leaving for the airport and sprayed this on (lashes and all) and was impressed when I checked on my makeup prior to de-planing. The real test came in the morning sunshine when someone remarked that my makeup looked like I had just applied it! I won't go through a longer-than-usual day without it."
      },
      "lesliejo":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"28 Oct 2012",
         "title":"Where Have You Been All My Life?",
         "description":"This stuff is wonderful. I have normal/combination skin that turns shiny after a few hours of applying makeup. Not with this product. I use it after applying my tinted moisturizer, before I apply setting powder. My makeup looks fresh six hours later. If I use powder foundation, I just spray on after application and perfection. Please never stop making this."
      },
      "karinc":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"23 May 2014",
         "title":"Fantastic for oily skin",
         "description":"This spray makes my makeup last through a double shift waiting tables outdoors AND I have oily skin. I love love love this thing."
      },
      "KatyJune":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"21 May 2014",
         "title":"You Get Exactly What It Promotes.",
         "description":"I've only used setting powder but decided to switch it up and try a spray. This is absolutely worth every single cent you spend on it. It dries quickly and my makeup stays put! I even rode on the back of my boyfriend's motorcycle and when I got off it still looked like I had just applied my makeup!"
      },
      "nannan82":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"18 Feb 2014",
         "title":"breaking me out badly",
         "description":"I don't know why this is so hot now, but it certainly not my type of tea. it breaks me out badly that I first thought it was my skin care regime, but then I realize it was this product.\nI would never purchase this again."
      },
      "dancinginair":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"31 Aug 2016",
         "title":"Must Try!",
         "description":"I went from using no setting spray, to trying this and my makeup STAYS. Went to a baseball game in the middle of the day, and even though I was sweating, my makeup didn't budge. Truly a great product."
      },
      "LylaJane":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"23 May 2014",
         "title":"Definitely long lasting, but a bit too shiny.",
         "description":"This stuff really is incredible because my make up does not budge, even when I've been at work for 12 hours. However, I have a big problem with my oily skin (most of my make up is oil-free, matte, etc. to try to combat this problem)... and this stuff makes me look SOOO shiny, even when it's still the beginning of my day. I look like I've been sweating! To fix this problem, I use MUFE's setting powder in combination with this stuff, and it's a great combo - lasting make up (which the MUFE powder doesn't do on its own) and no shine. Just something to think about if you already have shiny skin like me!"
      },
      "JoyMix":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"3 Jul 2014",
         "title":"Oily Girls-Listen Up!",
         "description":"The Secret:\nIf you have oil control issues, use any of the UD setting sprays not only before you powder but AFTER YOU POWDER THE HECK OUT OF YOUR FACE! Don't worry about too much powder.\nAnd not just a little spray, either. Use 3 sprays-left, right, center to keep your face beautiful and shine free the rest of the day. I swear by it!"
      },
      "juneau":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"8 Dec 2010",
         "title":"Amazing!",
         "description":"I purchased this product hoping it would keep my makeup fresh all day and Wow! Even in the high humidity of the Deep South my makeup stayed put all day and still looked great when I was ready to take it off. It even stood up to a night (5+ hours) of dancing. Great product!"
      },
      "cmere":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"6 Oct 2015",
         "title":"A DREAM",
         "description":"I was hesitant to try this– I had tried setting sprays before and they didn't seem to work. I have fairly dry skin, but when I start to sweat, I sweat... a lot.\nBut this miracle spray keeps my makeup in place! Even through dancing, even if I'm dancing cheek to cheek with someone else.\nDon't know what black magic was done to infuse this spray with such power, but I definitely recommend you take advantage of that magic."
      },
      "mannella":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"4 stars",
         "date":"14 Nov 2010",
         "title":"make-up setting spray",
         "description":"I usually buy the Make-up Forever brand and was disappointed when the Novato store was out of it. The VERY helpful clerk suggested I try this and it does work really well. I was in a meeting in a room that was hot and stuffy and my make-up stayed in place."
      },
      "kelsreneee":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 May 2016",
         "title":"MATTEfaceLOVE",
         "description":"Always had oily/combo skin and can't believe I've never tried this until 5 mos ago! I don't know how I EVER wore makeup before using this! I take meds that make me sweat and this keeps everything nice& tight, in place and-NO shine!! I could wear a full face and workout and STILL not worry about sweating ANY off!!!!!! L.O.V.E."
      },
      "Kitten7273":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"1 Jul 2013",
         "title":"Good Makeup Staple!",
         "description":"This setting spray was a first time purchase for me by one of the sales associates at my Sephora location. I teach/dance salsa and sweat quite a bit and I mentioned while shopping that I needed something to try and control the streaky mess my eye makeup becomes after dancing. It works very well unless you get it in your eye (which I did) and it stung very badly and I needed to begin my makeup all over again because of the tears! As long as you do not spray it in your eyes on accident you should be good to go!"
      },
      "Bobcatred":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"1 star",
         "date":"3 Sep 2017",
         "title":"I couldn't get past the scent",
         "description":"After all the raving I heard about this on social media I was sure this had to be THE setting spray. Unfortunately I'll never know because I just couldn't get past the very strong scent long enough to spray it in my face. It has some sort of a sweet spicy scent that mixed with the chemicals that make it work just didn't do anything good for me. Like perfume, I think this is a matter of personal taste and would probably be fine for some."
      },
      "Alaskahuh":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"21 Dec 2016",
         "title":"Works, Smells Bad",
         "description":"I keep trying it over and over again, I was not planning on repurchasing but I received it as a gift. It works well, makes makeup last a long time, but applying it is a nightmare. The smell is terrible and I can hardly breathe when spraying it.. I would suggest smelling it before paying the full price. It is really hard to get past the smell despite how well it works at both setting my makeup so it lasts all day, and giving my skin the boost of hydration it needs."
      },
      "aeriha":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"31 Jan 2015",
         "title":"Stay put most of the day",
         "description":"I like that product, it's not \"blowing you nose\" proof but it does a great job and my makeup does stay longer. Heard that L'Oréal's Infallible one does the same job for half the price, maybe I'll check that one too."
      },
      "xodrpickles":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"21 Jun 2014",
         "title":"Hmm...",
         "description":"I don't know if this was just a case of too much bronzer, but my kat von d foundation usually blends well into my skin and though this spray made my makeup last significantly longer - it turned me orange! I have brown skin and I was horrified; my boyfriend was the one who had to tell me. I'm not 100% sure if it was the spray, but I have never had this issue before. I'm going to try going down a shade in foundation and also again with less bronzer to see if that might've been my issue. Kind of disappointment but at least it made my makeup last! I will repurchase if I find a way to stop it from oxidizing on my skin."
      },
      "heynatalie":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"14 Nov 2014",
         "title":"Love this stuff",
         "description":"I think i'm on my 6th bottle. Once you start using this spray it's hard to stop. Some people mentioned that it makes your face cakey but I disagree - if anything, it makes your makeup look less cakey. I find that this spray does extend the wear of my foundation, blush, bronzer, etc. It doesn't feel sticky, and dries quickly. When i'm finished with my makeup, I like to tilt my head back and spray this product above my face at the distance recommended by the bottle. This ensures i'm not wasting product. Despite my love for this product I don't think it's impressive enough to be so expensive."
      },
      "spcouture":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"16 Aug 2017",
         "title":"Pleasantly surprised",
         "description":"I have heard so many people talk about this spray but I always ignored it because I have never found a setting spray that makes a difference. I finally decided to give it a try and i was shocked but how well my makeup lasted! I tried it a few more times to make sure it was the spray that made the difference and it was as I paired it with a couple different conditions! I have an oily T zone and this worked so well. I would give it a try!"
      },
      "danao":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"2 Nov 2010",
         "title":"Must Have",
         "description":"I have very oily skin, and even with a shadow base, my shadow tends to clump and slide away. This stuff is AMAZING. My eye make up doesn't move for at least 10 hours. at 16 hours it's just barely faded. I don't wear foundation though, so I don't know how it works on face make up. I would highly recommend this to anyone who wants to keep their make up on!"
      },
      "Serg96":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Jul 2014",
         "title":"SPECTACTULAR",
         "description":"I am a man who wears make up & I have the MOST oily skin you will ever see in your life. After 20 minutes my T zone already is shiny after primer, foundation, and powder. This product answered my prayers. It literally holds my make up in place for HOURS & makes my skin look extremely smooth. My pores were nearly invisible and I have acne prone skin. I was so amazed and could not believe my eyes when I came home after a 9 hour day and my skin still looked amazing."
      },
      "allybebz":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Jun 2014",
         "title":"WOW... THIS STUFF IS LIKE CRACK FOR YOUR FACE!",
         "description":"UD knows how to make setting sprays. I have gone through bottles of these and I cannot complain about a thing! It is the best setting spray out their and I honestly think that this original all-night works better than the de-slick (oil-control) spray, which is strange. I find that my makeup stays on better and longer on my face when using this all-nighter spray. If I use this before going out let's say around 5/6pm in the evening.. my makeup would still be on until 8-9am the next morning, which is insane. I know it's bad to leave your makeup on during sleeping but I wanted to test it out and see how durable and long-lasting this spray actually was and it does live up to the hype! Go get this crack spray and mist it all over your face! Your selfie photos will thank you!"
      },
      "mimilynne143":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"11 Feb 2016",
         "title":"Amazing",
         "description":"I went to Sephora to do my makeup and I put this on walked out came home to a stressful situation only to find out after 20 tissues that my makeup stayed on perfect as if I hadn't cried buckets. Truly amazing and made me feel a lot better once I was done crying that it actually works!"
      },
      "Malak2014":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"2 Oct 2016",
         "title":"loving the results",
         "description":"I have been using this for a couple of months and I love it holds my makeup all day and I have an oily t-zone even in hot humid weather!!!!!"
      },
      "Sunami26":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Sep 2016",
         "title":"it's a must!",
         "description":"Love this product so much! It's amazing at doing its job, I have dry skin problem, but that hasn't been an issue with this. It takes about 15-20sec to dry (in front of a fan), and once it's dried u can't even feel it on ur face. A"
      },
      "sgrl23":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"8 Jun 2017",
         "title":"Really Works!",
         "description":"I first purchased the \"travel size\" bottle of All Nighter directly from UD when they had it for 40% off a few months ago (probably to sell off \"old stock\" just prior to launching the new packaging). I liked it so much, that I've since purchased two more full-size bottles while on sale for $18. The sale price was a big incentive, as was the opportunity to get it in the old packaging; reviewers have complained that the product now has a bad smell (from the new packaging???).\n\nI really wasn't expecting much from the All Nighter spray, but with so many positive reviews, I figured it might just work. It exceeded my expectations! My makeup looked so much fresher, and for so much longer after using it.  I knew to spray it BEFORE applying my mascara (reviews, included instructions), forgot to shake the bottle the first few times I used it, but it still helped keep my makeup looking good (but it works even better after shaking before use!). \n\n*One side note: since I started using All Nighter, I've also been using NARS mattifying primer just on my nose or sometimes my entire t-zone as well (still using my old NARS Radiance primer on the rest of my face), and the combination of these two products has greatly improved the staying power of my fave NARS Tinted Moisturizer on and around my nose. Even my new GA Luminous Silk foundation, which didn't break down nearly as quickly (as the tinted moisturizer), holds up even better."
      },
      "MaxwellElliot":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 May 2017",
         "title":"I really love it",
         "description":"it keeps everything in place so beautifully, and it smells frickening amazing! it smells like real coconuts, not like perfume.  it has 0 perfumey smells, it just has a hint of coconuty scent"
      },
      "steph18":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"12 Dec 2013",
         "title":"All nighter- does the job",
         "description":"I like this spray. I do think it helps make-up last longer. I'm not sure if it lasts \"all-night\" though. More than if I didn't use it. That's why I am giving it 4 stars. It's weightless and doesn't have a strong smell. I recommend this product."
      },
      "DeepikaGlow":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"12 Jun 2019",
         "title":"Love It!!",
         "description":"Love the smell! Nice and light, smells like summer. Same amazing formula, can’t live without All Nighter!"
      },
      "gothshawty95":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"4 stars",
         "date":"30 Nov 2017",
         "title":"Simply the best.",
         "description":"It’s incredibly hyped for good reason. It does what it’s supposed to - set & lock your face for the entire day. I’ve had drunken nights where I pass out at a friends house & wake up with my face still 100% there lol!! Only reason I knock a star off is because it’s LOADED with alcohol (which is the scent) so it can be drying with consistent use. I would say don’t use this back to back (imo you don’t need something this intense for daily use) & mature skin especially to stay awaaaay!"
      },
      "Angelina1985":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Oct 2015",
         "title":"Wow!",
         "description":"There really can't be any sort of placebo involved here because my routine powder touch ups have never been this low, ever! This stuff is no joke! I apply my foundation, spray this magic in the recommended 'T' and 'X' formation, then I wait a bit and finish off with some translucent powder. I have the OILEST skin ever, and it is also very acne prone, and this keeps my skin tight (in a good way) and matte. I also haven't noticed any extra break outs either. Why did I wait so long to try this?! I literally used to blot and powder my face at least every hour or two, but this fairy potion has cut that down to maybe two/three times per day (even the amount of powder needed has drastically reduced). One of my best finds thus far, game changer!"
      },
      "Liette17":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"10 Feb 2017",
         "title":"LOVE IT!!!!!",
         "description":"Amazing product would definitely recommend!!!!! Make up stays on all day and night. Great light feeling."
      },
      "Endeep":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"4 stars",
         "date":"4 Sep 2017",
         "title":"Good Product",
         "description":"It's a good product and does what it's supposed to do. I still miss the old formula and packaging though. For some reason, the mist kind of makes weird patterns in my foundation on my chin. As a result, I HAVE to use a beauty blender to pat this product down onto my skin after spraying. After that, everything is fine. I still get oily in a few hours, so I have to complement this setting spray with my Mac blotting powder."
      },
      "emilyy0115":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"31 Jul 2014",
         "title":"Love love love.",
         "description":"I work in a salon in the hear of Florida and I'm always hot. This product keeps my makeup perfect after sweating all day long."
      },
      "pwilkerson":{ 
         "extra_info":"<b>Eye Color</b> Green",
         "stars":"5 stars",
         "date":"13 Jun 2019",
         "title":"Beach in a Bottle",
         "description":"I LOVE this stuff! I've always used the original and it's great - really does work to keep makeup long-lasting, but this new fragrance is AMAZING! It's summer in a bottle and not in the fake, fruity way - this does smell like sunscreen so if that's not your jam, you may not like it but I think it smells like a day on the beach. I've already used it multiple times in Texas heat and it works just as well as the original. I was worried the added fragrance would break me out and no sign of that either!"
      },
      "BelleAllure":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"2 stars",
         "date":"22 Jun 2017",
         "title":"good and bad, won't repurchase (Combo skin)",
         "description":"Please read through for a detailed, thoughtful review of my personal experience. I have been using this spray, the older white bottle version and it seems to work on and off. When I spray it on top of the liquid foundation, (including powder, contour powder highlight blush and everything), it seems to cause my make up to cake up. At first I thought it was my other products, like a cakey foundation with a bad formula, or a cakey powder that is not milled too fine, but it kept happening over and over again. I am the kind of person who has switches up and tries different foundations (but I do give my skin a few days on one product to get used to it etc.) and I do not spray too much setting spray like beauty Gurus who like to shower in it. So for UD spray to cause me this cakiness within a few hours of start wear time, I am not satisfied with it as a setting spray. So I am keeping the bottles I have and will try to use with light make up application and to wet brushes, I just won't use on top of everything. Finally, I would say this product does not work for the purpose it is made for and does not do what it claims, but I could use it in different ways. I will not repurchase."
      },
      "ashleybo661":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"14 Nov 2014",
         "title":"One of my my favorite products . I have no issues with break outs with it and my makeup is flawless all day/night",
         "description":""
      },
      "brokeashellally":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"28 May 2018",
         "title":"Handled my breakdown like a champ",
         "description":"Idk what they put in this but i know its some black magic or whatever. I got my feelings hurt and cried like heavy crying and using multiple tissues then after i see my makeup just like stayed on for the most part im shocked i even have any on, urban decay u a real one thanks boo"
      },
      "LoDC87":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"19 Oct 2012",
         "title":"This stuff is awesome!",
         "description":"I have never written a review for anything, but i read them all the time so i felt like for this one item i should contribute - its one of the best products ive ever bought! I have really sensitive skin and it breaks out or gets irritated pretty easily so i was hesitant to try - but this didnt upset my skin at all! I use LM tinted moisturizer and then add 3-5 sprays of this and it literally makes the sheer coverage of the moisturizer last until after i get home from a long day at work. I dont have to reapply my tinted moisturizer midday anymore, even though usually my skin can get some what oily as the day goes on, but this stuff keeps make up in check. it also keeps my eye make up looking like i just applied it for 8-12 hours. feels a little weird at first when you spray it (like you just spritzed water on your face) but it drys to a perfect matte (but not cakey or patchy) in seconds. everyone should own this."
      },
      "laurmcm":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"2 stars",
         "date":"30 Sep 2013",
         "title":"Disappointed",
         "description":"Sadly, this just didn't work for me. I'm not sure why either. I heard such great things that I decided to buy again (I actually had it when it first came out and never repurchased until now) The old one worked great, but my skin just couldn't get used to this one and gave me some minor breakouts. However, it did keep my makeup on."
      },
      "sammarie05":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"7 Jun 2016",
         "title":"best setting spray",
         "description":"Where I live it's hot and humid and with this setting spray my makeup stays looking good all day!"
      },
      "katery":{ 
         "extra_info":"error getting this field.",
         "stars":"3 stars",
         "date":"28 Apr 2017",
         "title":"Works awesome but THE SMELL!!!",
         "description":"I have been using UD's All Nighter spray for years and it has always worked amazing at keeping my makeup on all day.. however they must have changed something in the formula recently because the last two bottles I have gotten smell absolutely terrible!!! So much so that I hate using it and will be looking for a replacement asap."
      },
      "dtmm4":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"28 Jun 2010",
         "title":"Did not like the product, just made my face oiler.",
         "description":""
      },
      "kaida":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"9 Mar 2013",
         "title":"Works great with airbrush makeup",
         "description":"I use airbrush makeup, which is water based and can make your skin look a little dry. By using Urban Decay All Nighter to set my makeup, my skin looks amazing. I also use a primer for my skin and one for my eyeshadow, which probably helps too. I spray a little All Nighter on after using primer, let it dry and then airbrush on my makeup. After I've finished with my eyes, brows, cheeks and everything else - but before mascara - I spray it fairly liberally all over my face. Once it has dried, I apply my mascara. I suppose with a waterproof mascara, it probably wouldn't cause it to run, but it is too much work to clean up that mess and touch everything back up, so I've never tried it. I have skin that can get shiny pretty quickly and that never happens when I use this setting spray. My makeup lasts all day and stays looking fresh. I think it has helped my skin as well, because I am not touching up with a lot of powder or layering on more makeup all day long."
      },
      "hotcheetosxoxo":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"5 Jul 2016",
         "title":"I really to wanted this to work for me. After reading all the great reviews I was excited to try it. This made my skin break out. I got little bumps all over my face! It took me a couple days to realize it was the new setting spray that was doing this to my face. It was the only new product I had applied to my daily routine. They went away a couple days after I stopped using this. My skin is not sensitive I have never had something like this happen to me with any product.",
         "description":""
      },
      "clarah":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Feb 2016",
         "title":"greys anatomy",
         "description":"I watch greys on the daily, so obviously, I cry on the daily. I never appreciated this so much as when I sobbed over pulling the plug on **** and MY MAKEUP STAYED. My foundation and concealer and contour and eyeshadow and everything still looked flawless after sobbing uncontrollably for an hour, allowing me to go in public still looking flawless 11/10"
      },
      "omgsars":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"21 Dec 2010",
         "title":"This takes away any powdery look left after setting my foundation without adding too much moisture as my skin can become kind of oily. I also noticed my makeup holds up a lot better over my work day as I have a full time job, I don't even touch up anymore! Also this stuff rocks if you are going out to a concert or club, keeps you looking fresh and your makeup in tact. Another plus, it doesn't irritate my skin which can be sensitive and prone to break outs... Overall definitely worth a try!",
         "description":""
      },
      "magster":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"10 Aug 2010",
         "title":"All nighter AND All-day!",
         "description":"Used this for an outdoor/indoor wedding on myself, the bride and a couple of other bridesmaids. I sprayed the front and sides of the face for each girl. Other than lipgloss (which was expected) we didn't have to touch up even after 12 hours! By the time it was time to take it off, my makeup still looked beautiful.\n\nThe bride and I have dry skin and another bm who used this has combo/oily skin and it does seem to work for all our skin types. If you have really dry or really oily skin, the UD website has 2 other kinds of setting sprays you can choose from but I chose this one for our bridal party.\n\nGranted, it wasn't too hot or too humid or rainy outside so I have no idea how this works against the elements. Also, all us girls miraculously were able to hold in our tears (I suppose we were just too harried and busy to cry) so I also am not sure how this spray would hold up to that. But I know that using this definitely can't hurt--after all, I have never gone 12 hours without touching my makeup before--until I used this."
      },
      "femalehermit":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"21 Feb 2014",
         "title":"Belly Dancer Approved!",
         "description":"I belly dance and needed something that would keep my makeup on my face and not running for the hills when I sweat and perform. I love this product! It's quickly become a favorite with my friends and me for performances or a night of looking great. Non-greasy, doesn't burn, doesn't clog and sprays evenly."
      },
      "sabisfab97":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"23 Sep 2017",
         "title":"Fake it till you make it",
         "description":"I literally just took a 4 hour nap and ladies, we all know when we sleep with our make up on, it ends up on our pillows, blanket, sheets, etc: not cute. But I woke up and there weren't any stains whatsoever, which was quite surprising. I even checked the mirror and I kid you not, it looked like I just applied it this morning. I'm pretty sure this is sweat-proof too. I always speed walk to class (cause I take my sweet little time meticulously putting my make up on, as we are all familiar with the ritual) and end up drenched in sweat - I looked like I just ran a marathon. Thankfully, this spray holds my make up together and it prevents those heinous sweat streaks on my face from all the sweat dripping down from my forehead. So if it lasts through sleep and sweat, you gotta add this to your daily make up routine! I guess they don't call it *all nighter* for nothing, if you know what I mean ;) I also have a five page essay due tomorrow, so I'm basically pulling an all nighter myself. Maybe Urban Decay created this setting spray specifically for students like me that pull all nighters because they leave their assignments/studying till the last minute, procrastinate by writing a detailed Sephora review, and yet still want to look cute through all the suffering they're putting themselves through? Who knows, just get it and see for yourself!"
      },
      "vitaleyes":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"3 Jun 2014",
         "title":"Sadly Didn't Work",
         "description":"I tried this product on a normal work day. The outside high was 80 degrees with low humidity so I thought it was a good time to try it under fairly normal conditions. Somewhere between 8 and 10 hours of my makeup being on I noticed my makeup having a serious meltdown. Although I loved the way it went on, my face felt refreshed, not sticky, it just didn't hold up. My makeup meltdown worst than normal. I have normal combination skin."
      },
      "barbie420":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"16 Aug 2013",
         "title":"All Night Wear",
         "description":"The Urban Decay All Nighter Long-Lasting Makeup Setting Spray lives up to its name. If you want a flawless appearance all day and night, without the dull, fading appearance, then you need this product."
      },
      "tia305":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Sep 2011",
         "title":"love it!!",
         "description":"I purchased the sample/travel size of this product beacuse i didnt want to buy it if it didnt work, but it does!!! I love it !\nI put my make up on at 7 in the morning and at 6 I hit the gym and my make up still looks hot! Will buy again."
      },
      "aure":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"16 Feb 2012",
         "title":"Your makeup will last through almost anything!",
         "description":"A few spritzes of this product before you apply your makeup and after you've finshed putting it all on will keep your makeup on perfectly all day (or night), even through sweat and humidity. You don't even notice it's there. Though I wouldn't recommend sleeping in makeup I've woken up with a perfect full face of makeup the morning after partying when using this."
      },
      "alexlovesmakeup":{ 
         "extra_info":"<b>Skin Type</b> Combination",
         "stars":"5 stars",
         "date":"22 Apr 2012",
         "title":"All Nighter Setting Spray by UD",
         "description":"This product is remarkable! I brought it along on a camping trip and it kept my makeup on all day, through sweat and rain!!!! Now I use it daily. When you spray it on, it provides like a brief cooling effect and feels refreshing on the skin. I recommend it for people who do sports or are active during the day, or even dancing at night! Urban Decay also has other formulas so if you have oily skin or want a dewy finish, they have the right one for you, so check those out!"
      },
      "lovegeva":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"28 Dec 2014",
         "title":"LOVE IT!",
         "description":"Oh my god, I love love love this spray. It works wonders! Literally keeps my face looking fresh"
      },
      "kris0409":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"24 Jul 2017",
         "title":"love",
         "description":"Love this product! Definitely keeps my make up looking fresh"
      },
      "lizzagna":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Nov 2015",
         "title":"YASSSS",
         "description":"I have very oily skin. I've tried the Nyx setting spray and then the L'oreal Infalliable setting spray and bother were OK but didn't do what they claimed to do. I like a matte finish so with oily skin it can be hard to achieve. I was originally going to buy the travel size version of the UD all nighter setting spray but just went on a whim one day in Sephora and bought the original size ($30). I first tried it on Halloween and have used it everytime I've worn makeup since. It lasts so long! Yesterday actually I had it on for 11 hours and checked out my face and was BARELY oily and I didn't need a touch up or blot or anything. I highly recommend this if you have oily skin and are looking for something to help keep you stay shine free :)"
      },
      "Amanda199007":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"26 Jul 2013",
         "title":"Survived The Chicago Humidity!",
         "description":"Humidity in Chicago in the summer can reach the 105's and this little baby held my makeup all day and night! Just a quick mist of this in the morning after finishing my makeup and my face is set for the day. Helps to set my powder foundation wonderfully. Does not make my dry/combo skin oily or more dry. This also went with me on a recent vacation to Vegas and held up my makeup in place in the Vegas heat as well! Wonderful product. I do recommend waiting a few minutes after applying mascara to spray this as blinking while spraying this in your face can make your mascara smudge."
      },
      "applesfiona":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"5 stars",
         "date":"17 Jun 2019",
         "title":"I love this stuff. It keeps my makeup in place for 12+ hours, and I love the smell. It is a lot less chemically smelling than the original All Nighter.",
         "description":""
      },
      "cacao":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"24 May 2010",
         "title":"awful, super disappointed",
         "description":"Unfortunately I cannot give this product a 0 star because it is not just poor, as suggested by the 1 star, is totally inefective and pricey. Not only it did not hold nor set my makeup, it made my face sticky and shiney in a matter of seconds. I blotted my whole face after applying it but the weird and sad thing is that my cheeks, often dry and thirsty, were oily too; so my nose which by nature is an oil slick was disgusting. I went out and just came back and decided to write this review after looking myself in the mirror. I blotted twice in 3 hours, now back home I look at my eye make up and is totally washed out and drippy. My eyeshadow faded and my face --besides looking oily that is--looks like a map. After wearing this mist, my foundation just sat on my skin cells and I my whole face looks like an old map! I am returning this as soon as I can, I am so sad and disappointed, I really wanted to love this and thought it was a miraculous product, but it is not. I do not recommend at all."
      },
      "marythi":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"25 Feb 2013",
         "title":"It actually works!! Wayyyy better then deslick",
         "description":"I got this when I exchanged the urban decay \"De Slick\" makeup setting spray. It works soooooo much better! Don't get the deslick just because you have oily skin. I have super super oily skin, and the deslick did nothing! But this one is a miracle worker! It keeps my makeup on and keeps it from looking like its sitting on my oil slicked face by the end of the night. I spray this lightly on after my makeup application at 10 am and it's good to go until 1-2am! Def worth the price, for how much I don't have to use oil controls primers, blot papers or even my beloved translucent blot powders. Buy it! U won't regret it!"
      },
      "kimmytal":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"1 star",
         "date":"27 Jan 2017",
         "title":"Old is better than new",
         "description":"I've been using all nighter since it came out. Loved it! The new all nighter has a different smell. Awful. Smells like stump water. I returned the new spray to Sephora and they actually had 1 of the old version left. Thank God. Unless UD changes the new smell, I will have to find a new brand."
      },
      "emmiekat":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 May 2016",
         "title":"BEST.THING.EVER.",
         "description":"This is the makeup you didn't know you were missing and cannot live without once you get it.  Your makeup will stay on flawlessly all day despite any weather or sweating.  I took a shower to wash my hair with this on and didn't put my face under the makeup and when I got out of the shower my makeup was fine.  I cannot wait to use this all summer and not worry about the humidity.  I have already convinced two of my friends to buy it and we haven't looked back."
      },
      "aalyyusuf74":{ 
         "extra_info":"<b>Eye Color</b> Brown",
         "stars":"5 stars",
         "date":"8 Apr 2018",
         "title":"My face looks oily after 4hrs and I’ve tried everything. This is the best product I’ve used. My face looks flawless and makes my makeup look fresh. Love this product. This is my first review of any product cause I had to express myself and want others to at least try it. U won’t regret it!",
         "description":""
      },
      "daniellet82":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"22 Apr 2016",
         "title":"Amazing!",
         "description":"I used this product for the first time today and I am impressed! Never has my makeup stayed in place for so long. I have oily skin and I always have problems with my makeup separating and breaking up throughout the day and I'm going on 15 hours of wear now and my makeup looks almost just as fresh as when I applied  it this morning. I used a blotting paper twice today and that was it. No touch-ups needed. Usually I have to use blotting papers and additional powder throughout the day to keep my makeup looking somewhat ok. This product has far exceeded my expectations! I would recommend this to anyone."
      },
      "meghan95":{ 
         "extra_info":"error getting this field.",
         "stars":"2 stars",
         "date":"31 Mar 2017",
         "title":"the smell....",
         "description":"I've always loved this product. I recently ran out of my old bottle and loved it enough to repurchase. They must have changed more then just the color of the bottle because when I first used it I could not get over the AWFUL! smell. Not only does it smell when I spray it but it makes my skin smell terrible and it lasts! I honestly might be returning this product... I can't handle how bad this is. Why would they ever sell a formula with this odor??? I wish they'd bring back the old odorless one. Very disappointed.."
      },
      "LaraDoll":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 Dec 2015",
         "title":"The Best",
         "description":"Love love love this product.\n\nI have monolids and my eyeliner & eyeshadow crease throughout the day and this is a true holy-grail. My makeup stays on my face all day and I don't come home with racoon eyes. I've taken naps and my makeup remains flawless.\n\nI have SUCH oily skin and I truly believe that this product keeps my skin looking matte. My forehead isn't shiny and the corners of my nose are oil-free. I don't break out at all.\n\nI have heard mixed reviews and my friend told me that this product is bad for your pores but girl..... this is amazing for me."
      },
      "justiner":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"5 Nov 2013",
         "title":"Really helps makeup last all day. I have oily skin and work two jobs. Makeup still looks good at the end of the day!",
         "description":""
      },
      "mynameisSam":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"23 Oct 2015",
         "title":"Look inside your bottle!",
         "description":"I didn't dislike this product, it made my make up stay, but I only owned it for a couple months when I received a smaller bottle and went to combine them and the liquid had green mold floating in it. Absolutely disgusting. Buyer beware - I'd transfer to a clear bottle if you purchase this."
      },
      "alissamariet":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"14 Nov 2014",
         "title":"Helps Makeup Last for Oily Skin",
         "description":"I have never used a makeup setting spray before this one. I was weary at first, I thought a makeup setting spray would make me feel stiff or sticky, (why I don't use hairspray), but this stuff is great!\n\nI have really oily skin, which can be detrimental to my makeup. It can come off a little on oil absorbing sheets, and the oily-ness can cause my makeup to \"slide\" or \"melt\" off throughout the day. However, so far I have noticed that All-Nighter really makes a difference! My skin looks more \"glowy\" than oily, and I've actually barely had to use any oil absorbing sheets since I've used this product. My makeup also looks freshly applied all day; it prevents smudging and fading. I don't know what I'd do without this any more!\n\nMy advice would be MAKE SURE you are holding it the recommended distance away from your face -using this too close to your face would not be good and basically just get you wet. Also, even when holding the recommended distance away from your face, it's probably best to apply this BEFORE putting on mascara. I fan my face with my hands for a few seconds to dry, then apply my mascara. When I put my (not waterproof) mascara on before the spray, it smudged pretty badly. But waiting until after was perfect."
      },
      "mcald11":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"26 Aug 2016",
         "title":"MUST",
         "description":"Always keep this stocked on my vanity. People ask how my make up stays in place, THIS.\n\nI don't really have oily skin so idk if that makes a difference. Only in my t-zone after a couple hours, I just need to oil blot with a sheet once a day. I live in hot humid climate in the sunshine state. Make up stays put."
      },
      "KathrynGH":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Jun 2017",
         "title":"AMAZING PRICE FOR MY HG SETTING SPRAY",
         "description":"Wow! Get the old version, honestly it's so much better than the updated spray. I literally douse my face with this every morning and it makes my makeup blend beautifully together and makes it last all day. I just bought two full size because I can't get over the price. BUY IT NOW, you won't regret it. The older version also smells so much better than the new one for some reason."
      },
      "katsanc":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jul 2015",
         "title":"Lasts Forever!",
         "description":"Seriously I don't know one single person that hasn't told me that this doesn't make their makeup last ALL. NIGHT. I use it on myself and my clients and the feedback I get from everyone (of all skin types) is that this is magical. Must buy!"
      },
      "magda124":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"12 Oct 2011",
         "title":"Makes My Blush Stay Put :)",
         "description":"So cheapskate little me finally updated my makeup collection not long ago and as part of my little overhaul, I finally splurged on the very lovely Nars blush in Orgasm (sooo pretty!) Imagine my sadness when I started noticing the blush would barely last past lunchtime!\n\nSince I put my finishing powder before my blush in order not to diffuse the color, it just wasn't staying put. I had heard of this setting spray and clutching my wallet tight, I gave in and purchased it. And I'm glad I did. :D My cheeks now retain their Orgasm-y color till the bitter end (end of work day) and even after Zumba class at the gym!!! Worth every penny! :D"
      },
      "Batman24":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"13 Dec 2016",
         "title":"Love this setting spray! It makes my makeup so long lasting... I've gone swimming and most of my makeup on still!",
         "description":""
      },
      "tribetime14":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Jun 2014",
         "title":"AMAZING",
         "description":"Great product! Received multiple compliments within first 3 days of use. Not only makes your make-up last long it adds a really nice light flush to the face immediately after application. Have purchased both sizes and will re-order after empty. This is the perfect final step in every make-up routine."
      },
      "VIB21":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"5 Mar 2013",
         "title":"Worked for me!!",
         "description":"I tested this by applying at least 5-6 sprays right onto freshly applied makeup at approximately 8:00pm. I then wore it to a party that night and didn't remove it before going to sleep. I was also careful to sleep on my back that night. The next morning my makeup looked so great! It had a settled look, and though the eyeliner (Urban Decay) and lipstick (Lancome) needed some touch ups I was shocked at how well it held the base (Lancome) and blush (Lancome).\n\nI tried it again one late afternoon on makeup that had been applied early morning, and it had barely half the effect as the first time.\n\nI'd buy it again, but be careful to apply it on fresh makeup!!"
      },
      "betsymichelle":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"9 Dec 2012",
         "title":"Oil control is a no",
         "description":"I bought this with the in the hope that it would both keep my makeup on all day and control oil. After speaking with a sephora rep, I was confident it would do both. Unfortunately, it did little for my oily skin. On the plus side, my makeup didnt budge. It's great if you don't have oily skin and just want a setting spray! Reconsider if you are looking for oil control..."
      },
      "slebo1":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Jan 2015",
         "title":"love",
         "description":"I sampled this product in a Sephora favorites gift set and I loved it. I'm on my second full size bottle now. It helps my makeup last all day. I spray my beauty blender with it before applying makeup and I finish my makeup with a spray of it as well. It's a must have!"
      },
      "Keishla7":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Nov 2013",
         "title":"Glue for your makeup",
         "description":"This is like glue for your makeup. I live in a hot, humid place and my makeup usually just melts after a few hours, but this makes my makeup stay put until I take it off. This is perfect for parties, a long day of work or if your makeup doesn't stay on your face. Will most definitely repurchase."
      },
      "gmacattack":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"16 Feb 2016",
         "title":"I never tried setting products before so this was new to me it did what it said make up stayed on all day no creasing no fading I was very surprised great product",
         "description":""
      },
      "jamieloo":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"19 Jul 2012",
         "title":"This is no joke",
         "description":"A friend of mine told me to give this a try after showing her my blush only lasts for about an hour. You can prime your face but that is going to do nothing for the powder products you use over those bases. I spray this on my face after makeup and never ever have to worry about reapplying shadow, blush, or face powder. I go out confidently knowing I will look my best all day and night!"
      },
      "Jasachi":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Feb 2017",
         "title":"Your make up will seriously stay with this stuff. Always worth the price!",
         "description":""
      },
      "KatyCarol":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"7 Jul 2014",
         "title":"Great product",
         "description":"Does exactly what it says even in high heat and humidity in Texas. A light mist, no scent, can't feel it but makeup stays put."
      },
      "ngel":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"13 Oct 2013",
         "title":"Best Spray!!",
         "description":"I really love this setting spray! I received a the travel size sample of this about 2 months ago. I started to only use it to try on a normal day, then when I go out, and eventually I loved it so much that I began using it everyday!!\n\nI'm Asian, super sensitive, oily, acne prone skin and I will admit that this spray held my make-up together very well! What I loved most is how my face feels, and even my skin has improved.\n\nThe only reason why I gave 4 stars is because sometimes when I'm in a hurry and forget to cover my lips, I notice that it will dry my lips and the skin around it. Now it could just be because my skin is super sensitve, but all in all I would definitly buy this product again!! =)"
      },
      "k3ls3y":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"4 stars",
         "date":"24 Apr 2015",
         "title":"Used this for my sister's engagement photos",
         "description":"I bought this setting spray to use on my sister before her engagement photos. The spraying mechanism was misty enough so that I didn't have to worry about it making anything run and her makeup held up through her photo session in hot Los Angeles weather. It didn't appear to alter the finish of her foundation/powder. I don't use setting spray on a regular basis, it is better suited for special occasions/events where you know you'll be photographed."
      },
      "anastasialucky7":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"7 Jan 2013",
         "title":"LOVE",
         "description":"The absolute BEST stuff. Helps make up stay on ALL NIGHT (or day!) and gives you a pretty glowy look !"
      },
      "rrbarry":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"7 Mar 2011",
         "title":"Wow!! No Makeup Meltdown!!",
         "description":"I love this product. It is nice to look at my face in the mirrow when I am ready to leave work and see that my makeup has remained fresh-looking! Like an invisible shield you don't even know is there!!"
      },
      "lotus216":{ 
         "extra_info":"<b>Skin Type</b> Normal",
         "stars":"5 stars",
         "date":"16 Jun 2015",
         "title":"Love This Amazing Product",
         "description":"This is by far the best makeup setting spray I have ever used. My daughter recommended it after I told her about my makeup running in this Las Vegas heat. I totally recommend this product."
      },
      "krisyriley":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"15 Nov 2016",
         "title":"Love this spray",
         "description":"Bought the travel size and immediately loved it. My face is normally super oily but this keeps my make up in place rather than it sliding off. Will buy again!"
      },
      "sarahhig":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"1 Mar 2016",
         "title":"Works great... wish it was alcohol free",
         "description":"I've been using this product for such a long time (my first bottle has the city nighttime print on it) And I'll keep buying it every time I run out of it. The spray feels nice and cooling on contact, and it really helps my makeup feel settled. It's lasted me through crazy nights out dancing, and hot tropical vacations. My only complaint is that it contains alcohol which does have a drying effect. My skin is oily, so I don't mind as much, but those with drier skin may find it a problem"
      },
      "linsay43":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"22 Feb 2016",
         "title":"works wonders",
         "description":"My makeup lasted me through out 2 hours of crying. All in all my makeup was still perfect afterwards even if my heart was not. Definitely would 100% recommend especially if you are a cake face like I am."
      },
      "EllenLum":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"1 star",
         "date":"16 Jul 2010",
         "title":"Didn't work!",
         "description":"I was so excited to get this product so I could use it whenever I go to the beach or when I don't have enough time to touch up my makeup before going out. I was soo disappointed when it didn't work for me!! I sprayed it on in the morning after I put my makeup on and I didn't see any change in how my makeup looks as it usually does by the end of the day. Definitelyy returning it."
      },
      "Kristiann1118":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"5 Apr 2014",
         "title":"Love it!!!",
         "description":"I love this product! I used this before a night out and after hours of dancing and sweating my make up still look fresh!"
      },
      "Chelaa":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"14 Feb 2017",
         "title":"Y'ALL.",
         "description":"Okay so quick story time. Last year I lost 4 members of my family, one being my grandfather who I was really close to. Every year for Valentine's he would get me roses, and would have them delivered when I went to college. This year, I wasn't expecting anything to come out of today, but a random guy in my college gave me the exact same rose that my grandfather used to get me. Personally, I see this as a sign so I got emotional and I cried. Then I got angry at myself because I had done my makeup and I was going to have to fix it because even though my mascara and eyeliner are waterproof, they always run. I was surprised to see that my makeup was intact. I recently bought this setting spray and I can tell you that it does the job. Tested and proved from ugly crying for an hour about a deceased love one. If that doesn't prove how awesome it is, I don't know what will."
      },
      "carriee":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"29 Apr 2015",
         "title":"love it!",
         "description":"I think this spray is awesome! I have used it with tinted moisturizer as well as light (water based) foundation and it does hold up all day. I'm not sure about 16- hours as that's too late for me. The spray dries quickly and I feel it sets in nicely, smoothing out my makeup. It is not sticky nor have a strong fragrance. As the Chicago weather warms up - I look forward to seeing it help on humid summer days."
      },
      "laury508":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"12 Aug 2018",
         "title":"THE ABSOLUTE BEST",
         "description":"If you need a setting spray that will survive through anything, try this one. It survived a bawling session when nobody came to my birthday and this setting spray was the only thing that had my back. Love it."
      },
      "JazmynHernan17":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"5 Apr 2016",
         "title":"BUY IT!",
         "description":"I've been running around for over 20 hours trying to get everything ready for a party & I still look like a queen. This stuff is magic"
      },
      "JustMeek":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Mar 2013",
         "title":"Best to lock and rock your makeup",
         "description":"I would get this in an IV drip if I could insure I'd never be without it. I can put on my makeup and use the All Nighter sparay, sing 2 full sets and sweat like crazy and my makeup is still on my face, it's MAGIC!! I turn everyone I know onto this product. In high humidity I sometimes use it as a primer for makeup then over and it stays put!! I am sure this may make some of you squirm however in Hawaii it was my secret weapon this way~"
      },
      "kiwawaa":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"27 Oct 2014",
         "title":"awesome!",
         "description":"This is really great makeup setting spray! Makes my makeup stay on for longer throughout the day and more like how it did when I first put it on. I think it's a little over the top to wear a really great makeup spray every single day so mine personally doesn't get too too much use but to each their own :p"
      },
      "CurlyBee":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"29 May 2017",
         "title":"No more mirror checks!",
         "description":"If you're like me, you apply make up and make unnecessary trips to the bathroom to make sure it's still in place. I had all day work events and applied my make up at 8am, sprayed my face and checked again at 4PM and everything was still perfect as though I had just applied it!"
      },
      "juliadelf":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"27 May 2016",
         "title":"ok i was skeptical it would last that long BUT I SWEAR TO YOU it does. i never write reviews but this product deserves a rave one. i put it on at 2 p.m. and it straight up lasted me until 2 a.m. when i went to bed. i went to see beyonce and it lasted the entire night, which i doubted considering i was so sweaty and gross but it looked the same as when i had out it on. the only thing you need to worry about is reapplying your lipstick :)",
         "description":""
      },
      "taylorkaetlyn":{ 
         "extra_info":"<b>Age</b> 13-17",
         "stars":"5 stars",
         "date":"5 Jan 2013",
         "title":"It's great but....",
         "description":"It's wonderful at keeping my makeup in place and really did reduce my shine but, i had a problem with the way it made my face feel after i had been sweating. i go to an all arts school so i dance a lot during my school day. When i would sweat, my face would sting intensely so i stopped using it."
      },
      "cathyyyy":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"3 stars",
         "date":"20 Jul 2012",
         "title":"This works pretty well if I spray enough on but not the best yet for oily skin.",
         "description":""
      },
      "bbymil":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"29 Sep 2015",
         "title":"Not one to help hormones!",
         "description":"I'd definitely say if you're starting out with oily skin, see the Urban Decay De-Slick Makeup Setting Spray. When I first started buying setting sprays, my hormones were raging and it was hard for me to find a spray that would keep makeup on my face for even a few hours without anything running. I tried this before I tried the de-slicking one and let me tell you, it's there for a reason! If you have oily skin, I would not recommend this product. It's not that it necessarily makes it worse, but oily skin itself tends to make makeup run. This product, not being one to help with oil, is not a good idea for people who have oily skin.\n\nI no longer have oily skin and this is the only setting spray that works for me!"
      },
      "narsj":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"25 Jan 2015",
         "title":"=)",
         "description":"Got the travel size and it will go every where with meeh!"
      },
      "rh0nda":{ 
         "extra_info":"error getting this field.",
         "stars":"4 stars",
         "date":"8 Apr 2015",
         "title":"still experimenting",
         "description":"With this I find less is more!! I've only used it twice and didn't change anything else in my beauty routine so I could get an idea of how to properly use this product. The first day I did the recommended X & T spray, my face looked worse off than it normally does had I not used the product (caking, sliding makeup etc) today I decided to use 2 sprays - one for each side of my face and much better results! My makeup from this morning took me right until my evening shift! With a product that gives you better results using less you can't really complain, but I would like to experiment a little bit more. This is my first impression!"
      },
      "RaqiM":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 Jul 2017",
         "title":"WORTH THE HYPE",
         "description":"I heard a lot about this product from everyone especially YouTubers and friends but since I have oily skin I thought it'd be best to stick to the de-slick but after years of avoiding it I finally gave it a shot out of not being super content with the urban decay de-slick in the summer time. I live on the East Coast where it is super humid and my home's AC loves to go out so as you can imagine its NASTY and HOT. (It gets so bad that i've sweated while doing my makeup) But this is the only setting spray that survives my hot room and going outside. I've tested this setting spray through day parties, community service, picnics, clubs and bars. You name it I've been through it. When I come home my makeup looks fairly new and I can still take selfies and plenty of snapchats without looking crazy.  Any way yes this product is everything and a bag of chips and won't have you looking like one!"
      },
      "csmith321":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Jan 2015",
         "title":"This stuff really works!",
         "description":"I was reluctant to try this. It seemed like a lot of money for something that probably wouldn't really do a whole lot. I got a bottle from my sister for Christmas (funny thing is, i bought her one too!) and it really does make a different on how long my makeup lasts!"
      },
      "surf":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"29 Jul 2011",
         "title":"Perfection spray",
         "description":"After spraying this on, make up looked flawless. Color looked amazing. Great for setting make up to last long."
      },
      "seaangel":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"7 May 2010",
         "title":"Great  Product!!!",
         "description":"I have to admit, I just tried this in the store today to see if it performed as promised. After 5 hours I asked my daughter what she thought of my makeup and she said it looked great with no oily t-zone! Looks pretty good 10 hours later after running around in Florida heat and humidity! I'm ordering it NOW!"
      },
      "Kusch":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"8 Jan 2014",
         "title":"All Day and All Night",
         "description":"This bottle is a miracle! No matter what type/brand of foundation I've used, it never seemed to be able to hold up throughout the course of an entire day. With this spray, I can apply my makeup in the morning and not worry about it melting off of my face during the day. Everything, and I mean EVERYTHING, stays put. It even helps set your eye shadow. The formula doesn't leave your face feeling dry or greasy. After the mist dries, there are no signs that you applied it other than your makeup staying put for the rest of the day!"
      },
      "Alexk72":{ 
         "extra_info":"<b>Eye Color</b> Blue",
         "stars":"1 star",
         "date":"19 Nov 2017",
         "title":"HORRIBLE",
         "description":"Honestly the worst thing ever!!! I've never understood the hype, it makes my makeup separate and completely smudge off it stays on longer without the spray I highly do not recommend as much as I did want to love it"
      },
      "KLBEE":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"23 Jan 2015",
         "title":"Lasts all day!",
         "description":"This stuff is amazing - like go to work all day, out for the night, and top it off with a steamy hot tub and your makeup will still be on.\n\nThe bottle will also last forever. I ordered the small bottle and it lasted 4 months with everyday wear.\n\nI do sometimes find this to be a little drying in the winter though."
      },
      "DeeDee930":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"13 Jan 2015",
         "title":"Amazing Product!",
         "description":"I have used other setting sprays including the one by E.L.F. and this one works soo much better. The first time I used it I checked on my makeup after a few hours thinking \"Eh, I'll probably have to re-touch.\" I was sooo surprised when all my makeup was intact like I had just applied it. Will definitely add this to my makeup regimen permanently."
      },
      "Helehcim":{ 
         "extra_info":"<b>Age</b> 35-44",
         "stars":"5 stars",
         "date":"1 Sep 2012",
         "title":"finally!!",
         "description":"I have oily skin even at the age of thirty-plenty and every time I wear makeup within a few hours I'm shiny and slick. It hardly seemed worth the money and effort to keep from looking like I was melting, so most of the time I don't wear makeup, and if I do it's only for a few hours and I carry a ton of blotters with me so I can touch up every couple of hours. I gave this a try and it works! I started with a clean face, oil-free moisturizer, primer, powder, blush, shadow and mascara then four sprays. Make sure you hold it away from your face like it says and close your eyes (and wait till the mascara is dry, learned that one the hard way lol). I used four sprays because I'm just that oily. When I got home that night my makeup looked great! Eight hours and hardly a sign of shine! What really sold me was when I fell asleep with my makeup on (I do not recommend this) and I was shocked, it wasn't all over my pillow and I looked slightly made up at 7am. I'm buying the big one next! Oh - and it hasn't caused a breakout which is my other issue with many makeups. I'm hooked."
      },
      "loveowlways":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"4 stars",
         "date":"16 Dec 2011",
         "title":"I like",
         "description":"Works pretty good, but i still think i need a primer then follow with a setting spray. I use the UD cream to Powder foundation before this and it sets it fine but I truly think a primer is needed to get the full effect."
      },
      "Cassiestella":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Oct 2016",
         "title":"makeup God",
         "description":"Let me tell you a horror story that my makeup survived through because of this spray. So my boyfriend and I broke up, I got into a car accident in the rain, and waited over a hour for a tow truck in the rain while also crying and fighting with my ex boyfriend. Lots of crying and rain that day. But when I got home and looked in the mirror, my makeup didn't smudge at all, eyeliner, eyeshadow and countour was still on point! This spray is a Miricle worker and helped me still look amazing during the worst breakup of my life! Highly recommend"
      },
      "KittyLinka":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"3 stars",
         "date":"30 Aug 2016",
         "title":"Weird",
         "description":"I have used this stuff on and off over the past year and I feel like it makes my face oilier than when not using it, it's weird. Initially my makeup looks great for a couple of hours but by lunchtime it's more greasy than lunchtime on a day without the spray. Maybe I'm applying too much of it? I'll keep giving it a go with different products and/or powder."
      },
      "kat1925":{ 
         "extra_info":"<b>Age</b> over 54",
         "stars":"5 stars",
         "date":"28 Mar 2013",
         "title":"Love it",
         "description":"I had never tried this before but with summer coming i thought i would give it a go and could not belive it when it worked so much better then i ever dreamed this will be with me for as long as they make it because it sure has worked for me."
      },
      "ambergurl":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Apr 2014",
         "title":"Cannot live without this!",
         "description":"I spray this over my makeup every time I apply. It makes the makeup look better and last longer. Add a thin layer of translucent powder before it dries completely and it lasts even longer! It's worth every penny!"
      },
      "lichitanice520":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"11 Sep 2012",
         "title":"Great setting spray!",
         "description":"This is the first setting spray that I have used so I do not have much experience with sprays. I really do like the look that I get with this spray. Sometimes I can get a little blush happy and apply too much but with this spray it makes it look more natural and not as harsh. It also last all day with only having to blot throughout the day since I have really oily skin. Definately would recommend this to all my girlfriends :)"
      },
      "astarr1219":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"17 Apr 2013",
         "title":"Perfection",
         "description":"I absolutely love this product!!!! I use bare minerals everyday and a couple sprays of this in the morning. I never have to touch up my face is always flawless now!!! I never thought my make-up would stay sooo long no matter what the weather is! Will never go without ud all nighter again!!!"
      },
      "dottyg":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"25 Sep 2015",
         "title":"Makeup looks great - hours later!",
         "description":"I had an event to attend at the airport this morning. It was several hours, and the a/c is never sufficient in that place. Not only that, but I live in a humid city, and it's hard enough to keep makeup looking fresh as it is.\n\nI put my makeup on about 7:00 this morning. And, as of 6:15 tonight, it's still looking perfect! I can go into the evening without a touch up at all on it.\n\nI'm so pleasantly surprised by how wonderfully this works. I really didn't expect my makeup to still look good after being in the heat and walking around like I did. But it does!\n\nA tip: load your eyeshadow on your brush and then spritz it with a little setting spray. It goes on more luminously and stays even longer. I love the way it looks today! And it hasn't moved, either. Still as perfect as this morning!"
      },
      "mm3225":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"31 Jan 2017",
         "title":"It's great in those real life situations",
         "description":"I use the DC metro, if you're not from the area, you don't know that it's a mess and constantly breaking down. I got this spray yesterday and this morning was my first time using it. \r\n\r\nOn the metro this morning and naturally my train breaks down and I'm stuck on a train going nowhere for 45 minutes. Not thinking, I put my face in my hands out of despair and frustration. To my surprise, my black gloves had no (zero, zilch!) makeup on them.\r\n\r\nThis setting spray is a godsend."
      },
      "susieQ56":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"9 Jan 2017",
         "title":"love love love",
         "description":"Omg. I love this spray so much! The first time around I got the smaller one so I could see how it worked and my makeup stayed on better than usual! Once I ran out, I noticed a huge difference in how long it stayed and the apperance of my makeup by the end of the day, but I recently repurchased it (in the biggest size) and I don't regret it at all. This setting spray is amazing and I'ld keep buying it"
      },
      "ashelyb":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"10 Aug 2011",
         "title":"The best on the market!",
         "description":"For all you ladies out there looking for a primer that really works, THIS IS IT! Through humidity, sleep :), and sweat, my makeup always stays in tact! The thing I really like about UD's All NIghter is that it keeps my makeup from blotching when it's really humid or hot outside. You can also use it as a spray and fix kind of primer. If you want to do touch-ups, you can spray this on your face, wait a few seconds and apply powder or bronzer, whichever you prefer! Your makeup with look like you just applied it! I would recommend this product to EVERYONE! I LOVE IT!"
      },
      "JessicaBK99":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"23 Sep 2016",
         "title":"Amazing!!!!!!!",
         "description":"This spray is absolutely amazing! I have been using it every day to keep my BB cream and powder in place and it stays all day. I used it last night to set my makeup before going on a party boat type thing. My makeup stayed through the wind and salty mist on the water and through a night of dancing in an overly crowded room. My makeup did not budge the entire night. Safe to say that I will be purchasing this again!"
      },
      "NickBS":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"1 Jan 2015",
         "title":"Great",
         "description":"It is the best make up setting spray after\nskindinavia's bridal setting spray. It fulfills everything it claims. It makes your make up lasts really long and look gorgeaous. It is a little bit drying because it is made with alcohol but every setting spray must have alcohol in order to do its job. It smells really nice, it also smells a little like alcohol, but really subtle. I love it."
      },
      "shmeegs":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"8 Aug 2011",
         "title":"Woke up WITHOUT raccoon eyes",
         "description":"I don't normally write reviews (but always read them!) I just had to share! I went to a concert last night, and put on my make up around 4 o'clock. I went to concert, out afterword, it was very hot and humid, and crashed without removing my makeup. When I woke up this morning my eyeliner and mascara hadn't budged, and there was still a hint of my eyeshadow! (lighter in color, but not creased!!) I didn't have raccoon eyes, which I normally do!\nThis stuff really makes makeup stay put!"
      },
      "taimadlove":{ 
         "extra_info":"<b>Eye Color</b> Hazel",
         "stars":"5 stars",
         "date":"18 Aug 2019",
         "title":"Coming from someone who is OILY ALL THE TIME",
         "description":"Absolutely love this setting spray. I like the fact that it smells refreshing and I do notice a big difference in how much my face sweats and gets hot!"
      },
      "Ag0894":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 Jan 2016",
         "title":"Love it!",
         "description":"Seriously amazing setting spray! I purchased this setting spray about 4 times already I can't stop using it!"
      },
      "Melika9":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"20 Feb 2015",
         "title":"Can't live without it!",
         "description":"I have super oily skin & while this doesn't keep me looking freshly made up all day, it does help my makeup last much longer than it did without it! I can't live without it now! Without it my makeup is sliding off halfway through my day. With it I can make it until I get home in the early evening before having to freshen everything up."
      },
      "Emilyp11":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Aug 2017",
         "title":"obsessed",
         "description":"This setting spray has been my go-to for years. It's amazing and my makeup lasts forever. can't live without it!"
      },
      "Lexie998":{ 
         "extra_info":"error getting this field.",
         "stars":"1 star",
         "date":"10 Jan 2017",
         "title":"smell",
         "description":"Loved this spray for years but the new bottle/formula has a lasting smell that's absolutely awful. Had to return it and find a new brand"
      },
      "michellewin":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"24 Sep 2011",
         "title":"Lasts through rain, sweat, humidity! Incredible!",
         "description":"I rare ever write product reviews but I just HAD to let you know how amazing this is. I'm a college cheerleader and this spray helped my make up last through craazy NC humidity, scattered rain, and dripping sweat during football games with ZERO touch ups. My face is usually EXTREMELY oily (3-4 blotting sheets a day), but my eye make up and foundation don't BUDGE when I use this spray. I'm utterly impressed.\n\nI don't use it daily but it's perfect for going out, dancing, working out, and 6 hours cheering in the hot sun and rain. If my makeup can withstand rainy games and sweaty raves, it can last through pretty much anything. Best product I've bought from Sephora hands down."
      },
      "JillBeauty":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"12 Jun 2014",
         "title":"AMAZING!!!",
         "description":"This setting spray is amazing!!! It helps your makeup stay all day and keep it looking fresh! Love, love, love it!"
      },
      "kaylasue":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"25 May 2011",
         "title":"AMAZING!! PLEASE READ",
         "description":"This is a \"can't live without product\". I initally bought this to use only for special occasions and such,but then...once I realized the results are INCREDIBLE and my make-up seriously didn't BUDGE,I figured, why wouldn't I want my make-up to hold up like this every day??? Well, I've had it for 3+ months and I am now halfway done with it. I use at least 12 sprays each time. Reason for that is, I use it in layers. When I first apply my primer,after I apply my foundation,and after I apply my blush,powder,bronzer and eyeshadow. I get sooo many compliments that my skin looks flawless and I attribute it solely to this product. It sets everything in and helps it all blend together beautifully. DO NOT BUY THE SMALL SIZE! Splurge and get the full size. Think about it,you are getting 1/3 of an ounce in that bottle....for $11! Whereas you are getting TWELEVE TIMES that amount in the full size, for a little over double the price.Its such a rip off. But I have to admit,I initally bought the trial size not even thinking. I used it within like a week. I hope this helps you make-up your mind to purchase this product!!"
      },
      "abbyakamsarod":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"12 Jul 2012",
         "title":"Love this Product",
         "description":"I bought this in the smaller size, and it lasted actually a really long time. It does exactly what the label says on it. My makeup would stay, even after going clubbing, and sweating. Highly recommend this product."
      },
      "mrsallday":{ 
         "extra_info":"<b>Age</b> 45-54",
         "stars":"5 stars",
         "date":"28 May 2013",
         "title":"Urban Decay Make up Setting Spray",
         "description":"I love the idea of using a setting spray to ensure that my foundation stays put. I used to use the Mac Studio Fix spray until I tried the Urban Decay all NIghter Long-Lasting Make-Up Settint spray. The Urban Decay product works so much better and actually keeps my foundation fresh looking all day. I am so satisfied!"
      },
      "JoniBalogna":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"17 May 2014",
         "title":"Swim-Proof!",
         "description":"I had my doubts that a simple spray could do much for my makeup sliding around and creasing but hoo-boy was I wrong.\n\nI went for a one hour military lap swim and was rubbing at my face constantly. Well, lo and behold when I got out of the pool and into the change room, my eyebrows had stayed on with almost no wear whatsoever!\n\nWill definitely be re-buying this when mine runs out!"
      },
      "SugarSkullHQ":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"1 star",
         "date":"17 Nov 2016",
         "title":"Just imagine you're putting it on",
         "description":"You can go ahead and just use your imagination to pretend you're applying this product. It will have the exact same effect.\r\nIf a single tear rolls down your face after you use this product, there will be a big streak to show exactly where it was. If that tear gets up in the wrinkles of your eyelid, you can say goodbye to every bit of makeup that used to be there. If you sweat, your makeup will bead up when you sweat.\r\nIt also won't make your makeup look any smoother.\r\nIn conclusion, this product does absolutely nothing."
      },
      "cakoines":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"14 May 2014",
         "title":"controls oil better than de-slick",
         "description":"I have super oily skin and have tried just about everything to get my makeup to stay put throughout the day. I was using de-slick for awhile and liked how it set my makeup, but didn't really notice any oil control. I still had to use blotting papers and touchup my makeup throughout the day. I decided to try all nighter and oh my goodness, what a difference! i literally do not have to touchup or blot my skin all day. and my eyemakup stays absolutely perfect. If you have oily skin and are not happy with de-slick, try all nighter. it's 100% better at controlling oil and setting makeup. you won't be disappointed."
      },
      "kh9000":{ 
         "extra_info":"error getting this field.",
         "stars":"5 stars",
         "date":"16 May 2017",
         "title":"amazing",
         "description":"I got oily and acne prone skin and my skin just reacts to random products like every other drugstore setting spray. Only until I look to this one in Sephora. \n\nIt really worth the price tag and all the hype on YouTube. It does hold my makeup in place for at least 12 hrs. The nozzle is great which gives a fine spray so it  won't break my makeup apart. \n\nAbsolutely amazing products and definitely a must-have."
      },
      "OlgiaLikesFood":{ 
         "extra_info":"<b>Age</b> 18-24",
         "stars":"5 stars",
         "date":"22 Sep 2016",
         "title":"Bomb.com",
         "description":"This stuff is the bomb. Don't go wasting your money on \"amazing, long-lasting\" setting sprays until you've tried this one. Makeup seriously doesn't budge...and I jumped into a pool. This stuff is magical. It's feels wet on your face for about 10-15 seconds, soaks in fast and boom! you have a perfect face all day."
      },
      "bluedaisies":{ 
         "extra_info":"<b>Age</b> 25-34",
         "stars":"5 stars",
         "date":"2 Dec 2011",
         "title":"This stuff is AMAZING!! I wore it over my makeup when I was a bridesmaid in a friend's wedding last month and it works. One of the Sephora consultants recommended spraying this on right after you put on primer then putting on your makeup and spraying your face again when finished. I wear Bare Escuentals.\n\nI danced my butt off at the reception and I did get sweaty, but my face stayed in tact! Definitely using this for my upcoming wedding in March!!",
         "description":""
      }
   }
}