{
    "number_of_reviews": 105,
    "reviews": [
        {
            "date": "29 Mar 2016",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "Now I can cry all I want without having to worry about looking like a racoon! It's better than the original by far.",
            "review_title": "AWESOME",
            "stars": "5 stars",
            "userid": 1712881320248725514
        },
        {
            "date": "29 Sep 2016",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "This holds a curl beautifully and lengthens wonderfully. Lightly sweeping thin layers of the mascara on is the best for me to avoid clumps when initially applying it. Everything makes me cry so I'm always getting this stuff wet and judging from how it looks right now (after a 2 hour nap and a half hour of a hard core crying sesh) it handles itself well- still holds at least 65% of the curl and at least 50% of the applied length and 99% of the black colour is still there. It only becomes a bit clumpy when I cry but it's cool- reapplying one layer of this stuff helps get it back to its original state. This stuff can smudge a lot under your eye ONLY if it's oily under there so just apply some translucent powder if that's ever a problem for you.",
            "review_title": "if you're sad and cry a lot this is for you",
            "stars": "5 stars",
            "userid": 9206431307692392522
        },
        {
            "date": "23 May 2017",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "I just bought this and will be returning it shortly. This did not stand up to humidity, rain, or tears at all. The wand is terrible, and on my lower lashes just applied the product straight to the skin in the corners, totally missing my lashes. The packaging is on the nose, I will say that, but the products needs an overhaul.",
            "review_title": "Hate it",
            "stars": "1 star",
            "userid": 469667213866768497
        },
        {
            "date": "15 Aug 2017",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "To start off, I have really watery and sensitive eyes, so I can only wear waterproof mascara. This is the reason why I had kind of given up on high end mascaras because for some reason, drugstore mascaras seem to be the only ones that know what waterproof means. Still, I was curious about the Better Than Sex Mascara when they made a waterproof version and on vacation I bought the travelsized version to test it. The first thing I noticed was that this mascara makes my lashes look the most beautiful they have ever looked. It also is the only mascara I have ever tried that I need only one coat of. But even after two coats, it doesn't clump and I have curved, defined, volumous, even longer, actually black lashes. I fell instantly in love! The second thing that I noticed that I had slight raccoon eyes after I sprayed myself with setting/sunblock-spray. So I was terribly disappointed and thought that this wasn't really waterproof. After having worn this mascara for 2 weeks now, I can say that it is actually pretty waterproof. It survived very hot days and a sad movie with lots of crying on my part. Here are the things that I have learned though: a) this mascara takes relatively long to dry, and while drying it is not waterproof/transferproof yet. So no settingspray while the mascara isn't dry yet. b)setting powder under the eyes! Because the mascara is waterproof, but not oilproof, so if you have oily skin or use something oily like sunscreen, the mascara is going to come off on the oily places. c) for some reason, this mascara is much easier to remove than the drugstore mascaras I am used to, so less rubbing is really nice for my sensitive eyes!",
            "review_title": "Nearly perfect",
            "stars": "5 stars",
            "userid": 567650390071245448
        },
        {
            "date": "21 Sep 2016",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "This mascara was recommended by a friend very into makeup and let me tell you...I DO NOT regret my purchase! Let's just say, I met a guy on tinder, things were going great, we dated, the next thing you know, I'm drinking bottles nd bottles, crying profusely till I fell asleep and the next morning I wake up and still look bangin!! This product did not budge or smudge!! Love love love it!",
            "review_title": "Amazing!!",
            "stars": "5 stars",
            "userid": -908194716531942943
        },
        {
            "date": "30 May 2016",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "Let's talk about the uses for this mascara. This is a great mascara for people who NEED waterproof mascara such as swimmers. This is probably not a great mascara for people who are looking for an everyday mascara that won't smudge or run. I personally only use this mascara if I know that I might go swimming or cry. The pros - This mascara sticks to your lashes like superglue. It will NOT budge the rest of the day and probably the rest of the week too. I could probably wear it during the zombie apocalypse and still come out with no smudging. -It's super volumizing, black and lengthens really well too. It makes you look like you're wearing falsies. The cons: -This mascara takes some getting used too. It is a very wet formula and there's a ton of product on the brush. I would strongly recommend combing out your lashes with a spoolie if it seems there is too much product. -It takes a long time to dry (approximately 15 min), probably because the formula is so wet. (This is probably a good thing it's so wet because it won't dry out quickly in the tube.) -It's incredibly hard to remove. There's a reason why this is sold with a special remover. Overall, this is an amazing waterproof mascara. If you're looking for \"THE waterproof mascara\" then buy this!! It will not budge. If you're looking for just a volumizing mascara, it's probably better to just stick to the original BTS or another nice mascara.",
            "review_title": "Tricky but worth it",
            "stars": "5 stars",
            "userid": -7755196465053535760
        },
        {
            "date": "3 Apr 2016",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "I really wanted to love this. My daughter and I both adore the original bts and couldn't wait for the waterproof. It did NOT live up to our expectations. It didn't have the same look we have come to love. It was an ok waterproof and did really stay put for both of us but the actual look of the mascara was very disappointing. This will be used for high humidity days or time we know we will be shedding tears. So sad, with all the hype this fell very flat.",
            "review_title": "nothing like the original",
            "stars": "1 star",
            "userid": 9193540518953034893
        },
        {
            "date": "6 Mar 2017",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "I bought this mascara when my father entered hospice, in preparation for the nonstop tears I knew were on the horizon. Not only does this mascara not budge AT ALL even when crying hysterically, but it looks good! All waterproof mascaras I have tried in the past either weren't really waterproof or were but made your eyelashes look horrible. This one give great volume and length on top of excellent staying power, even when out through a full on tear test.",
            "review_title": "absolute best waterproof mascara",
            "stars": "5 stars",
            "userid": -8289693619201964861
        },
        {
            "date": "7 Sep 2017",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "I have extremely long eyelashes, and I need a mascara that will keep my eyelashes curled (having them touch my glasses everyday is uncomfortable) as well as stay waterproof. I dislike the Better than Sex formula because I find it flakes off during the day and does't hold my curl. However, this does! I had a stressful moment at work recently and a few tears sneaked out of my eyes, so I went to the bathroom to wipe the raccoon streaks from under my eyes...and there weren't ANY. I couldn't believe it. I've tried Dior, Marc Jacobs, Too Faced, you name it, but this mascara is my HG. Not sure why there are so many low reviews, but for me, this is as perfect as it gets.",
            "review_title": "Color: Standard Size Black - 0.27 oz/ 8 mL",
            "stars": "5 stars",
            "userid": 1108261897835423247
        },
        {
            "date": "27 Feb 2017",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "My 6$ drug store mascara does a better job than this. It is waterproof I wore it to my brothers wedding and it stayed on through many tears without smudging. But it did nothing to make my lashes look good they stuck together and putting it on was a nightmare.",
            "review_title": "Didn't like it",
            "stars": "1 star",
            "userid": -4364065799727458678
        },
        {
            "date": "13 May 2016",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-waterproof-mascara-P407908?icid2=products%20grid:p407908"
            },
            "review_body": "Biiiiiiiiish, this mascara not only makes your eyelashes look amazing but it also lasted through 30 minutes of intercourse, humidity, and 45 minutes of crying. The rest of my makeup was trashed but my lashes looked on point.",
            "review_title": "OH MY LANTA",
            "stars": "5 stars",
            "userid": -2877781339344259213
        },
        {
            "date": "12 Jan 2014",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-mascara-P381000?icid2=products%20grid:p381000"
            },
            "review_body": "Before purchasing, I researched mascaras and narrowed it down to a few brands. While in the store, I asked the advice of the salesperson who overwhelming suggested I go with this one. Big mistake. Was excited to try it at home. As soon as I opened the cap, the product looked messy as it oozed out of the container. It was like a thick paste, gloopy, and sticky- not at all the amazing product I'd heard about. The brush was way too bulky, not good for precision. It coated my lashes making them stick together but did little to separate them. The product stung my eyes and made me cry, which created an even bigger mess. I tried to apply an additional coat,but it did nothing- no extra volume. The entire look was sloppy. Maybe if you have long, thick lashes to begin with this product works but if you have thin, wispy lashes, the product is WAY TOO THICK. You couldn't even see the individual lashes. And after removing it with 2 rounds of eye makeup remover, and a cleansing towelette, I still woke up with black gunk under my eyes. I get MUCH better results with brands I've purchased at the drugstore after 3 coats. I wish I had gone with my gut and bought one of the other mascaras I read about. This one is definitely getting returned.",
            "review_title": "Sloppy look, product like paste, lacks precision",
            "stars": "1 star",
            "userid": -2607483853204181551
        },
        {
            "date": "7 Sep 2014",
            "product_info": {
                "brand": "Too Faced",
                "name": "Better Than Sex Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/better-than-sex-mascara-P381000?icid2=products%20grid:p381000"
            },
            "review_body": "I love this mascara more than anything in the whole world. I can dab a little on for a natural look or I can layer in on for an intense, dramatic look. It volumises like no other mascara ever could. It also is amazing at adding length and curl and definition. It dries pretty quickly, but I always save mascara as the last step in my makeup routine so I don't have to worry about it. It is also the strongest waterproof I have ever experienced in a mascara. I can sob uncontrollably and look in the mirror afterward and not have to reapply because my mascara has not budged. It doesn't run or clump or anything!!! I mean, come the end of the day, it is a beast to get off, but I've got a great makeup remover, so I don't mind (Neutrogena Makeup Remover Wipes, I swear by them!). Two critiques: If I wear concealer under my eyes, I do get a little bit of black gunk under my eyes by the end of the day, but if I don't wear foundation, or if I keep up my powder application throughout the day, I don't run into this problem. It's never too hard to wipe off. It comes off pretty easily with my finger, no smudging. And OH, how I wish this mascara came in BROWN. That's not really a critique, but I really do wish I had this is in brown for those days I feel like looking really natural. I recommend this mascara to anyone and everyone. It is my one true love. Forever and Ever. Amen.",
            "review_title": "This is my number one mascara forever and ever.",
            "stars": "5 stars",
            "userid": -2869615841440827880
        },
        {
            "date": "28 Jun 2014",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "I decided to try this as I was looking for a waterproof, cruelty-free mascara and have heard good things about this mascara. The formula is light so it holds curl well and is a nice, dark black. With one coat, it is very legnthening, but not very volumnizing (though it builds up nicely without clumping). The waterproof aspect is okay. I've tested it out swimming a few times and it stays on (though you lose some curl, obviously). Since it has fibers, it can flake a little. If you are just looking for a mascara that doesn't run when you cry, tear up, have allergic reactions, etc. then this will work great.",
            "review_title": "Cannonball",
            "stars": "4 stars",
            "userid": -5442256992970451910
        },
        {
            "date": "8 Nov 2011",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "I once had this mascara on, hopped in the shower in the middle of the afternoon, got my face completely wet, even rubbed by face and suddenly realized I still had make up on! I looked at my hands and saw trails of my watered down make up (eye shadow, brow filler, etc.) but I noticed there were no streaks of black. I dabbed my face with a towel and still no mascara trails. After I stepped out of the shower I rubbed my lashes only with my fingers and STILL no runny mascara! This stuff is not joking about its water proof powers! I wear contacts and when I have to freshen up with solution there are never any runny mascara tears down my cheeks!",
            "review_title": "Holy grail of waterproof!",
            "stars": "5 stars",
            "userid": 7482144078574299718
        },
        {
            "date": "18 Sep 2015",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "I began wearing this formula in high school when I was looking for something that would stay while lifeguarding/swimming... and as an athlete sweating, at weddings crying, etc. 7 years later, I'm still wearing the stuff, and on a daily basis as well as when I'm going to cry. It's an amazing mascara for daily wear as well, not just waterproof activities. It's lengthening, volumizing, long wearing, and just awesome. Sure, it will begin to get smudgy after a hot shower and face wash, but it's not permanent! HOWEVER, it will last through tears, sweat, swimming (unless you rub your eyes a lot), and general water activities. Doesn't get better.",
            "review_title": "lifeguard/athlete/cryer approved!",
            "stars": "5 stars",
            "userid": -851355594870624618
        },
        {
            "date": "10 Jun 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "This is beyond the best waterproof mascara.... it makes my lashes a million miles long. I can't believe no one has reviews on this yest! The secret is on the first coat, short brush strokes from base and then work to top of lashes. By the second coat, your lashes will be thickened and elevated! Now waterproof wise... I do a lot of diving in the ocean and a lot of long distance running... sweat, downpour rain, tears... this stuff does not move. Everyone asks how my marathon finishline photos look so good... 1) smile for the camera and 2) care about how you look. Wearing makeup, namely this awesome mascara, does NOT slow your race pace... does not make you sink to the bottom of the ocean floor... it makes you look smokin' hot and camera ready on a whim.",
            "review_title": "BEST mascara!!",
            "stars": "5 stars",
            "userid": -664245137365409744
        },
        {
            "date": "4 Jan 2015",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "My usual waterproof mascara was out of stock so I took a chance on Cannonball. It did not disappoint. A wedding, a funeral, any situation that turns on the water works, this mascara won't budge. It offers almost all of the benefits of Lancôme Hypnose Star Waterproof (except a little sparkle), with twice the staying power and a lower price, yet removes with half the effort. I'm a big fan.",
            "review_title": "cry-your-eyes-out proof",
            "stars": "5 stars",
            "userid": 4449876739507393716
        },
        {
            "date": "11 Jun 2015",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "",
            "review_title": "Love this mascara! I was in a play and I had a cry a bunch on stage. I was looking for something that would stay put so I wouldn't have raccoon eyes. No matter how much I cried this mascara didn't budge. It defines the lashes well and gives a bit of length but it doesn't volumize. I was also very happy that it was easy to remove. Makeup remover took it right off. I didn't need to scrub my eye like I've had to do with other waterproof mascaras. This is a winner! No smudge and truly waterproof. LOVE THIS!!!",
            "stars": "5 stars",
            "userid": -8796853076960250166
        },
        {
            "date": "29 Oct 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "While this did make my lashes seem exceptionally long once applied, it didn't last. Also, while I didn't cry or go swimming while wearing, I'm not sure about the waterproofness as I would come home from work with mascara residue below my eyes.",
            "review_title": "Not terribly impressed",
            "stars": "2 stars",
            "userid": 7740252411255201524
        },
        {
            "date": "13 Aug 2013",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "I have to give this product five stars because it delivers exactly what it promises. OMG is this waterproof. It's remained put on humid, sweaty days and even teary occasions which I appreciate. It has not flaked off on me and is one of the few mascaras I know I wont have to touch up or worry about traveling on my face during the day. This product is mostly directed towards people who worry about water smudges (tears/humidity/pools ect). For myself I did not notice a finished look that make my lashes thicker or longer. This gives a look of natural lashes and its soft to the touch. I love long lashes so I typically help out this mascara by using my Tarte eyelash curler. General FYI - if your planning on purchasing make sure you have a waterproof eye makeup remover. This WILL make you lose lashes while your scrubbing it off with a normal facial cleanser. Take it from me... my left eye is proof lol",
            "review_title": "Amazingly waterproof.",
            "stars": "5 stars",
            "userid": -2324313815780434124
        },
        {
            "date": "20 May 2015",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "I find myself always going back to this mascara. I've gone through tubes of it like nobody's business. Haha. It stays through it all - sweat, tears, water, heat..EVERYTHING. I also enjoy how it never flakes as well. It pairs really well with the Subversion Lash Primer.",
            "review_title": "HG Mascarra",
            "stars": "5 stars",
            "userid": -6480571542329338400
        },
        {
            "date": "3 Mar 2017",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "Yes, this is definitely waterproof mascara. It stands up to showers, sweat, snow, allergies, and crying. It doesn't smudge or transfer. So if you're looking for waterproof mascara and don't care about anything else, this is great! However, I expected way more - especially from UD. This doesn't lengthen, curl or thicken my lashes. It coats them nicely and holds curl okay, but it's not special. I'm so underwhelmed by this mascara. I'll use it because it works, but I will not be repurchasing.",
            "review_title": "Waterproof But Nothing Else",
            "stars": "3 stars",
            "userid": -1563723204200077426
        },
        {
            "date": "28 Mar 2015",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "My favorite waterproof mascara! Whether swimming, sweating, crying, tearing from allergies...it does not budge. I agree that the tube dries out a bit more quickly than some 'regular' mascaras, so it can become more costly. But it's a Splurge worth taking. Bring on Summer :-)",
            "review_title": "Repeat Purchase ~ It's THAT Good",
            "stars": "5 stars",
            "userid": 8179274882644665664
        },
        {
            "date": "22 Sep 2012",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "I can not say enough good things about this mascara. It looks amazing, if you apply to the corner lashes you can get that \"cat eye\" effect. It lasted through tears and an entire day at a theme park + water park, with no smudges or flakes. It doesn't dry out my eyes and is fine with my contacts. It won't budge when you want it to stay, but as soon as you want it to come off it removes like a dream. Another home-run for UD!",
            "review_title": "Best mascara I've ever tried!",
            "stars": "5 stars",
            "userid": 6488950382820160981
        },
        {
            "date": "2 Dec 2014",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Cannonball Ultra Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/cannonball-ultra-waterproof-mascara-P286303?icid2=products%20grid:p286303:product"
            },
            "review_body": "The first day I put this on my boyfriend broke up with me. This mascara didn't run or flake through a whole day of crying on and off of all day. It has been my go to since.",
            "review_title": "cry proof",
            "stars": "5 stars",
            "userid": 5294801457511553526
        },
        {
            "date": "13 Apr 2010",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "I have very thick long lashes, and have had a problem finding a mascara that lasts more than three weeks, even with only one coat. I keep trying mascaras, hoping to find one that lasts longer, plus has a waterproof version just as good. I came back to this mascara (both waterproof and non-waterproof), because I haven't been able to find another one that lasts longer. Having to replace a tube of mascara every few weeks can be rather expensive, which is why I keep trying. I might find something that seems really good, but then the tube might not make it even three weeks, and I just don't want to pay that much money on a regular basis. I have friends who can go two months on a tube of mascara.\n\nHaving used this in the past, I knew it does an awesome job defining my lashes. The brush is good - it gets most of my lashes with one coat, and I go back and get the rest with a spherical brush. This brush is well designed to reach even small lashes. It gives me a well defined excellent effect. The staying power of this mascara is really good, and I wear it when I know I'll cry - weddings, graduations, water sports, sad movies... This mascara is great and creates some serious lash definition. The only reason I stopped wearing this was that the non-waterproof version didn't last long enough, and I ended up trying other things. A lot of other things...\n\nWell, I'm back to this mascara for day wear when I need a waterproof mascara. (I like the Iconic at night when I want my lashes to fan out).\n\nThis is an excellent mascara. It lasts a very long time once applied, doesn't smear or smooth, and it doesn't run when I cry. I'm really pleased with it for my long lashes. I have friends who have very short sparse lashes who use this, along with the non-waterproof version, and it does awesome things for them, so I know this works for me, with my long lashes, and for them, with their short ones. It's really good and it's dependable. I highly recommend this mascara when you need one that's waterproof.\n\nPS Waterproof mascaras are supposedly healthier, anyway, compared to their non-waterproof versions. because product doesn't rub off on skin or get into eyes.",
            "review_title": "JET BLACK - A  GREAT BLACK WATERPROOF MASCARA",
            "stars": "5 stars",
            "userid": 1982848835537080451
        },
        {
            "date": "11 Jan 2010",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "I love, love LOVE the regular Diorshow mascara, so I ordered this thinking it would be a far better choice for longer-lasting wear: BOY WAS I WRONG. Contrary to staying in place better in the face of tears, sweat, and moisture, this mascara promptly migrates from my lashes to underneath my eyes, leaving me looking like a raccoon every time I've used it. If you want a phenomenal mascara, stick with the regular DiorShow, skip this one.",
            "review_title": "Disappointing",
            "stars": "2 stars",
            "userid": -2625812482642360575
        },
        {
            "date": "2 Sep 2012",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "I am a huge fan of the original DiorShow mascara, but I wanted to try out the waterproof version for times when potential tears, sweat, or other events would lead me needing a waterproof mascara. Unfortunately, I found this waterproof mascara to fall short. It did not go on the same way that the DiorShow did and smudged easily after a few tears. The affect on the lashes didn't seem to be as good as the original either. :(",
            "review_title": "Huge fan of the DiorShow, disappointed this",
            "stars": "3 stars",
            "userid": -9218659259067187432
        },
        {
            "date": "13 Oct 2012",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "Tried this mascara a little while back and was very disappointed overall. I did find that it was very black and did give the visibility of longer lashes. That said, there was too much clumping (something you wouldn't expect to find at this price range), making application less than appealing. Honestly, the product would mostly transfer onto my lashes in clumps, and would leave them sticking together. Horrible. Also, this particular mascara felt very dry on my eyes and irritated them a lot (itching, tears). Gave it a good few weeks hoping my eyes would adjust to it, but never did. Sadly, the disappointment continued when the mascara dried out too quickly in the bottle, leaving me with little to any product to use. Wouldn't recommend this based on my experience.",
            "review_title": "Disappointing",
            "stars": "1 star",
            "userid": 384981940833395159
        },
        {
            "date": "3 Mar 2014",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "This is my fifth Diorshow mascara but my first waterproof, and I'm so sad my last four weren't waterproof. I have a terrible time making my eyelashes stay curled, hence my preference to the waterproof formula, and i had just purchased a different waterproof mascara and hated it, but this really renewed my faith in mascara. It made my lashes look fuller and fluffy and my curl hasn't moved all day, not to mention it held up through some pretty messy crying.\nWell done Dior!",
            "review_title": "HG mascara!!!",
            "stars": "5 stars",
            "userid": -6948321718742686867
        },
        {
            "date": "19 Jul 2014",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "If you cry at weddings movies proposals or just sad tv commercials this is your mascara! it's extra super extremely waterproof, but when it's time to remove it comes off very easy and effortless! Very luxurious exactly what to expect from a nice brand as Dior! Love!! J'Adore!",
            "review_title": "Loveliness",
            "stars": "5 stars",
            "userid": -254036629804268594
        },
        {
            "date": "28 Sep 2008",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "",
            "review_title": "Soooooo Ive been using this product for a loooong time, even before the hype and i reallly recommend it for short lashes. It really does wonders after applying a few coats because it goes on very smoothly. Perfect if your a natural cryer and/or swimmer but make sure to take off the mascara before going to bed with a good water-proof eyemakeup remover or else results could be breakage or clumpyness with a new coat the next day. Oh and as for racoon eyes..they can be avoided if you apply it correctly (arch your eybrows so that it wont get on your eyelids, if it does well no bigger lick your finger and rub it off but if your the eew-my-own saliva-is-disgusting type then carry a Qtip and wet it) and let the mascara dry before doing dramitic eye jestures or sneezing haha =]. Complements and my satisfaction make this product soooo worth the money!",
            "stars": "5 stars",
            "userid": -8787695409242618734
        },
        {
            "date": "15 Sep 2008",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "I wore this mascara for my wedding in January. It worked great! Even with the snow falling and landing on my face the mascara didn't budge. Nor did I get raccoon eyes when I started crying during the speeches! Great Mascara!",
            "review_title": "Great waterproof mascara!",
            "stars": "4 stars",
            "userid": -5711769344003496683
        },
        {
            "date": "15 Sep 2010",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "I am a big fan of Clinique’s high impact mascara, but with the onset of allergy season and an upcoming funeral to attend- I desperately needed something waterproof. I read the reviews for Clinique (which weren’t all that great) and then read the most recommended on Sephora’s site. I was a little hesitant in getting DiorShow because of the price – but it was worth EVERY PENNY!\n\nThis mascara did not run, smudge or flake at all the day my tears were flowing for 12+ hours. What I loved most about it was the brush and the ease of putting it on. The brush was fuller than Clinique’s high impact, so I got longer, fuller, thicker lashes. I couldn’t believe it stayed put all day. I read the other reviews about the flaking and that didn’t happen to me at all. You don’t need numerous coats either, just brush it through until all lashes are evenly coated – it looks like professionally done lashes after application. I’m so glad I went with this product, and equally as glad that it did what it was supposed to.",
            "review_title": "Completely impressed!",
            "stars": "5 stars",
            "userid": -804130731012245893
        },
        {
            "date": "1 Jan 2011",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "This is my first Sephora product and was recommended by a friend who is a Sephora junkie! Well, I absolutely love it. I actually didn't mean to buy waterproof, but I'm glad I did. I cry a lot at movies and stuff, lol, and this mascara is definitely waterproof! No black lines running down my face.\n\nIt's not difficult to remove with make up removerm, either. I've jused drug store brands in the past that were like plastered to my eyelashes. Ridiculous! Dior really has a great line of products.\n\nI also use the DiorShow Mazimizer lash plumping serum before I apply the mascara, and I must say, my eyelashes are amazing! If you're looking for volume and length, I suggest both products.\n\nI have not had any clumping with it and it doesn't seem dry to me.",
            "review_title": "Favorite! :)",
            "stars": "5 stars",
            "userid": 2401401809816417941
        },
        {
            "date": "12 Jan 2009",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "",
            "review_title": "embarrassing to admit, but one time i cried for about 30 min (salty tears), and this did not budge at all. usually when girls cry they get that nasty ugly raccoon eye thing going for everyone to see, but not me. i was pretty impressed and relieved it stayed put. i like to use this because i know that no matter what happens (crying, swimming, etc.) there are no smudges under my eyes. i just remembered that i did swim with this on and it didnt smear. this mascara is just awesome. it gives serious volume to the lashes and somewhat length (can be better). i bought the dior waterproof blackout mascara (lengthens more), which is also good, but diorshow is better. sometimes little specks of the mascara do get under the eyes, but you just need to dust it off. i think this is because the mascara is almost out or when the mascara isnt applied evenly and the tips flake off. hope this is helpful. =)",
            "stars": "5 stars",
            "userid": 9198553866901344082
        },
        {
            "date": "11 Sep 2008",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "This is my new favorite mascara, though I'll use the regular for days I don't need waterproof.\nGot this one for the Wedding day so I don't cry my makeup off. I used it to test it out and WOW! It found lashes I didn't know I had.\nSeparated them beautifully and filled them out, lengthened them too.\nThis is, by far, the best mascara I've ever used.",
            "review_title": "WOW",
            "stars": "5 stars",
            "userid": -343307524649220266
        },
        {
            "date": "22 Mar 2016",
            "product_info": {
                "brand": "Dior",
                "name": "Diorshow Waterproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/diorshow-waterproof-mascara-P99901?icid2=products%20grid:p99901"
            },
            "review_body": "I am so picky with mascaras, I have very long lashes & I never try waterproof because they usually are very difficult to remove at the end of the day, I tried the regular diorshow and decided to try the waterproof version thinking the expensive quality would make it nice. WRONG. I took a 40 minute drive to work and by the time I got there my mascara was running and made NEW dark circles over my concealer. it looked like I was crying for an hour. also didnt stay on well. I returned and bought the regular version which is 500 times better. Definitely recommend that one instead!!",
            "review_title": "Not nice..",
            "stars": "1 star",
            "userid": 3633733923488784317
        },
        {
            "date": "29 Nov 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "This thing is actually magical because I just broke up with someone and straight up cried all day with this eyeliner on and IT DID NOT MOVE AT ALL. Like this thing stood through 5 hours of crying, what a legendary liner.",
            "review_title": "Helped me through my breakup",
            "stars": "5 stars",
            "userid": 1929594222268545284
        },
        {
            "date": "13 May 2010",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "This may sound terribly morbid, but I actually purchased this recently because I needed a waterproof eyeliner formula for a funeral I would be attending (I just kinda ran into Sephora the day prior and asked the sales rep for a waterproof formula and bought whatever she recommended).\nAt the end of a long day of crying, I went to wash my face and was surprised to find my eyes were not a complete mess and I did still in fact have eyeliner in tact. It did come off easily with make-up remover however, which was great.\nAnother plus: it creates a smooth line (as thin or as thick as you'd like), even if you don't have a particularly steady hand (I don't). Definitely superior to any other liquid or \"pen\" eyeliner I've ever tried. It's actually become my go-to formula for everyday and I just ordered it in Maya as well.\n\nBottom line: easy to apply, passed the crying test with flying colors",
            "review_title": "Trooper",
            "stars": "5 stars",
            "userid": 6252988730993412431
        },
        {
            "date": "7 Mar 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "i have had this product since it came out and have not chnaged since. i love it. it stays on all day. i watched a really sad movie (with my makeup on point) and even after i cried an ocean worth of tears, MY EYELINER STILL LOOKED LIKE I JUST APPLIED IT. it is honestly amazing.",
            "review_title": "AMAZING",
            "stars": "5 stars",
            "userid": -2783406730571974316
        },
        {
            "date": "24 Dec 2015",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "As someone who has super oily eyelids, I always find eyeliners slipping and sliding all over my face. I heard great things about this eyeliner so I decided to get it. It's great! It seriously lasts all day and even when it doesn't (from crying), it doesn't get all over my under eye area. Totally recommend!!",
            "review_title": "Amazing!",
            "stars": "5 stars",
            "userid": -8005182032811224719
        },
        {
            "date": "7 Oct 2014",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I've been using this eyeliner now for probably close to 2 years. Maybe longer. I am so madly in love with this product. I suffer from dry eye, and while no make-up will ever beat the battle of the tears, Kat Von D's eyeliner comes close. There is so much to love about this eyeliner. #1. The formula is well made. The liner stays on my eyes until I take it off and it comes off easily with make-up remover or cleansing oil. #2. The brush tip. I used to use Stila's eyeliner pen but constantly found the felt tip to be a massive drawback. The brush tip on Kat's eyeliner is perfection. It is made of tons of small hairs that never...and I mean never...get misshapen or dull. This is a godsend for those like me who rock cat eyes on a daily basis. #3. The product last FOREVER. I typically have each pen for 6 months or more and that's with daily use. Strong pigmentation and a serious bang for your buck. I've honestly never bought a product that was such an amazing return on investment. The price almost seems too low for how much product you actually get and with how well made the material attributes of the tube are. #4. Dries quickly. Unlike liquid eyeliner, you don't have to wait to open your eye for fear of smearing the liner into your crease. This stuff is like superglue. Set it and forget it...wait...that's the rotisserie machine... Anyways, as I was saying, this stuff dries quickly making it easier to finish up your make-up without fear of smudging. If you do make a mistake, it's easy to clean up with some make-up remover and a Q-Tip (I recommend Make Up Forever's sensitive eye remover. It's blue and so kind to your eyes. God bless it.)\n\nOh yeah, and it's waterproof. Like, legitimately waterproof. I have gone swimming and sweated and it hasn't budged.\n\nI know this was long winded but I really wanted to prove to you how quality this product is. I wouldn't write such a long review if I didn't have so much love for this product. I recommend it to everyone.",
            "review_title": "Best. Eyeliner. Ever",
            "stars": "5 stars",
            "userid": -3579340386106175069
        },
        {
            "date": "15 Apr 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I've been having a pretty rough semester at college, but knowing I can put on this beautiful, heavenly black liquid on my eyes every morning gets me motivated. \nThe godlike precision that this eyeliner provides is the only thing that's consistent in my life. \nAnd let's not forget to mention the staying power. Whether I'm crying from stressed induced panic or having a long day: this eye liner never runs or moves. It stays true to color all day without having to reapply. \nWorth the money, because it's not just liquid liner, it's a friend.",
            "review_title": "THE ONLY EYE LINER YOU NEED",
            "stars": "5 stars",
            "userid": -956180803271962007
        },
        {
            "date": "3 Feb 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "My cat died the other day and I sobbed for about 2 hours over her and my eyeliner was still perfect when I stopped so it's pretty good yeah it gets the job done.",
            "review_title": "sad but true",
            "stars": "5 stars",
            "userid": 767377596893108875
        },
        {
            "date": "24 Nov 2013",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I bought this to replace my old Stila liquid liner (the tip stopped getting ink flow). I wanted a cheapter alternative to the Stila liner, and one that didn't have a nylon sheen like the Stila. The sheen made the eyeliner look ill-applied where the light would reflect on it, making it look slimmer in that area.\n\nTHE GOOD\nPerfectly matte; looks great\nDoes not rub off easily\nDoesn't melt off face (Dior crayon WILL melt off face)\nBeautiful lines can be created with the precision tip\nGood price for quality of product\n\nTHE BAD\nDoesn't like moisture (hair grease from bangs, sweat of any kind, tears...)\nDoesn't come off as easily as other make up, even with remover\nDoesn't layer well (with itself--once it dries, it won't glide well over itself. Not so good when missed a spot)\n\nFINAL VERDICT\nSo, if you want an alternative to Stila's liner, this is an acceptable replacement. You will just need to work quickly.",
            "review_title": "Good outweighs Bad",
            "stars": "4 stars",
            "userid": -5949842216606098772
        },
        {
            "date": "25 Nov 2010",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I have only tried this product in Trooper (black). This liner is great - it has great opacity, is very waterproof, has a great applicator that allows for high precision, and doesn't smudge. For any of the previous comments to be true, it is VITAL to let it dry first; if, for example, your eyes are sensitive and tend to tear up when you're applying makeup, the tears might make it smudge away if it still isn't dry. It's got plastic bristles on the applicator, which is great for precision, as opposed to the sponge ones. The only complaint I have about this liner (and the reason I gave it 4stars) is because it tends to dry out temporarily which makes it difficult and frustrating to apply, and the product tends to dry and build up near the base of the applicator. Store it tip down to prevent this from happening, and clean the applicator every so often.",
            "review_title": "Great product, minor issues..",
            "stars": "4 stars",
            "userid": -2538379960366468195
        },
        {
            "date": "2 Jan 2014",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I can not even begin to explain or put into words how much I love this eyeliner. I purchased it right after Thanksgiving, and I have not worn anything else since. I have even shed a few tears while wearing this eyeliner and no running! I love the fact that it wears all day and no smudging or smearing. Get it while you can!",
            "review_title": "Absolutely \"The Best I've Used!\"",
            "stars": "5 stars",
            "userid": -3378691949968909146
        },
        {
            "date": "6 May 2015",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I absolutely love this liner! It stays ALL day even through a menstrual cry fest I may or may not have had. Not to mention if I accidentally fall asleep and my boyfriend is staying over, I don't wake up looking like the swamp thing. It...is...still...perfectly...applied. I'm sold forever, new holy grail. Thanks Kat, you da best ;x",
            "review_title": "in love",
            "stars": "5 stars",
            "userid": -4389974552378757977
        },
        {
            "date": "1 Apr 2014",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "The staying power of this eyeliner is awesome! Even when I'm crying or sweating and with my oily skin it lasts all day and even stays when I fall asleep with my make up on (bad I know, but it happens).\n\nI love the brush for application as well. Applying any type of liquid eye liner takes PRACTICE. But this brush made my transition to liquid eyeliner easier and allows me to either do a thin or thick line which I love.",
            "review_title": "Best liquid eyeliner I've ever used!",
            "stars": "5 stars",
            "userid": 8334126250851981190
        },
        {
            "date": "25 Aug 2013",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I was not a fan of liquid eyeliners because they tend to be shining and hard to make changes.\nAs I live in *very* dry city, I didn't have to worry about sweating and humidity (and many more concerns when you live in the city that is humid).\nAnd this year, I traveled to Atlanta, Miami, and DC - I knew I was going to take a lot of pictures so I wanted to be prepared.\nAfter reading reviews after reviews, I chose this, and I am so glad that I did!\n\n1. This doesn't shine (which I learned that many of liquid eyeliners are)\n2. It stays longer (even if you cry or rub your eyes accidentally)\n3. You don't have to try really hard to take this off (as long as you have lip and eye remover, you are fine)\n4. The brush tip is hard enough (so you have better control when drawing lines)\n\nI bought the black one (Trooper), and I am definitely going to try other colors. Highly recommended!!!!!",
            "review_title": "Oh my god!!",
            "stars": "5 stars",
            "userid": 572624291492277775
        },
        {
            "date": "1 Jul 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I really liked this eyeliner, it shows up really nicely and stays on through a lot. I did a cat eye the morning my boyfriend broke up with me and at the end of the day it was still on even after all the crying. Even if my heart is all wonky, at least my liner looks good.",
            "review_title": "Stays on through a lot",
            "stars": "5 stars",
            "userid": -6528621156338229648
        },
        {
            "date": "8 Oct 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "",
            "review_title": "This liner stayed on despite the barrage of tears I shed when my baby was not sleeping. I was a mess...but my cat eye looked fantastic. Will always repurchase!",
            "stars": "4 stars",
            "userid": -4790812672164426068
        },
        {
            "date": "28 Dec 2012",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "Tattoo Liner is a very long wearing, non-flaking eyeliner. It's not completely waterproof, and though I wouldn't recommend it for swimming, it stands up well to a good cry, humidity, and rain. Trooper is a true black that dries to a glossy finish. This liner should only be used by folks who are quick and experiences in their application. Once it starts to dry (after a few seconds), there's no going over it without lifting the product off of your lids.",
            "review_title": "trooper",
            "stars": "4 stars",
            "userid": 4720306169603290894
        },
        {
            "date": "30 Dec 2016",
            "product_info": {
                "brand": "Kat Von D",
                "name": "Tattoo Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/tattoo-liner-P245205?icid2=products%20grid:p245205"
            },
            "review_body": "I had a mental breakdown while wearing this eyeliner and it didn't move AT ALL even through me crying! Good thin tip for winged eyeliner and definitely smudge and water proof.",
            "review_title": "Great eyeliner",
            "stars": "5 stars",
            "userid": 7230493379961077635
        },
        {
            "date": "15 Nov 2012",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Eyeshadow Primer Potion - Original",
                "type": "Eye Primer",
                "url": "https://www.sephora.com/product/eyeshadow-primer-potion-tube-original-P284716?icid2=products%20grid:p284716"
            },
            "review_body": "",
            "review_title": "Really works. This is my second tube. I really wanted to try \"Greed\" but the store ran out and I couldn't wait for them to reorder it. I have come to rely on this potion. Seriously. One day my ex made me cry &amp; a couple o minutes later he noticed that all my eye makeup was still perfect. That's when I realized how good this stuff is. And that I should never speak to my ex again.",
            "stars": "5 stars",
            "userid": 9075125344483398774
        },
        {
            "date": "13 May 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Eyeshadow Primer Potion - Original",
                "type": "Eye Primer",
                "url": "https://www.sephora.com/product/eyeshadow-primer-potion-tube-original-P284716?icid2=products%20grid:p284716"
            },
            "review_body": "I really do mean it when i say this primer is the BEST STUFF EVER. If I could recommend any beauty product, it would be this one because it works so dang well. One day, while I had it one, my boyfriend decided to break up with me out of the blue. I was heartbroken and cried my eyes out till there were no more tears to cry. Did my make up move? NOPE! Not a single piece if eyeshadow, eyeliner, or mascara was messed up. Looked just as good when I put it on that morning, maybe even better.",
            "review_title": "BEST STUFF EVER",
            "stars": "5 stars",
            "userid": 7961715770825726735
        },
        {
            "date": "8 Dec 2013",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Eyeshadow Primer Potion - Original",
                "type": "Eye Primer",
                "url": "https://www.sephora.com/product/eyeshadow-primer-potion-tube-original-P284716?icid2=products%20grid:p284716"
            },
            "review_body": "I went to a Christmas party last night where I knew I was going to go hard. My bff and I watched YouTube tutorials on \"the perfect smoky eye\" and I wanted to make sure it lasted all night. She told me to use this primer.\n\nI was slinging back vodka sodas like it was my job. Teetering in my heels. Spilling my drink on people. In short: I was a mess. But my eyeshadow was not. This stuff lasted through drunken tears and my head hanging in a toilet. I am attaching a photo of myself THIS MORNING to show you how my makeup didn't budge.\n\n10/10 would wear again. Would probably drink less, too.",
            "review_title": "Invincible.",
            "stars": "5 stars",
            "userid": -5360190084497896732
        },
        {
            "date": "8 Aug 2015",
            "product_info": {
                "brand": "Urban Decay",
                "name": "Eyeshadow Primer Potion - Original",
                "type": "Eye Primer",
                "url": "https://www.sephora.com/product/eyeshadow-primer-potion-tube-original-P284716?icid2=products%20grid:p284716"
            },
            "review_body": "I have to agree with many of other reviews here---the product has changed, for the worse. I had searched for years to find a primer that would keep my liquid liner in place. I have oily lids and was often in climates not good for eye makeup, such as high humidity or freezing cold (b/c your eyes tear and makeup smears). Finding this primer was a revelation---it kept my liquid liner (for reference, Kat Von D tattoo liner) in place through tears and in-climate weather and even swimming. I can say that these two products were some of the only makeup products I've encountered that NEVER let me down. Completely reliable.\n\nBut now! :( The Urban Decay primer is still okay---works well enough about 70% of the time. But when I'm at a party and someone has to tell me I have some creased eye makeup (after only wearing it for a few hours)... not acceptable. Until they bring back the old formula, it's onto the next product. Sigh, it was nice knowing you Urban Decay.",
            "review_title": "If it's not broke...",
            "stars": "3 stars",
            "userid": 6687241411791662465
        },
        {
            "date": "20 Jun 2014",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "I have been using this liner for a couple of months now, and as a cat-eye enthusiast this is by far the best product I've tried. The applicator is pretty no nonsense, if I do mess up it's due to having an unsteady hand not because the applicator is difficult to control. The color is very strong, which is perfect for some added drama. When first applied it is possible to smudge it which is ok because when you make a mistake it's easily fixable. Once dried the product becomes a little flakey, so if you do end up crying or what have you it won't smear your tears will be covered in flakes though. This stands up well too heat and cold (where I live the temps range from -40f to 90f), and as long as you don't have very moist eyes there's no reason this producer wouldn't last you all day.",
            "review_title": "Great application, with OK hold",
            "stars": "4 stars",
            "userid": 9127995013342670126
        },
        {
            "date": "23 Dec 2015",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "This eyeliner is Bomb af, This liner Hunty will not budge and it truly is Waterproof and Smudgeproof . One day I was crying mad hard because there's too many F Boys in life, and guess what? My Liner was still Slaying and cutting people",
            "review_title": "Bomb",
            "stars": "5 stars",
            "userid": 1299071796250374371
        },
        {
            "date": "6 Apr 2012",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "So I got into an arguement with my boss today, I cried for about 20 min, AND NONE OF THE EYE LINER CAME OFF. I have used countless liquid eye liners, but this is by far the best thing that has happened to me. I have used: Bobby Brown, Shu Uemura, Lancome, Yves Saint Laurent, Benefit, Sephora brand, EVERYTHING! For $20, this is totally worth it, and I highly recommend it.",
            "review_title": "20 min of crying and it DID NOT COME OFF!",
            "stars": "5 stars",
            "userid": 6365996377511985596
        },
        {
            "date": "21 Nov 2018",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "This is the first liquid eyeliner I ever bought and I really do like it a lot. The brush tip is very precise and easy to manage. The black color actually comes out sharp, bold and, most importantly not like a watered down gray. Also, once it's applied and has dried, it stays on. As someone who touches her eyelids subconsciously I don't have to worry about it flaking off. I have never really worn it an entire day but for the hours that I have, it never faded or chipped. Granted, I'm pretty sure my eyelids are quite dry. The only issue with this eyeliner is that it isn't waterproof AT ALL (which is sort of a big problem because waterproof is part of the product's name but whateva...) If you have oilier eyelids, are going out in the rain, or cry a lot, this is NOT the eyeliner for you. I found that when I messed up my wings or something I could literally take a wet Kleenex and wipe it off. With all this in mind, I do think the price could go down a little bit but overall I am pretty satisfied.",
            "review_title": "Color: Intense Black",
            "stars": "4 stars",
            "userid": 633950450327546681
        },
        {
            "date": "19 Apr 2013",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "",
            "review_title": "This eyeliner is beyond amazing. My eyes are very sensitive and will start tearing up at any little thing (wind, cold, sun in my eyes, laughing, coughing, sneezing, yawning, they’re leaky faucets!), which has been extremely aggravating because I love having winged eyeliner. Every product I’ve used hasn’t been able to handle all the tears; after an hour either my wings have completely disappeared or I look like a panda. Stila’s eyeliner is the only liquid eyeliner that has been able to hold up against my watery eyes. Whenever I get teary eyed this liner doesn’t budge, it even stands up against five minute fits of my eyes watering out of control. The felt tip also makes this liner ridiculously easy to apply; after a few practice runs I can now do perfect wings in under a minute!",
            "stars": "5 stars",
            "userid": 695677191021470525
        },
        {
            "date": "11 Aug 2013",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "I'm deployed on a ship in the middle east. I woke up with this still on from last night, some small patches were missing. Instead of cleaning it off, I just re-applied lower lid only. Went and ran 4 miles on a treadmill in 85 deg 100% humidity gym. I sweat like a horse by the way. Then the rowing machine for 1/2 hr in a space that can only be described as a steam oven. Then back in my room, I started feeling bad about the email I got earlier from my guy-finally accepting it's not what I thought it was--and had a really good cry. I looked in the mirror after all this and my eyeliner was perfect. You decide.",
            "review_title": "Weathers the Storm",
            "stars": "5 stars",
            "userid": 5389048345076505415
        },
        {
            "date": "7 Mar 2014",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "Fantastic product. Ridiculously easy to make a cat-eye, but if that's not your thing, still worth it to make either a thin or thick line. Goes on MATTE which I love (a shiny liquid liner look isn't my favourite for day), can be dressed up or down, and really will last ALL DAY, even through tears or water. I use mine daily for a cat-eye, and the pen will last about 2 months before getting dry. If I could only own two makeup products it would be this and mascara. I recommend it to everyone who asks what I use. The dark brown is a must for lighter complexions, too (especially redheads!) - great for a less harsh but still defined look.",
            "review_title": "Easy and Long-Lasting",
            "stars": "5 stars",
            "userid": 2442159263847635110
        },
        {
            "date": "26 Apr 2015",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "I tried all kinds of eyeliner. My eyes are really sensitive and i my eyes randomly start crying through out the day. This is the only eyeliner that lasts for a while along with giving me a precise application. it literally takes me a minute to do my eyeliner. But obviously, if you intentionally rub it, it will come off",
            "review_title": "AMAZING",
            "stars": "5 stars",
            "userid": 2117154057898849292
        },
        {
            "date": "23 Feb 2015",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "Everyone knows that a perfect eyeliner is a woman's life source and this product ensures you will get that perfect point every time easily! Goes on crisp and precise, and is super pigmented. Lasts all day and you don't have to worry about it running or smudging because it does not budge once you put it on! I have tried so many different brands and many different methods of eyeliner and this is the one and only eyeliner product I will get from now on and until the end of time. I cannot stress how easy it is to get perfect eyeliner with this product. I used to rip my hair out trying to perfect my eyeliner game with pencils and gels and now I get the perfect line every time in less than a minute no problem! Not sure how waterproof it is in terms of swimming but I can vouch that it wont run after long crying sessions. But, when you want it off you can get it off easy peasy! This product should be a permanent staple in every woman's makeup bag for sure!",
            "review_title": "best eyeliner out there!",
            "stars": "5 stars",
            "userid": -7719590767611841479
        },
        {
            "date": "8 Jun 2016",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "I have the most oily eyelids and my eyes pour out tears all the time. By some miracle this stays on -- even without primer. If you sleep in this you will wake up with it flawless. Yet it is easily budged if you make a mistake and comes off easily AND is thin enough to put on bottom lashline. Honestly I don't know how they did it thank you Stila. \r\n\r\nTIP: if you get a bad one (dries out), RETURN it. I did and LOVED my second one. I've had it for several months now, still perfect.",
            "review_title": "WITCHCRAFT",
            "stars": "5 stars",
            "userid": 59460912866302822
        },
        {
            "date": "5 May 2013",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "I have tried all kinds of eye liners and have had the problem of the line sticking to my upper lid, or just not lasting. This eye liner is the best I've found yet! It goes on and stays on! If you're teary eyed or cry, it still stays put. Love it! Thank you Stila!!",
            "review_title": "My favorite eye liner!",
            "stars": "5 stars",
            "userid": -8911291039448486504
        },
        {
            "date": "19 Jan 2017",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "",
            "review_title": "This liquid eyeliner is the best liquid eyeliner. I have tried countless liquid eyeliners, including both high-end and foreign brands, and I always return to Stila's. It's super long-lasting, lasts through heavy rain and crying, and is a fantastic deep black with only one pass. The foam brush isn't my favorite, but it's easy to use and the formula makes up for it.",
            "stars": "5 stars",
            "userid": -8603124028961888795
        },
        {
            "date": "10 Mar 2017",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "Ok so I've come to terms with the fact that NO liquid eyeliner is completely waterproof, not this or Kay von d or Marc jacobs or any of them. But I love the liquid eyeliner look so I do this trick. I love the Stila liquid eyeliner so I do my eyes with that first - after primer and eyeshadow- and let it dry. Then I sharpen my tarte sex kitten eyeliner to a nice point and go overtop the stila liner very carefully. THIS combo is actually waterproof-my eyes constantly water especially in cold weather and this stays put. This way I get the look of liquid with the waterproof-ness of the crayon. And if you really want it to stay, top off with eyeshadow  over top, I use a fine eyeliner brush to make sure I stay in the original lines. This stays put through crying and everything. Hope this helps someone!",
            "review_title": "looks awesome",
            "stars": "4 stars",
            "userid": 4483499487755972325
        },
        {
            "date": "23 Oct 2013",
            "product_info": {
                "brand": "Stila",
                "name": "Stay All Day® Waterproof Liquid Eye Liner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/stay-all-day-waterproof-liquid-eye-liner-P253818?icid2=products%20grid:p253818"
            },
            "review_body": "I was looking for a long lasting eyeliner, because mine tends to start fading and smudging by mid-morning. This has stood up to every test: exercise, humid weather, watery eyes, tears, napping, etc! There is only one problem with this eyeliner: if I don't let it dry enough, it will start sticking to the skin just above my eyelid crease, which is not only annoying but leads to smudging. I've never had to specifically let an eyeliner dry before, so it's kind of odd. But I just use that time to carefully do my brows and eyelashes, so it's not a big deal to me.",
            "review_title": "really will stay ALL day",
            "stars": "4 stars",
            "userid": 6398592789726846937
        },
        {
            "date": "6 Mar 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "My makeup lasted all night from 10:30 to 4:30 am. And my make up survived a night of bar hopping and crying. It was still perfect when I got back home.",
            "review_title": "magical",
            "stars": "5 stars",
            "userid": -4636237451130421212
        },
        {
            "date": "4 Sep 2014",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "i've used UD all nighter for a couple years now: it hasn't once let me down. i have very very dry skin and therefore use foundations that are quite moisturizing, like bobbi brown's tinted balm, and i never powder my face. (at most i use a tiny amount to spot powder over concealer and that's it.) despite all that, this makes my makeup stay in place and not transfer to clothing / seatbelts / my spouse lol.\n\ni've recently found a couple uses for it that make all nighter even more of a go-to product for me. i have hooded eyes and eyeliner transfer has *always* been a problem -- until now. i use a tiny liner brush, load it with a dark eyeshadow, mix it with a dot of this spray, and then apply it like eyeliner. no transfer, no smudging (even with tears and rubbing), and no fading. love. i also recently saw a wayne goss vid where he used setting spray to set under eye concealer -- works like a charm and is now my #1 concealer \"trick\" to prevent creasing.",
            "review_title": "has many uses and is totally worth the cost",
            "stars": "5 stars",
            "userid": -5237334032735782761
        },
        {
            "date": "17 Oct 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "Let me tell you a horror story that my makeup survived through because of this spray. So my boyfriend and I broke up, I got into a car accident in the rain, and waited over a hour for a tow truck in the rain while also crying and fighting with my ex boyfriend. Lots of crying and rain that day. But when I got home and looked in the mirror, my makeup didn't smudge at all, eyeliner, eyeshadow and countour was still on point! This spray is a Miricle worker and helped me still look amazing during the worst breakup of my life! Highly recommend",
            "review_title": "makeup God",
            "stars": "5 stars",
            "userid": -4879190538802751293
        },
        {
            "date": "11 Feb 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "I went to Sephora to do my makeup and I put this on walked out came home to a stressful situation only to find out after 20 tissues that my makeup stayed on perfect as if I hadn't cried buckets. Truly amazing and made me feel a lot better once I was done crying that it actually works!",
            "review_title": "Amazing",
            "stars": "5 stars",
            "userid": -8886593350805904816
        },
        {
            "date": "14 Feb 2017",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "Okay so quick story time. Last year I lost 4 members of my family, one being my grandfather who I was really close to. Every year for Valentine's he would get me roses, and would have them delivered when I went to college. This year, I wasn't expecting anything to come out of today, but a random guy in my college gave me the exact same rose that my grandfather used to get me. Personally, I see this as a sign so I got emotional and I cried. Then I got angry at myself because I had done my makeup and I was going to have to fix it because even though my mascara and eyeliner are waterproof, they always run. I was surprised to see that my makeup was intact. I recently bought this setting spray and I can tell you that it does the job. Tested and proved from ugly crying for an hour about a deceased love one. If that doesn't prove how awesome it is, I don't know what will.",
            "review_title": "Y'ALL.",
            "stars": "5 stars",
            "userid": -6178467346583807370
        },
        {
            "date": "17 Feb 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "I watch greys on the daily, so obviously, I cry on the daily. I never appreciated this so much as when I sobbed over pulling the plug on **** and MY MAKEUP STAYED. My foundation and concealer and contour and eyeshadow and everything still looked flawless after sobbing uncontrollably for an hour, allowing me to go in public still looking flawless 11/10",
            "review_title": "greys anatomy",
            "stars": "5 stars",
            "userid": -4101847069557899467
        },
        {
            "date": "4 May 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "I spent like 20 minutes in my professors office crying, trying to get him to round my grade in my favor (he didn't) but when I left my makeup was still perfectly in place!!! no tear streaks, highlight still on fleek, cheek bones defined AF,even my under eye shadow stayed. Everyone needs this. Buy it, buy two. It's worth it",
            "review_title": "AMAZING",
            "stars": "5 stars",
            "userid": 3182221909097702302
        },
        {
            "date": "23 Jan 2011",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "Product: Urban Decay Long-Lasting Makeup Setting Spray (29.00 for 4.0 fluid ounces)\nShade: Clear\n\n>> I didn't expect much when I got this, especially because I've never tried setting sprays before. Urban Decay claimed a lot of things about this, and usually I don't list what the company says, but just take a look...\n\n>> What it does: It's the new final step to your makeup routine! This weightless, super-fine mist holds foundation, eyeshadow, blush, and concealer in place so that makeup looks picture-perfect all day long. Temperature Control Technology prevents makeup from a melt down when it's warm and avoids makeup dehydration and cracking when it's cold. All Nighter works expertly on all skin types and prevents loss of color, melting, sliding, caking, cracking, excess shininess, fading blush, eyeshadow, and lip color disappearance. AND it's formulated to resist moisture, so you can fearlessly sweat, cry, or get your Jacuzzi on—you're guaranteed makeup that always looks just-applied, without ever feeling sticky or tight. Backed by years of science, All Nighter is simply unlike any other product available and keeps you looking flawless with just a couple sprays on top of your makeup.\n\n>> What else you need to know: All Nighter is allergy tested, dermatologist tested, vegan, cruelty free, and free of oil, parabens, and fragrance.\n\n>> Research Results: 81.8% of customers say product gave makeup a healthy glow. 78.8% of customers said product helped makeup avoid creasing. 75.7% of customers said makeup looked as good at end of the day as at the beginning of the day.\n\n>> Wow. A spray that is lightweight, super-fine, sets eye makeup, sets face makeup, sets lip makeup, uses temperature control technology, works on all skintypes, prevents de-pigmentation, prevents melting, prevents sliding, prevents caking, prevents cracking, prevents shine, prevents fading, prevents creasing, resists moisture, gives a healthy glow, and makes makeup look the same at the end of the day.\n\n>> Um... is it just me or is that a TON to offer! After reading that mouthful I was very skeptical of this product. Was Urban Decay just \"fluffing\" up the description. I was wrong. This spray really does all of that, I really wish I could just give this an A++++++++ to the millionth power. I was so surprised at how awesome this stuff is, anyways into the in-depth review.\n\n>> This spray is created by Urban Decay but uses formulations from Skindinanvia, or a brand that specifically creates setting sprays. I received this in a small bottle and followed the instruction by simply shaking and then spraying on the face. I like to make sure that everything is always even, so even though the bottle says spray 2-4 times I might of sprayed 5-8 times very lightly to make sure my whole face was covered. When I was spraying this on I thought it would feel very sticky or gooey on the face, or basically uncomfortable. Instead it felt like I was misting very \"finely milled... water\" on my face. The spray is very thin and feels as light as air on the face, as if you're running through a park in the early morning. Just a fine amount of dew on the face, very refreshing. The spray takes about 10-15 seconds to dry depending on how much you applied. So, overall the application was easy and the spray felt very refreshing. I noticed a slight 'sugary' fragrance, even though this is fragrance free; so maybe it's my imagination. Overall it just smells (not a bad thing) just when spraying; but the all of the scent disappears after it dries.\n\n>> Just to make it clear, I've seen people on Youtube spray this before applying makeup. According to the bottle you spray it on AFTER you apply makeup, so make sure you use it after makeup application. It will not work as well if you apply it beforehand because you are simply \"setting\" your natural skin. If you do have dry or oily skin setting beforehand can help makeup application go on easier though.\n\n>> Now here came the true test, to see if my makeup stayed on all day and really did the things that Urban Decay listed it did. After a 14 hour day, none of my makeup had changed. (Urban Decay claimed that this stuff works for 16 hours, and I believe them.) My makeup looked exactly the same. Obviously this didn't do anything for my tightline because the spray can't magically fly into my eye and along the inner rims. All my eyeshadow, eyeliner, mascara, concealer, tinted moisturizer, blush, highlighter, lip stain, etc. seemed to have stayed in-tact. It literally looked the same as it did when I had applied it in the morning. For temperature control these past weeks have been relatively cold because of winter. I didn't notice any flaking at all (score!), since I have dry skin this was surprising. (I was thinking of buying the version for dry skin, know as Dew Me, but this works fine. They also have a version for oily skin known as De-Slick.) I did test this out when I went out on a jog, and I noticed that my makeup didn't melt off and my skin didn't feel uncomfortable, (score again!).\n\n>> I can definitely see how this works on all skin types. I have slight combination skin meaning half of the time my skin can be normal. (No oil, no dry patches) While other times I can have lots of oil and blocked pores in my T-Zone, or forehead, nose, and chin. I will also have dry patches on my cheeks and around my nose also. This didn't disturb my skin type by making me any oilier or any drier, which is nice to know. If you have severely oily or severely dry skin I recommend trying out Dew Me or De-Slick, which are the same things but are formulated for certain skin types. I noticed that it did prevent all the things above, de-pigmentation (fading), melting, sliding, caking, cracking, creasing, bla bla bla. My makeup did look the same as it did in the morning and my skin had a soft healthy glow, something like a lit from within appearance. As you can see this setting spray is amazing and I apply it on to all of my makeup looks that I wear outside.\n\nEffectiveness: 10/10\nValue: 10/10\nPackaging: 10/10\nEase Of Use: 10/10\nOverall: 10/10\n\nGrade: A+\nOne of the best products I have ever tried. Truly.",
            "review_title": "ALL NIGHTER, WHERE HAVE YOU BEEN MY WHOLE LIFE?",
            "stars": "5 stars",
            "userid": -2690160197881037644
        },
        {
            "date": "9 Feb 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "I used to hate crying in public because my makeup would come off but I can cry whenever I want now because I can cry for like two hours and, unlike my life, my make up will still be perfect.",
            "review_title": "This stuff stays!",
            "stars": "5 stars",
            "userid": -7680499168005774128
        },
        {
            "date": "22 Feb 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "My makeup lasted me through out 2 hours of crying. All in all my makeup was still perfect afterwards even if my heart was not. Definitely would 100% recommend especially if you are a cake face like I am.",
            "review_title": "works wonders",
            "stars": "5 stars",
            "userid": -1552850517554500291
        },
        {
            "date": "10 Aug 2010",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "Used this for an outdoor/indoor wedding on myself, the bride and a couple of other bridesmaids. I sprayed the front and sides of the face for each girl. Other than lipgloss (which was expected) we didn't have to touch up even after 12 hours! By the time it was time to take it off, my makeup still looked beautiful.\n\nThe bride and I have dry skin and another bm who used this has combo/oily skin and it does seem to work for all our skin types. If you have really dry or really oily skin, the UD website has 2 other kinds of setting sprays you can choose from but I chose this one for our bridal party.\n\nGranted, it wasn't too hot or too humid or rainy outside so I have no idea how this works against the elements. Also, all us girls miraculously were able to hold in our tears (I suppose we were just too harried and busy to cry) so I also am not sure how this spray would hold up to that. But I know that using this definitely can't hurt--after all, I have never gone 12 hours without touching my makeup before--until I used this.",
            "review_title": "All nighter AND All-day!",
            "stars": "5 stars",
            "userid": -6399125363368757942
        },
        {
            "date": "24 May 2016",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "THIS SURVIVED ALL OF MY EMOTIONAL THERAPY SESSIONS. LASTED THROUGH DADDY ISSUES, LOW SELF ESTEEM AND ALL OTHER CRYING FACTORS. BAWLED MY EYES OUT BUT MY FACE STILL BEAT, HIGHLIGHT STILL POPPIN, CONTOUR STILL SHARP AS A KNIFE. 10/10 WOULD RECOMMEND.",
            "review_title": "DONT SLEEP ON THIS",
            "stars": "5 stars",
            "userid": -3625170630658241065
        },
        {
            "date": "28 May 2018",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "Idk what they put in this but i know its some black magic or whatever. I got my feelings hurt and cried like heavy crying and using multiple tissues then after i see my makeup just like stayed on for the most part im shocked i even have any on, urban decay u a real one thanks boo",
            "review_title": "Handled my breakdown like a champ",
            "stars": "5 stars",
            "userid": 8373073925651146375
        },
        {
            "date": "1 Jul 2013",
            "product_info": {
                "brand": "Urban Decay",
                "name": "All Nighter Long-Lasting Makeup Setting Spray",
                "type": "Setting Spray",
                "url": "https://www.sephora.com/product/all-nighter-long-lasting-makeup-setting-spray-P263504?icid2=products%20grid:p263504"
            },
            "review_body": "This setting spray was a first time purchase for me by one of the sales associates at my Sephora location. I teach/dance salsa and sweat quite a bit and I mentioned while shopping that I needed something to try and control the streaky mess my eye makeup becomes after dancing. It works very well unless you get it in your eye (which I did) and it stung very badly and I needed to begin my makeup all over again because of the tears! As long as you do not spray it in your eyes on accident you should be good to go!",
            "review_title": "Good Makeup Staple!",
            "stars": "4 stars",
            "userid": -8235481354668335298
        },
        {
            "date": "8 Jul 2018",
            "product_info": {
                "brand": "FENTY BEAUTY BY RIHANNA",
                "name": "Flyliner Longwear Liquid Eyeliner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/flyliner-longwear-liquid-eyeliner-P17876556?icid2=products%20grid:p17876556"
            },
            "review_body": "I put this eyeliner on at 5:30pm and it lived through a street festival, crowded bar with no AC, and a 45 min ugly cry session in the back of an Uber. Best purchase ever.",
            "review_title": "Color: Cuz I'm Black",
            "stars": "5 stars",
            "userid": 5037823724754110539
        },
        {
            "date": "10 Feb 2019",
            "product_info": {
                "brand": "FENTY BEAUTY BY RIHANNA",
                "name": "Flyliner Longwear Liquid Eyeliner",
                "type": "Liquid Eyeliner",
                "url": "https://www.sephora.com/product/flyliner-longwear-liquid-eyeliner-P17876556?icid2=products%20grid:p17876556"
            },
            "review_body": "I’ve been a long time advocate for Stilas liquid eyeliner, due to water proof necessities. But this stuff is truly amazing. I highly recommend it. I’ve gone through rain, sleeping, crying etc and this stuff didn’t smudge a bit",
            "review_title": "Color: Cuz I'm Black",
            "stars": "5 stars",
            "userid": 7575807128304378191
        },
        {
            "date": "19 Oct 2014",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "I got a sample of this with an order and really liked it so I ordered a full sized one in another shade. When I went in to have a \"make-over\" the beauty advisor noticed my one eye tears up due to allergies and this was the product she chose for me. It's absolutely wonderful. It goes on smooth and creamy. It also smudges wonderfully unlike other products I've used in the past. I purchased the black and will be purchasing the full size product I got the sample of in the Brown (Out).",
            "review_title": "Great Product!",
            "stars": "5 stars",
            "userid": 1893401604006928753
        },
        {
            "date": "28 Jul 2014",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "I am an Asian girl. This gel eye liner is really smooth. It is easy to draw.It is really Waterproof. Even when you are crying, it will still stay the place. (My english is still need to be improved. I just want to say this is the best one)",
            "review_title": "Best gel eye liner ever",
            "stars": "5 stars",
            "userid": -2295868902851354879
        },
        {
            "date": "9 Nov 2016",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "I have just about every color of these eyeliners.  I love them that much.\r\n\r\nToday was an especially trying. Day after election and crying jags.  The only eye makeup that was still on my eyes at the end of the workday was Blue Me Away.  It was not as bright as it started out 9 hours earlier but I still had to clean it off.  That's an amazing brand of eyeliner.",
            "review_title": "Crying Jags All Day - Blue Me Away Lasted",
            "stars": "5 stars",
            "userid": -3215295374517720330
        },
        {
            "date": "11 Nov 2013",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "Ok. I'm always wearing PENCIL eyeliner (because i'm really bad with liquid liner) and this one is just...WOW! My 24/7 from Urban Decay is crying, lost somewhere in my purse, since i got this one. (In blacker by the way). It gives you a straight, rich line, perfect for a long wearing and well defined cateye. You can really feel and see the gel formula. This work as well as a gel liner, but way more practical. A little expensive, but i'll rebuy for sure. Skip 5 or 6 latte and go get your own!!\n(excuse my english, i'm french) xx",
            "review_title": "HOLY GAIL!",
            "stars": "5 stars",
            "userid": -2528685123537685713
        },
        {
            "date": "24 Feb 2017",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "I find it so hard to believe that this eye liner - it just stays on your eyelids for a whole day. you can sweat or cry or anything, they just don't fade away! The only thing is, you need to DEVOTE some TIME when you remove them. Bette use eye makeup remover cuz normal ones just don't work for them",
            "review_title": "I'm speechless",
            "stars": "5 stars",
            "userid": 4955875515743605683
        },
        {
            "date": "13 Feb 2017",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "Let me start off by saying, I am a cry baby. Follow along, I have a point...I mean, I cry at everything. Movies, Commercials, kids walking in the rain, stray animals. I might as well be a water fountain, and so obvi, I can't wear eyeliners in my river/ocean/faucet line...ahem...waterline. UNTIL NOW. \r\nThis stuff stays put and dries fast. This stuff wins at life, in fact, this stuff doesn't even breathe, but has a better life than I do. It's magical. \r\nInfluenster and MarcBeauty were kind enough to choose me to snag two of these babies via a voxbox for free, and they sent me Earthquake which a gorgeous milk chocolate brown, and Pink of Me, which is a powder pink shade but looks white on my brown skin. I used Pink of Me as a full lid base, with Earthquake as a winged liner, and OHHHH BABY, Hot fire. They looked GOOD and stayed PUT.\r\n\r\nMy only wahh wahh sob story complaint is that they set so quickly, they are hard to blend. So if you want to blend them out, girrrrrlll, you better WERK those blending muscles quickly.",
            "review_title": "Super Pigmented and Permanent",
            "stars": "4 stars",
            "userid": -264867155787328160
        },
        {
            "date": "11 Apr 2016",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "I love it. Doesn't move an inch. I went four wheeling and had tears coming out of my eyes and it didn't budge at all. Definitely worth getting!",
            "review_title": "Amazing!",
            "stars": "5 stars",
            "userid": 5968357598893561291
        },
        {
            "date": "27 Jan 2016",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "i received a birthday gift including this liner in black, the description does not lie. it goes on smooth with bold color in one sweep. extremely smudge resistant, and water resistant (i guess i wouldn't go so far as to say waterproof, but if you were caught in the rain, or crying, it stays put pretty well) also, not too difficult to remove at the end of the day. I would definitely recommend, and will be getting another as soon as this one runs out.",
            "review_title": "LOVE IT",
            "stars": "5 stars",
            "userid": -6284060861136884029
        },
        {
            "date": "30 Aug 2014",
            "product_info": {
                "brand": "Marc Jacobs",
                "name": "Highliner Gel Eye Crayon Eyeliner",
                "type": "Gel Eyeliner",
                "url": "https://www.sephora.com/product/highliner-gel-crayon-P379434?icid2=products%20grid:p379434"
            },
            "review_body": "",
            "review_title": "This eyeliner didn't smear, or even budge a bit while i was crying after i tore off my toe nail. And i cried alot.",
            "stars": "5 stars",
            "userid": -6654382621917491354
        },
        {
            "date": "7 d ago",
            "product_info": {
                "brand": "Tom Ford",
                "name": "Emotionproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433"
            },
            "review_body": "",
            "review_title": "I received this mascara free for review from Influenster. This mascara is truly emotion proof!! I was able to wear it on a recent trip to Florida, it did not smudge, I was able to wear it in the water and it also withstood tears! I am very impressed!",
            "stars": "5 stars",
            "userid": -3444810546799639484
        },
        {
            "date": "14 d ago",
            "product_info": {
                "brand": "Tom Ford",
                "name": "Emotionproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433"
            },
            "review_body": "I agree with another girl in the reviews the wand is super long! But I did really like the stay of it! I was wearing it on the I got engaged and was afraid it was going to smear but nope! It stayed put even after all the tears!!! I did receive this from Influenster for testing purposes. If you have the money do it if not I’d pass",
            "review_title": "stayed put during my engagement!",
            "stars": "3 stars",
            "userid": -516082528867861824
        },
        {
            "date": "6 d ago",
            "product_info": {
                "brand": "Tom Ford",
                "name": "Emotionproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433"
            },
            "review_body": "This is the most amazing mascara i ever tried! I can sweat , cry and rubber my eyes without getting a black patch all over my face and eyes! I love this is the best mascara ever ! I totally recommend it !",
            "review_title": "Emotionless proof mascara",
            "stars": "5 stars",
            "userid": 2254664000393110887
        },
        {
            "date": "17 d ago",
            "product_info": {
                "brand": "Tom Ford",
                "name": "Emotionproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433"
            },
            "review_body": "I received this product in exchange for a review. I have sensitive eyes so eye cream shadow etc can cause tears, redness, irritation,. I was impressed by this since the wand is lightweight and easy to use. No harsh smells. The best is that it is not clumpy and goes on lightly and is buildable. I highly recommend this.",
            "review_title": "Love this",
            "stars": "4 stars",
            "userid": -4088405362433843863
        },
        {
            "date": "15 d ago",
            "product_info": {
                "brand": "Tom Ford",
                "name": "Emotionproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433"
            },
            "review_body": "One of the best mascaras I have tried in my life. It works well with two coats to get it to my liking and held up through a very eventful concert full of all kinds of emotions. From sweating to crying it stayed on all day and partial night until I took it off. KEPT MY LASHES LOOKING LONG AND LUCIOUS WITHOUT HAVING TO CURL THEM !!!! Although if I had to have one bad thing to say it would probably have to be I’d you’ve applied your skin care routine and any residue is left on the lashes it’s best to wipe them clean and apply the mascara after !",
            "review_title": "Great Product",
            "stars": "4 stars",
            "userid": -6721246306164817333
        },
        {
            "date": "7 d ago",
            "product_info": {
                "brand": "Tom Ford",
                "name": "Emotionproof Mascara",
                "type": "Mascara",
                "url": "https://www.sephora.com/product/emotionproof-mascara-P445433?icid2=products%20grid:p445433"
            },
            "review_body": "I recieved my Tom Ford Emotionproof Mascara from my Influenster VoxBox! This beautiful non-pastey, scentless and weightless formula gives a natural look with the help of a long wand! The formula is weightless when applied to your lashes and provides great separation. It owns up to its name by not smudging or coming off with water (or tears!)",
            "review_title": "Owns Up to the Name!",
            "stars": "5 stars",
            "userid": 6510892111931669984
        }
    ]
}